Процедура ДатьЗнать() Экспорт
   чис = 5 / 0;

	ДобавитьЗаписьВЖурналРегистрации();
   ОбщегоНазначенияСлужебныйСервер.ИнформироватьПользователя("НЕ ВИЖУ ))");
КонецПроцедуры

Процедура ДобавитьЗаписьВЖурналРегистрации()

    //Индексы хранятся в каталоге 1Cv8Log в файлах с расширением .lgx
    ЗаписьЖурналаРегистрации("ПРОВЕРКА УСПЕШНАЯ.", УровеньЖурналаРегистрации.Информация,,,
    "Выполнено на ура", РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
    //ЗаписьЖурналаРегистрации(<ИмяСобытия>, <Уровень>, <ОбъектМетаданных к которому относится событие>, <Данные>, <Комментарий>, <РежимТранзакции>)
    //Обработчик...

КонецПроцедуры
