
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТекДокумент = ПараметрыВыполненияКоманды.Источник.Объект;
	
	Если ИсключительнаяСитуация(ТекДокумент) Тогда
		
		Информация = ОписаниеИсключительнойСитуации(ТекДокумент);
		ОбщегоНазначенияКлиент.СообщитьПользователю(Информация);
		
		Возврат;
		
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ОтображатьСетку = Ложь;
	
	ОтправитьИнформациюОДоговорахНаПочту(ТабДок, ПараметрКоманды);

КонецПроцедуры

&НаСервере
Процедура ОтправитьИнформациюОДоговорахНаПочту(ТабДок, ПараметрКоманды)
	Документы.Ведомость.СоздатьИОтправитьСообщениеПочтой(ТабДок, ПараметрКоманды);
КонецПроцедуры

// Проверяет возможность отправки письма на почту.
//
// Параметры:
//  ТекДокумент  - ДанныеФормыСтруктура - данные формы текущего документа.
// Возвращаемое значение:
//   Булево   - наличие исключительной ситуации
//
&НаКлиенте
Функция ИсключительнаяСитуация(ТекДокумент)

	Возврат Не ТекДокумент.Проведен Или ТекДокумент.Договоры.Количество() = 0 Или Не ЗначениеЗаполнено(ТекДокумент.Менеджер);

КонецФункции

// Возвращает информацию почему не отправлено письмо на почту.
//
// Параметры:
//  ТекДокумент  - ДанныеФормыСтруктура - данные формы текущего документа.
// Возвращаемое значение:
//   Строка   - текстовое описание ситуации.
//
&НаКлиенте
Функция ОписаниеИсключительнойСитуации(ТекДокумент)
	
	Если Не ТекДокумент.Проведен Тогда
		Текст1 = "Документ не проведен.";
	КонецЕсли;
	
	Если	Не ЗначениеЗаполнено(ТекДокумент.Менеджер) Тогда	
		Текст3 = "В документе не заполнен реквизит 'Менеджер'.";
	КонецЕсли;
	
	Если	ТекДокумент.Договоры.Количество() = 0 Тогда
		Текст2 = "В табличной части документа нет Договоров.";	
	КонецЕсли;	

	Возврат СтрШаблон(НСтр("ru = '%1 %2 %3
		                           |Отправка письма на почтовый ящик не возможна.'"), Текст1, Текст2, Текст3);

КонецФункции

