#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
	
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("НачалоДействия") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПоискПоДатеДокумента(ДанныеВыбора, Параметры);
		                                                                                                 
	КонецЕсли;
	
КонецПроцедуры
	
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = ?(Данные.Активен, 
		СтрШаблон("%1 (А)", Данные.Наименование), 
		СтрШаблон("%1 (%2)", Данные.Наименование, Формат(Данные.ОкончаниеДействия, "ДЛФ=Д")));
	
КонецПроцедуры
	
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("Активен");
	Поля.Добавить("ОкончаниеДействия");
	
КонецПроцедуры
	
#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции
	
// Делает отбор договоров при поиске по Наименованию или Коду. 
// Используется в документе Ведомость при заполнении таблицы ДоговорыВСтроке. 
//
// Параметры:
//  ДанныеВыбора  - параметры события 'ОбработкаПолученияДанныхВыбора'.
//  Параметры  - параметры события 'ОбработкаПолученияДанныхВыбора'.
//
Процедура ПоискПоДатеДокумента(ДанныеВыбора, Параметры)
	
	ДанныеВыбора = Новый СписокЗначений; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Договоры.Ссылка КАК Ссылка,
		|	Договоры.Код КАК Код,
		|	Договоры.Представление КАК Представление
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|ГДЕ
		|	Договоры.НачалоДействия <= &ДатаДокумента
		|	И Договоры.Наименование ПОДОБНО &СтрокаВвода";
	
	Если СтрПодобнаПоРегулярномуВыражению(Параметры.СтрокаПоиска, "^\d+$") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Договоры.Наименование", "Договоры.Код");
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("ДатаДокумента", Параметры.Отбор.НачалоДействия);
	Запрос.УстановитьПараметр("СтрокаВвода", Параметры.СтрокаПоиска + "%");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Индекс = -1;
	
	Если СтрПодобнаПоРегулярномуВыражению(Параметры.СтрокаПоиска, "^\d+$") Тогда
		
		Пока Выборка.Следующий() Цикл
			Индекс = Индекс + 1;
			ДанныеВыбора.Вставить(Индекс, Выборка.Ссылка, Выборка.Код + " " + "("+ Выборка.Представление +")");
		КонецЦикла;
		
	Иначе
		
		Пока Выборка.Следующий() Цикл
			Индекс = Индекс + 1;
			ДанныеВыбора.Вставить(Индекс, Выборка.Ссылка, Выборка.Представление + " " + "("+ Выборка.Код +")");
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли


