#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверкаДатДействияДоговоров(Отказ);
	
	ПроверкаДоговоровНаДубли(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет даты начала действия и окончание действия договора, чтобы дата начала
// не была больше даты окончания. Информирует пользователя если даты не правильны во времени.
//
Процедура ПроверкаДатДействияДоговоров(Отказ)
	
	Если НачалоДействия >= ОкончаниеДействия  Тогда 
		Информация = "Дата начала действия договора не может быть равна или больше даты окончания договора.";
		ОбщегоНазначенияСлужебныйСервер.ИнформироватьПользователя(Информация, Отказ);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет на наличие дублей при создании элемента справочника и информирует пользователя если дубль найден.
// 
Процедура ПроверкаДоговоровНаДубли(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Договоры.Код КАК Код
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Наименование = &Наименование
	|	И Договоры.НачалоДействия = &НачалоДействия
	|	И Договоры.ОкончаниеДействия = &ОкончаниеДействия";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("НачалоДействия", НачалоДействия);
	Запрос.УстановитьПараметр("ОкончаниеДействия", ОкончаниеДействия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		
		ДублиДоговоров = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Активен <> ЭтотОбъект.Активен Тогда			
				Продолжить;				
			КонецЕсли;
			
			ДублиДоговоров.Добавить(Выборка.Код);
			
		КонецЦикла;
		
		Если ДублиДоговоров.Количество() > 0 Тогда
			
			Информация = СтрШаблон("Ошибка записи, договор с такими параметрами существует. Код %1.", СтрСоединить(ДублиДоговоров, ", "));
			ОбщегоНазначенияСлужебныйСервер.ИнформироватьПользователя(Информация, Отказ);	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли