
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектИсточник = Параметры.Объект;
	
	СвойстваИсключения = "Результат, ЗахваченныеОбъекты, ПравилаПоддержкиОбъектов, СтруктураКонфигурации, СоставПодсистем, ТаблицаИзмененныхОбъектовИСтандартов";
	ЗаполнитьЗначенияСвойств(Объект, ОбъектИсточник,, СвойстваИсключения);
	ЗаполнитьТаблицуОбъекта(ОбъектИсточник, "СтруктураКонфигурации");
	ЗаполнитьТаблицуОбъекта(ОбъектИсточник, "СоставПодсистем");
	
	ЗаполнитьСписокВыбранныхПодсистем();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.СтруктураКонфигурации.Количество() = 0 Тогда
		ПодключитьОбработчикОжидания("ВопросПриОткрытииФормы", 0.1, Истина);
	Иначе
		Состояние(НСтр("ru='Построение дерева структуры конфигурации';
			|en='Построение дерева структуры конфигурации'", Объект.КодОсновногоЯзыка));
		ПостроитьДеревоСтруктурыКонфигурации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Объект", Объект);
	ПараметрыОповещения.Вставить("ОбновитьТаблицуСтруктуры", ОбновитьТаблицуСтруктуры);
	
	Оповестить("апк_ЗакрытиеФормыВыбораОбъектов", ПараметрыОповещения, ВладелецФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтруктураКонфигурацииФлагПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоСтруктурыКонфигурации.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеФлага = ТекущиеДанные.Флаг;
	
	Если ЗначениеФлага = 0 ИЛИ ЗначениеФлага = 1 Тогда
		ТекущиеДанные.Флаг = 1;
		УстанавливаемоеЗначение = 1;
	Иначе
		ТекущиеДанные.Флаг = 0;
		УстанавливаемоеЗначение = 0;
	КонецЕсли;
	
	КоллекцияЭлементов = ТекущиеДанные.ПолучитьЭлементы();
	ОтметитьВсеПодчиненныеОбъекты(КоллекцияЭлементов, УстанавливаемоеЗначение);
	
	УстановитьФлагРодителю(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	УстановитьЗначениеФлагов(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	
	УстановитьЗначениеФлагов(0);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоПодсистемам(Команда)
	
	Состояние(НСтр("ru='Построение дерева подсистем'; en='Построение дерева подсистем'", Объект.КодОсновногоЯзыка));
	
	Параметр = Новый Структура("СтруктураКонфигурации", Объект.СтруктураКонфигурации);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОкончанияВыбораПодсистем", ЭтотОбъект);
	
	МассивИмениФормы = СтрРазделить(ИмяФормы, ".");
	Если МассивИмениФормы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВидОбработки = МассивИмениФормы[0];
	
	ОткрытьФорму(СтрШаблон("%1.АвтоформатированиеКодаИЛокализация.Форма.ОтборПоПодсистемам", ВидОбработки), Параметр, ЭтаФорма,
		УникальныйИдентификатор,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Принять(Команда)
	
	ЗаполнитьФлагиВСтруктуруКонфигурации();
	ЗаполнитьВыбранныеПодсистемыКонфигурации();
	ОбновитьТаблицуСтруктуры = Истина;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	Объект.СтруктураКонфигурации.Очистить();
	Объект.СоставПодсистем.Очистить();
	ВыбранныеПодсистемы.Очистить();
	Элементы.ДеревоСтруктурыКонфигурацииОтборПоПодсистемам.Пометка = Ложь;
	ОбновитьТаблицуСтруктуры = Истина;
	
	ЗагрузитьСтруктуруКонфигурации();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВопросПриОткрытииФормы()
	
	ОписаниеОповещение = Новый ОписаниеОповещения("НачатьЗагрузкуСтруктурыКонфигурации_ДиалогПоказан", ЭтотОбъект);
	ТекстВопроса = НСтр("ru='Для выбора состава объектов требуется собрать сведения о конфигурации.
		|Эта операция может занять длительное время. Продолжить?';
		|en='Для выбора состава объектов требуется собрать сведения о конфигурации.
		|Эта операция может занять длительное время. Продолжить?'", Объект.КодОсновногоЯзыка);
	ПоказатьВопрос(ОписаниеОповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗагрузкуСтруктурыКонфигурации_ДиалогПоказан(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Закрыть();
	Иначе
		ЗагрузитьСтруктуруКонфигурации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСтруктуруКонфигурации()
	
	// Установим флаг выгрузки и загрузки в зависимости от типа источника.
	Объект.ВыгружатьКонфигурациюВФайлыXML = (Объект.ТипИсточника <> 2);
	
	ХранилищеУказано = НЕ ПустаяСтрока(Объект.КаталогХранилища);
	
	Если Объект.ВыгружатьКонфигурациюВФайлыXML Тогда
		
		Если ХранилищеУказано Тогда
			Состояние(НСтр("ru='Выполняется загрузка конфигурации из хранилища';
				|en='Выполняется загрузка конфигурации из хранилища'", Объект.КодОсновногоЯзыка));
			
			Статус = ЗагрузитьКонфигурациюИзХранилища();
			Если ПустаяСтрока(Статус) Тогда
				апк_Сообщить(НСтр("ru='Конфигурация успешно загружена из хранилища.';
					|en='Конфигурация успешно загружена из хранилища.'", Объект.КодОсновногоЯзыка));
			Иначе
				апк_Сообщить(Статус);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Состояние(НСтр("ru='Выполняется выгрузка конфигурации в файлы XML';
			|en='Выполняется выгрузка конфигурации в файлы XML'", Объект.КодОсновногоЯзыка));
		
		Статус = ВыгрузитьКонфигурациюВФайлыXML();
		Если ПустаяСтрока(Статус) Тогда
			апк_Сообщить(НСтр("ru='Выгрузка конфигурации в файлы XML завершена.';
				|en='Выгрузка конфигурации в файлы XML завершена.'", Объект.КодОсновногоЯзыка));
			Состояние();
		Иначе
			апк_Сообщить(Статус);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Состояние(НСтр("ru='Сбор сведений о структуре конфигурации';
		|en='Сбор сведений о структуре конфигурации'", Объект.КодОсновногоЯзыка));
	ЗагрузитьСтруктуруКонфигурацииНаСервере();
	
	Состояние(НСтр("ru='Построение дерева структуры конфигурации';
		|en='Построение дерева структуры конфигурации'", Объект.КодОсновногоЯзыка));
	ПостроитьДеревоСтруктурыКонфигурации();
	
	Если Объект.ВыгружатьКонфигурациюВФайлыXML Тогда
		ОчиститьКаталогиВыгрузки("");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьКонфигурациюИзХранилища()
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	Статус = ДоступОбъект.ЗагрузитьКонфигурациюИзХранилища();
	ЗначениеВРеквизитФормы(ДоступОбъект, "Объект");
	
	Возврат Статус;
	
КонецФункции

&НаСервере
Функция ВыгрузитьКонфигурациюВФайлыXML()
	
	Объект.КаталогВыгрузки = ПолучитьИмяВременногоФайла("");
	КаталогДобавитьСлэш(Объект.КаталогВыгрузки);
	СоздатьКаталог(Объект.КаталогВыгрузки);
	
	// Если указан готовый каталог выгрузки XML, то выгружать конфигурацию в XML не надо.
	// Копируем файлы выгрузки из указанного каталога и выходим.
	Если НЕ Объект.ВыгружатьКонфигурациюВФайлыXML Тогда
		СкопироватьКаталогВыгрузки(Объект.КаталогВыгрузкиРезультат, Объект.КаталогВыгрузки);
		Возврат "";
	КонецЕсли;
	
	Объект.КаталогВыгрузкиРезультат = ПолучитьИмяВременногоФайла("");
	КаталогДобавитьСлэш(Объект.КаталогВыгрузкиРезультат);
	СоздатьКаталог(Объект.КаталогВыгрузкиРезультат);
	
	ОчиститьКаталогиВыгрузки();
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	
	Статус = ДоступОбъект.ВыгрузитьКонфигурациюВФайлыXML();
	Если НЕ ПустаяСтрока(Статус) Тогда
		СтрокаСообщения = НСтр("ru='Не удалось выгрузить конфигурацию в файлы XML по причине:%1%2';
			|en='Не удалось выгрузить конфигурацию в файлы XML по причине:%1%2'", Объект.КодОсновногоЯзыка);
		СтрокаСообщения = СтрШаблон(СтрокаСообщения, Символы.ПС, Статус);
		Возврат СтрокаСообщения;
	КонецЕсли;
	ЗначениеВРеквизитФормы(ДоступОбъект, "Объект");
	
	СкопироватьКаталогВыгрузки(Объект.КаталогВыгрузки, Объект.КаталогВыгрузкиРезультат);
	
	Возврат "";
	
КонецФункции

&НаСервере
Процедура СкопироватьКаталогВыгрузки(Источник, Приемник)
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	ДоступОбъект.СкопироватьКаталогВыгрузки(Источник, Приемник);
	ЗначениеВРеквизитФормы(ДоступОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСтруктуруКонфигурацииНаСервере()
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	ДоступОбъект.ЗагрузитьСтруктуруКонфигурации();
	ЗначениеВРеквизитФормы(ДоступОбъект, "Объект");
	
КонецПроцедуры

#Область ПостроениеДереваСтруктурыКонфигурации

&НаСервере
Процедура ПостроитьДеревоСтруктурыКонфигурации()
	
	МассивИДОбъектов = ПолучитьМассивОбъектовПоВыбраннымПодсистемам();
	ОтборПоПодсистемам = (ВыбранныеПодсистемы.Количество() > 0);
	
	МассивТиповВходящихВПодсистемы = ПолучитьТипыОбъектовВходящихВПодсистемы();
	ТаблицаИндексовКартинок = ПолучитьТаблицуИндексовКартинок();
	
	ТаблицаСтруктуры = Объект.СтруктураКонфигурации.Выгрузить(, "ИД, ИДРодителя, Объект, ТипОбъекта, Флаг");
	ТаблицаСтруктуры.Индексы.Добавить("ИДРодителя");
	
	ПустойИД = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
	ПараметрыФормированияДерева = Новый Структура;
	ПараметрыФормированияДерева.Вставить("МассивИДОбъектов", МассивИДОбъектов);
	ПараметрыФормированияДерева.Вставить("ОтборПоПодсистемам", ОтборПоПодсистемам);
	ПараметрыФормированияДерева.Вставить("МассивТиповВходящихВПодсистемы", МассивТиповВходящихВПодсистемы);
	ПараметрыФормированияДерева.Вставить("ТаблицаИндексовКартинок", ТаблицаИндексовКартинок);
	ПараметрыФормированияДерева.Вставить("ТаблицаСтруктуры", ТаблицаСтруктуры);
	ПараметрыФормированияДерева.Вставить("ПустойИД", ПустойИД);
	
	КоллекцияЭлементов = ДеревоСтруктурыКонфигурации.ПолучитьЭлементы();
	
	КоллекцияЭлементов.Очистить();
	
	ПостроитьДеревоСтруктурыКонфигурацииРекурсивно(КоллекцияЭлементов, ПустойИД, ПараметрыФормированияДерева);
	ЗаполнитьФлагиДерева();
	
	Элементы.ДеревоСтруктурыКонфигурацииОтборПоПодсистемам.Пометка = ОтборПоПодсистемам;
	
КонецПроцедуры

&НаСервере
Процедура ПостроитьДеревоСтруктурыКонфигурацииРекурсивно(КоллекцияЭлементов, ИДРодителя, ПараметрыФормированияДерева)
	
	МассивИДОбъектов = ПараметрыФормированияДерева.МассивИДОбъектов;
	ОтборПоПодсистемам = ПараметрыФормированияДерева.ОтборПоПодсистемам;
	МассивТиповВходящихВПодсистемы = ПараметрыФормированияДерева.МассивТиповВходящихВПодсистемы;
	ТаблицаИндексовКартинок = ПараметрыФормированияДерева.ТаблицаИндексовКартинок;
	ТаблицаСтруктуры = ПараметрыФормированияДерева.ТаблицаСтруктуры;
	ПустойИД = ПараметрыФормированияДерева.ПустойИД;
	
	КоллекцияЭлементов.Очистить();
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИДРодителя", ИДРодителя);
	
	МассивСтрок = ТаблицаСтруктуры.НайтиСтроки(СтруктураОтбора);
	Для Каждого СтрокаСтруктуры Из МассивСтрок Цикл
		
		Если СтрокаСтруктуры.ИД = ПустойИД Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОтборПоПодсистемам
			И (МассивТиповВходящихВПодсистемы.Найти(СтрокаСтруктуры.ТипОбъекта) <> Неопределено)
			И МассивИДОбъектов.Найти(СтрокаСтруктуры.ИД) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаДерева = КоллекцияЭлементов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаСтруктуры);
		СтрокаДерева.ИндексКартинки = ПолучитьИндексКартинки(ТаблицаИндексовКартинок, СтрокаСтруктуры);
		
		ПостроитьДеревоСтруктурыКонфигурацииРекурсивно(СтрокаДерева.ПолучитьЭлементы(), СтрокаСтруктуры.ИД,
			ПараметрыФормированияДерева);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуИндексовКартинок()
	
	ТипыОбъектов = Новый ТаблицаЗначений();
	ТипыОбъектов.Колонки.Добавить("ИмяВЕдинственномЧисле");
	ТипыОбъектов.Колонки.Добавить("ИмяВоМножественномЧисле");
	ТипыОбъектов.Колонки.Добавить("ИндексКартинки");
	
	ДобавитьНовыйТип(ТипыОбъектов, "Корень",						"Корень",						0);
	ДобавитьНовыйТип(ТипыОбъектов, "Конфигурация",					"Конфигурации",					0);
	ДобавитьНовыйТип(ТипыОбъектов, "Общие",							"Общие",						1);
	ДобавитьНовыйТип(ТипыОбъектов, "Подсистема",					"Подсистемы",					2);
	ДобавитьНовыйТип(ТипыОбъектов, "ОбщийМодуль",					"ОбщиеМодули",					3);
	ДобавитьНовыйТип(ТипыОбъектов, "ПараметрСеанса",				"ПараметрыСеанса",				4);
	ДобавитьНовыйТип(ТипыОбъектов, "Роль",							"Роли",							5);
	ДобавитьНовыйТип(ТипыОбъектов, "ОбщийРеквизит",					"ОбщиеРеквизиты",				6);
	ДобавитьНовыйТип(ТипыОбъектов, "ПланОбмена",					"ПланыОбмена",					7);
	ДобавитьНовыйТип(ТипыОбъектов, "КритерийОтбора",				"КритерииОтбора",				8);
	ДобавитьНовыйТип(ТипыОбъектов, "ПодпискаНаСобытие",				"ПодпискиНаСобытия",			9);
	ДобавитьНовыйТип(ТипыОбъектов, "РегламентноеЗадание",			"РегламентныеЗадания",			10);
	ДобавитьНовыйТип(ТипыОбъектов, "ФункциональнаяОпция",			"ФункциональныеОпции",			11);
	ДобавитьНовыйТип(ТипыОбъектов, "ПараметрФункциональныхОпций",	"ПараметрыФункциональныхОпций",	12);
	ДобавитьНовыйТип(ТипыОбъектов, "ОпределяемыйТип", 				"ОпределяемыеТипы",				56);
	ДобавитьНовыйТип(ТипыОбъектов, "ХранилищеНастроек", 			"ХранилищаНастроек",			13);
	ДобавитьНовыйТип(ТипыОбъектов, "ОбщаяФорма", 					"ОбщиеФормы",					14);
	ДобавитьНовыйТип(ТипыОбъектов, "ОбщаяУправляемаяФорма", 		"ОбщиеУправляемыеФормы",		14);
	ДобавитьНовыйТип(ТипыОбъектов, "ОбщаяКоманда", 					"ОбщиеКоманды",					15);
	ДобавитьНовыйТип(ТипыОбъектов, "ГруппаКоманд", 					"ГруппыКоманд",					16);
	ДобавитьНовыйТип(ТипыОбъектов, "Интерфейс", 					"Интерфейсы",					17);
	ДобавитьНовыйТип(ТипыОбъектов, "ОбщийМакет", 					"ОбщиеМакеты",					58);
	ДобавитьНовыйТип(ТипыОбъектов, "ОбщаяКартинка", 				"ОбщиеКартинки",				19);
	ДобавитьНовыйТип(ТипыОбъектов, "ПакетXDTO", 					"ПакетыXDTO",					20);
	ДобавитьНовыйТип(ТипыОбъектов, "WebСервис", 					"WebСервисы",					21);
	ДобавитьНовыйТип(ТипыОбъектов, "HTTPСервис", 					"HTTPСервисы",					59);
	ДобавитьНовыйТип(ТипыОбъектов, "WSСсылка", 						"WSСсылки",						24);
	ДобавитьНовыйТип(ТипыОбъектов, "ЭлементСтиля", 					"ЭлементыСтиля",				26);
	ДобавитьНовыйТип(ТипыОбъектов, "Стиль", 						"Стили",						25);
	ДобавитьНовыйТип(ТипыОбъектов, "Язык", 							"Языки",						27);
	ДобавитьНовыйТип(ТипыОбъектов, "Константа", 					"Константы",					28);
	ДобавитьНовыйТип(ТипыОбъектов, "Справочник", 					"Справочники",					29);
	ДобавитьНовыйТип(ТипыОбъектов, "Документ", 						"Документы",					30);
	ДобавитьНовыйТип(ТипыОбъектов, "ЖурналДокументов", 				"ЖурналыДокументов",			33);
	ДобавитьНовыйТип(ТипыОбъектов, "Перечисление", 					"Перечисления",					35);
	ДобавитьНовыйТип(ТипыОбъектов, "Отчет", 						"Отчеты",						37);
	ДобавитьНовыйТип(ТипыОбъектов, "Обработка", 					"Обработки",					38);
	ДобавитьНовыйТип(ТипыОбъектов, "ПланВидовХарактеристик", 		"ПланыВидовХарактеристик",		39);
	ДобавитьНовыйТип(ТипыОбъектов, "ПланСчетов", 					"ПланыСчетов",					40);
	ДобавитьНовыйТип(ТипыОбъектов, "ПланВидовРасчета", 				"ПланыВидовРасчета",			43);
	ДобавитьНовыйТип(ТипыОбъектов, "РегистрСведений", 				"РегистрыСведений",				44);
	ДобавитьНовыйТип(ТипыОбъектов, "РегистрНакопления", 			"РегистрыНакопления",			45);
	ДобавитьНовыйТип(ТипыОбъектов, "РегистрБухгалтерии", 			"РегистрыБухгалтерии",			46);
	ДобавитьНовыйТип(ТипыОбъектов, "РегистрРасчета", 				"РегистрыРасчета",				47);
	ДобавитьНовыйТип(ТипыОбъектов, "БизнесПроцесс", 				"БизнесПроцессы",				51);
	ДобавитьНовыйТип(ТипыОбъектов, "Задача", 						"Задачи",						52);
	ДобавитьНовыйТип(ТипыОбъектов, "ВнешнийИсточникДанных", 		"ВнешниеИсточникиДанных",		54);
	ДобавитьНовыйТип(ТипыОбъектов, "Реквизит", 						"Реквизиты",					56);
	ДобавитьНовыйТип(ТипыОбъектов, "СтандартнаяТабличнаяЧасть",		"СтандартныеТабличныеЧасти",	57);
	ДобавитьНовыйТип(ТипыОбъектов, "СтандартныйРеквизит",			"СтандартныеРеквизиты",			56);
	ДобавитьНовыйТип(ТипыОбъектов, "ТабличнаяЧасть", 				"ТабличныеЧасти",				57);
	ДобавитьНовыйТип(ТипыОбъектов, "Форма", 						"Формы",						14);
	ДобавитьНовыйТип(ТипыОбъектов, "УправляемаяФорма", 				"УправляемыеФормы",				14);
	ДобавитьНовыйТип(ТипыОбъектов, "Команда", 						"Команды",						15);
	ДобавитьНовыйТип(ТипыОбъектов, "Макет", 						"Макеты",						58);
	ДобавитьНовыйТип(ТипыОбъектов, "Нумератор", 					"Нумераторы",					31);
	ДобавитьНовыйТип(ТипыОбъектов, "Последовательность", 			"Последовательности",			32);
	ДобавитьНовыйТип(ТипыОбъектов, "Графа", 						"Графы",						34);
	ДобавитьНовыйТип(ТипыОбъектов, "Значение", 						"Значения",						36);
	ДобавитьНовыйТип(ТипыОбъектов, "ПризнакУчета", 					"ПризнакиУчета",				41);
	ДобавитьНовыйТип(ТипыОбъектов, "ПризнакУчетаСубконто", 			"ПризнакиУчетаСубконто",		42);
	ДобавитьНовыйТип(ТипыОбъектов, "Измерение", 					"Измерения",					48);
	ДобавитьНовыйТип(ТипыОбъектов, "Ресурс", 						"Ресурсы",						49);
	ДобавитьНовыйТип(ТипыОбъектов, "Перерасчет", 					"Перерасчеты",					50);
	ДобавитьНовыйТип(ТипыОбъектов, "РеквизитАдресации", 			"РеквизитыАдресации",			53);
	ДобавитьНовыйТип(ТипыОбъектов, "ПредопределенныйЭлемент", 		"ПредопределенныеЭлементы",		56);
	ДобавитьНовыйТип(ТипыОбъектов, "Операция", 						"Операции",						22);
	ДобавитьНовыйТип(ТипыОбъектов, "Параметр", 						"Параметры",					23);
	ДобавитьНовыйТип(ТипыОбъектов, "ШаблонURL", 					"ШаблоныURL",					60);
	ДобавитьНовыйТип(ТипыОбъектов, "МетодШаблонаURL", 				"МетодыШаблонаURL",				61);
	
	Возврат ТипыОбъектов;
	
КонецФункции

&НаСервере
Функция ДобавитьНовыйТип(ТипыОбъектов, ИмяВЕдинственномЧисле, ИмяВоМножественномЧисле, ИндексКартинки)
	
	НовыйТип = ТипыОбъектов.Добавить();
	НовыйТип.ИмяВЕдинственномЧисле = ИмяВЕдинственномЧисле;
	НовыйТип.ИмяВоМножественномЧисле = ИмяВоМножественномЧисле;
	НовыйТип.ИндексКартинки = ИндексКартинки;
	
КонецФункции

&НаСервере
Функция ПолучитьИндексКартинки(ТаблицаИндексовКартинок, СтрокаСтруктуры)
	
	КолонкаДляПоиска = "ИмяВЕдинственномЧисле";
	
	ТипОбъекта = СтрокаСтруктуры.ТипОбъекта;
	Если ТипОбъекта = "ВеткаМетаданных" Тогда
		КолонкаДляПоиска = "ИмяВоМножественномЧисле";
		ТипОбъекта = СтрокаСтруктуры.Объект;
	КонецЕсли;
	
	СтрокаИндексаКартинки = ТаблицаИндексовКартинок.Найти(ТипОбъекта, КолонкаДляПоиска);
	Возврат ?(СтрокаИндексаКартинки = Неопределено, 0, СтрокаИндексаКартинки.ИндексКартинки);
	
КонецФункции

&НаСервере
Функция ПолучитьМассивОбъектовПоВыбраннымПодсистемам()
	
	ТаблицаСоставаПодсистем = Объект.СоставПодсистем.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СоставПодсистем.ИДОбъекта КАК ИДОбъекта,
	|	СоставПодсистем.ИДПодсистемы КАК ИДПодсистемы
	|ПОМЕСТИТЬ вт_СоставПодсистем
	|ИЗ
	|	&СоставПодсистем КАК СоставПодсистем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт_СоставПодсистем.ИДОбъекта КАК ИДОбъекта
	|ИЗ
	|	вт_СоставПодсистем КАК вт_СоставПодсистем
	|ГДЕ
	|	вт_СоставПодсистем.ИДПодсистемы В(&СписокИДПодсистем)";
	
	Запрос.УстановитьПараметр("СоставПодсистем", ТаблицаСоставаПодсистем);
	Запрос.УстановитьПараметр("СписокИДПодсистем", ВыбранныеПодсистемы);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	МассивИДВыбранныхОбъектов = РезультатЗапроса.ВыгрузитьКолонку("ИДОбъекта");
	
	ПустойИД = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	ПоказатьОбъектыБезПодсистем = (ВыбранныеПодсистемы.НайтиПоЗначению(ПустойИД) <> Неопределено);
	
	Если ПоказатьОбъектыБезПодсистем Тогда
		
		ТипыОбъектовПодсистемы = ПолучитьТипыОбъектовВходящихВПодсистемы();
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	СтруктураКонфигурации.ТипОбъекта КАК ТипОбъекта,
		|	СтруктураКонфигурации.ИД КАК ИД
		|ПОМЕСТИТЬ вт_СтруктураКонфигурации
		|ИЗ
		|	&СтруктураКонфигурации КАК СтруктураКонфигурации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СоставПодсистем.ИДОбъекта КАК ИДОбъекта
		|ПОМЕСТИТЬ вт_СоставПодсистем
		|ИЗ
		|	&СоставПодсистем КАК СоставПодсистем
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_СтруктураКонфигурации.ИД КАК ИД
		|ИЗ
		|	вт_СтруктураКонфигурации КАК вт_СтруктураКонфигурации
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СоставПодсистем КАК вт_СоставПодсистем
		|		ПО вт_СтруктураКонфигурации.ИД = вт_СоставПодсистем.ИДОбъекта
		|ГДЕ
		|	вт_СтруктураКонфигурации.ТипОбъекта В(&МассивТипов)
		|	И вт_СоставПодсистем.ИДОбъекта ЕСТЬ NULL";
		
		Запрос.УстановитьПараметр("СтруктураКонфигурации", Объект.СтруктураКонфигурации.Выгрузить());
		Запрос.УстановитьПараметр("СоставПодсистем", ТаблицаСоставаПодсистем);
		Запрос.УстановитьПараметр("МассивТипов", ТипыОбъектовПодсистемы);
		
		ТаблицаОбъектовБезПодсистем = Запрос.Выполнить().Выгрузить();
		МассивИДБезПодсистем = ТаблицаОбъектовБезПодсистем.ВыгрузитьКолонку("ИД");
		
		Для Каждого ЭлементМассива Из МассивИДБезПодсистем Цикл
			МассивИДВыбранныхОбъектов.Добавить(ЭлементМассива);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат МассивИДВыбранныхОбъектов;
	
КонецФункции

&НаСервере
// Возвращает список типов объектов, которые могут входит в подсистемы.
//
Функция ПолучитьТипыОбъектовВходящихВПодсистемы()
	
	МассивТипов = Новый Массив;
	
	МассивТипов.Добавить("ОбщийМодуль");
	МассивТипов.Добавить("ПараметрСеанса");
	МассивТипов.Добавить("Роль");
	МассивТипов.Добавить("ОбщийРеквизит");
	МассивТипов.Добавить("ОпределяемыйТип");
	МассивТипов.Добавить("ПланОбмена");
	МассивТипов.Добавить("КритерийОтбора");
	МассивТипов.Добавить("ПодпискаНаСобытия");
	МассивТипов.Добавить("РегламентноеЗадание");
	МассивТипов.Добавить("ФункциональнаяОпция");
	МассивТипов.Добавить("ПараметрФункциональнойОпции");
	МассивТипов.Добавить("ХранилищеНастроек");
	МассивТипов.Добавить("ОбщаяФорма");
	МассивТипов.Добавить("ОбщаяУправляемаяФорма");
	МассивТипов.Добавить("ОбщаяКоманда");
	МассивТипов.Добавить("ГруппаКоманд");
	МассивТипов.Добавить("ОбщийМакет");
	МассивТипов.Добавить("Картинка");
	МассивТипов.Добавить("ПакетXDTO");
	МассивТипов.Добавить("WebСервис");
	МассивТипов.Добавить("HTTPСервис");
	МассивТипов.Добавить("WSСсылка");
	МассивТипов.Добавить("Стиль");
	МассивТипов.Добавить("ЭлементСтиля");
	МассивТипов.Добавить("Константа");
	МассивТипов.Добавить("Справочник");
	МассивТипов.Добавить("Документ");
	МассивТипов.Добавить("ЖурналДокументов");
	МассивТипов.Добавить("Перечисление");
	МассивТипов.Добавить("Отчет");
	МассивТипов.Добавить("Обработка");
	МассивТипов.Добавить("ПланВидовХарактеристик");
	МассивТипов.Добавить("ПланСчетов");
	МассивТипов.Добавить("ПланВидовРасчета");
	МассивТипов.Добавить("РегистрСведений");
	МассивТипов.Добавить("РегистрНакопления");
	МассивТипов.Добавить("РегистрБухгалтерии");
	МассивТипов.Добавить("РегистрРасчета");
	МассивТипов.Добавить("БизнесПроцесс");
	МассивТипов.Добавить("Задача");
	
	Возврат МассивТипов;
	
КонецФункции

&НаКлиенте
Процедура ПослеОкончанияВыбораПодсистем(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатВыбора) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныеПодсистемы.ЗагрузитьЗначения(РезультатВыбора);
	ЗаполнитьВыбранныеПодсистемыКонфигурации();
	
	Состояние(НСтр("ru='Построение дерева структуры конфигурации';
		|en='Построение дерева структуры конфигурации'", Объект.КодОсновногоЯзыка));
	ПостроитьДеревоСтруктурыКонфигурации();
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОчиститьКаталогиВыгрузки(Знач Маска = "*")
	
	Попытка
		УдалитьФайлы(Объект.КаталогВыгрузкиРезультат, Маска);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция КаталогДобавитьСлэш(Каталог)
	
	Если НЕ СтрЗаканчиваетсяНа(Каталог, ПолучитьРазделительПути()) Тогда
		Каталог = Каталог + ПолучитьРазделительПути();
	КонецЕсли;
	
	Возврат Каталог;
	
КонецФункции

&НаКлиенте
Процедура апк_Сообщить(Знач ТекстСообщения, Статус = Неопределено)
	
	Если Статус = Неопределено Тогда
		Статус = СтатусСообщения.Обычное;
	КонецЕсли;
	
	ТекстСообщения = "[" + ТекущаяДата() + "]: " + ТекстСообщения;
	Сообщить(ТекстСообщения, Статус);
	
КонецПроцедуры

#Область УстановкаФлагов

&НаКлиенте
Процедура УстановитьЗначениеФлагов(УстанавливаемоеЗначение, КоллекцияЭлементов = Неопределено)
	
	Если КоллекцияЭлементов = Неопределено Тогда
		КоллекцияЭлементов = ДеревоСтруктурыКонфигурации.ПолучитьЭлементы();
	КонецЕсли;
	
	Для Каждого СтрокаДерева Из КоллекцияЭлементов Цикл
		СтрокаДерева.Флаг = УстанавливаемоеЗначение;
		УстановитьЗначениеФлагов(УстанавливаемоеЗначение, СтрокаДерева.ПолучитьЭлементы());
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеПодчиненныеОбъекты(КоллекцияЭлементов, УстанавливаемоеЗначение)
	
	Для Каждого СтрокаДерева Из КоллекцияЭлементов Цикл
		СтрокаДерева.Флаг = УстанавливаемоеЗначение;
		ОтметитьВсеПодчиненныеОбъекты(СтрокаДерева.ПолучитьЭлементы(), УстанавливаемоеЗначение)
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФлагиДерева()
	
	СоответствиеРодителей = Новый Соответствие;
	ПолучитьСоответствиеСтрокРодителейНижнегоУровня(СоответствиеРодителей);
	
	Для Каждого ЭлементСоответствия Из СоответствиеРодителей Цикл
		ПроверитьЗначениеФлагаУРодителей(ЭлементСоответствия.Ключ);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСоответствиеСтрокРодителейНижнегоУровня(СоответствиеРодителей, СтрокаДерева = Неопределено)
	
	Если СтрокаДерева = Неопределено Тогда
		КоллекцияСтрок = ДеревоСтруктурыКонфигурации.ПолучитьЭлементы();
		Если КоллекцияСтрок.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
	Иначе
		КоллекцияСтрок = СтрокаДерева.ПолучитьЭлементы();
	КонецЕсли;
	
	Если КоллекцияСтрок.Количество() = 0 Тогда
		СоответствиеРодителей.Вставить(СтрокаДерева.ПолучитьРодителя(), Истина);
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаКоллекции Из КоллекцияСтрок Цикл
		ПолучитьСоответствиеСтрокРодителейНижнегоУровня(СоответствиеРодителей, СтрокаКоллекции);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагРодителю(Знач ИДСтроки)
	
	ТекущаяСтрокаДерева = ДеревоСтруктурыКонфигурации.НайтиПоИдентификатору(ИДСтроки);
	Если ТекущаяСтрокаДерева = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаРодителя = ТекущаяСтрокаДерева.ПолучитьРодителя();
	ПроверитьЗначениеФлагаУРодителей(СтрокаРодителя);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗначениеФлагаУРодителей(СтрокаРодителя)
	
	Если СтрокаРодителя = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденУстановленныйФлаг = Ложь;
	НайденНеУстановленныйФлаг = Ложь;
	НайденФлагСоВторымЗначением = Ложь;
	
	КоллекцияЭлементов = СтрокаРодителя.ПолучитьЭлементы();
	Для Каждого СтрокаКоллекции Из КоллекцияЭлементов Цикл
		
		Если СтрокаКоллекции.Флаг = 1 Тогда
			НайденУстановленныйФлаг = Истина;
		ИначеЕсли СтрокаКоллекции.Флаг = 2 Тогда
			НайденФлагСоВторымЗначением = Истина;
		Иначе
			НайденНеУстановленныйФлаг = Истина;
		КонецЕсли;
		
		Если НайденФлагСоВторымЗначением Тогда
			Прервать;
		КонецЕсли;
		
		Если НайденФлагСоВторымЗначением ИЛИ (НайденУстановленныйФлаг И НайденНеУстановленныйФлаг) Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НайденФлагСоВторымЗначением ИЛИ (НайденУстановленныйФлаг И НайденНеУстановленныйФлаг) Тогда
		СтрокаРодителя.Флаг = 2;
	ИначеЕсли НайденУстановленныйФлаг И (НЕ НайденНеУстановленныйФлаг) Тогда
		СтрокаРодителя.Флаг = 1;
	Иначе
		СтрокаРодителя.Флаг = 0;
	КонецЕсли;
	
	ПроверитьЗначениеФлагаУРодителей(СтрокаРодителя.ПолучитьРодителя());
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьФлагиВСтруктуруКонфигурации(Знач КоллекцияЭлементов = Неопределено)
	
	ТаблицаСтруктуры = Объект.СтруктураКонфигурации.Выгрузить();
	ТаблицаСтруктуры.ЗаполнитьЗначения(Ложь, "Флаг");
	
	ЗаполнитьФлагиВСтруктуруКонфигурацииРекурсивно(ТаблицаСтруктуры);
	
	Объект.СтруктураКонфигурации.Загрузить(ТаблицаСтруктуры);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФлагиВСтруктуруКонфигурацииРекурсивно(ТаблицаСтруктуры, КоллекцияЭлементов = Неопределено)
	
	Если КоллекцияЭлементов = Неопределено Тогда
		КоллекцияЭлементов = ДеревоСтруктурыКонфигурации.ПолучитьЭлементы();
	КонецЕсли;
	
	Для Каждого СтрокаДерева Из КоллекцияЭлементов Цикл
		
		Если СтрокаДерева.Флаг = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДерева.Флаг = 1 Тогда
			
			СтрокаТаблицы = ТаблицаСтруктуры.Найти(СтрокаДерева.ИД, "ИД");
			Если СтрокаТаблицы = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТаблицы.Флаг = Истина;
			
		КонецЕсли;
		
		ЗаполнитьФлагиВСтруктуруКонфигурацииРекурсивно(ТаблицаСтруктуры, СтрокаДерева.ПолучитьЭлементы());
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВыбранныеПодсистемыКонфигурации()
	
	Для Каждого СтрокаПодсистемы Из ВыбранныеПодсистемы Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ИД", СтрокаПодсистемы.Значение);
		
		МассивСтрок = Объект.СтруктураКонфигурации.НайтиСтроки(ПараметрыОтбора);
		Если МассивСтрок.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаСтруктуры = МассивСтрок[0];
		СтрокаСтруктуры.ПодсистемаВыбрана = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбранныхПодсистем()
	
	ТаблицаСтруктурыКонфигурации = Объект.СтруктураКонфигурации.Выгрузить(, "ИД, ПодсистемаВыбрана");
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ПодсистемаВыбрана", Истина);
	
	ТаблицаВыбранныхПодсистем = ТаблицаСтруктурыКонфигурации.Скопировать(ПараметрыОтбора);
	МассивВыбранныхПодсистем = ТаблицаВыбранныхПодсистем.ВыгрузитьКолонку("ИД");
	
	ВыбранныеПодсистемы.ЗагрузитьЗначения(МассивВыбранныхПодсистем);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОбъекта(ОбъектИсточник, ИмяТаблицы)
	
	ТаблицаИсточника = ОбъектИсточник[ИмяТаблицы].Выгрузить();
	Объект[ИмяТаблицы].Загрузить(ТаблицаИсточника);
	
КонецПроцедуры

#КонецОбласти
