
#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура Определить(Команда)
	
	ОчиститьСообщения();
	
	Слово = НРег(ВведеннаяСтрока);
	
	ОпределитьПалиндромРекурсией(Слово);
	ОпределитьПалиндром(Слово);
	
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

// Проверяет введенную строку на слово-палиндром с использованием рекурсии.
//
// Параметры:
//  СтрокаПроверки  - Строка - строка в нижнем регистре.
//
&НаКлиенте
Процедура ОпределитьПалиндромРекурсией(СтрокаПроверки)
	
	Если Лев(СтрокаПроверки, 1) <> Прав(СтрокаПроверки, 1) Тогда
		
		ИнформированиеПользователя(Ложь);
		
		Возврат; 
		
	ИначеЕсли ПустаяСтрока(СтрокаПроверки) Тогда
		
		ИнформированиеПользователя(Истина);
		
		Возврат;
		
	Иначе
		
		НоваяСтрока = Лев(СтрокаПроверки, СтрДлина(СтрокаПроверки) - 1);
		НоваяСтрока = Прав(НоваяСтрока, СтрДлина(НоваяСтрока) - 1);
		
		ОпределитьПалиндромРекурсией(НоваяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры

// Проверяет введенную строку на слово-палиндром.
//
// Параметры:
//  СтрокаПроверки  - Строка - строка в нижнем регистре.
//
&НаКлиенте
Процедура ОпределитьПалиндром(СтрокаПроверки)
	
	НачальныйНомер = 1;
	КонечныйНомер  = СтрДлина(СтрокаПроверки);
	
	Пока НачальныйНомер < КонечныйНомер Цикл
		
		Если Сред(СтрокаПроверки, НачальныйНомер, 1) <> Сред(СтрокаПроверки, КонечныйНомер, 1) Тогда
			
			ИнформированиеПользователя(Ложь);
			
			Возврат;
			
		КонецЕсли;
			
			НачальныйНомер = НачальныйНомер + 1;
			КонечныйНомер  = КонечныйНомер - 1;
			
	КонецЦикла;
	
  ИнформированиеПользователя(Истина);

КонецПроцедуры

// Информирует пользователя, является ли введенная строка слово-палиндром.
//
// Параметры:
//  Палиндром  - Булево - отрицает или утверждает, что строка слово-палиндром.
//
&НаКлиенте
Процедура ИнформированиеПользователя(Палиндром)
	
	Если Палиндром Тогда
		ТекстСообщения = НСтр("ru = 'Строка является палиндромом.'");
	Иначе
		ТекстСообщения = НСтр("ru = 'Строка не является палиндромом.'");
	КонецЕсли;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти
