
&НаКлиенте
Процедура ДоговораПриИзменении(Элемент)
	ОбщегоНазначенияКлиент.КонтрольЗаполненияТаблицыАктивнымиДоговорамиАсинх(Элементы.Договора, ЭтотОбъект.Договора);
КонецПроцедуры

&НаКлиенте
Процедура КнопкаВыполнитьНаСервереНажатие(Команда)
	МояСервернаяПроцедура();
КонецПроцедуры

&НаСервере
Процедура МояСервернаяПроцедура()
	Выборка = Справочники.ДополнительныеОтчетыИОбработки.Выбрать();
	Пока Выборка.Следующий() = 1 Цикл
		Обработка = Выборка.ПолучитьОбъект();
		Обработка.Удалить();  	
	КонецЦикла
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьМетаданные(Команда)
	ВыгрузитьМетаданныеНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыгрузитьМетаданныеНаСервере()
	Обработка = Обработки.ВыгрузкаМетаданных.Создать();
	Обработка.ВыполнитьВыгрузку();
КонецПроцедуры

&НаКлиенте
Процедура Параметр(Команда)
ВернутьЗначение();
КонецПроцедуры

&НаКлиенте
Функция ВернутьЗначение()
	Параметр = 1;
  Если Значение1(Параметр) И Значение2(Параметр) или Значение3(Параметр) Тогда
	
	Параметр = Параметр + 1000;	
	
	КонецЕсли;
	
 Возврат Параметр;
КонецФункции
&НаКлиенте
Функция Значение1(пПараметр)
  пПараметр = пПараметр +1;
	
 Возврат Ложь;
КонецФункции
&НаКлиенте
Функция Значение2(пПараметр)
  пПараметр = пПараметр +10;

	
  Возврат Ложь;
КонецФункции
&НаКлиенте
Функция Значение3(пПараметр)
  пПараметр = пПараметр +100;

	
 Возврат Ложь;
КонецФункции