
&НаКлиенте
Процедура ДоговораПриИзменении(Элемент)
	ОбщегоНазначенияКлиент.КонтрольЗаполненияТаблицыАктивнымиДоговорамиАсинх(Элементы.Договора, ЭтотОбъект.Договора);
КонецПроцедуры

&НаКлиенте
Процедура КнопкаВыполнитьНаСервереНажатие(Команда)
	МояСервернаяПроцедура();
КонецПроцедуры

&НаСервере
Процедура МояСервернаяПроцедура()
	Выборка = Справочники.ДополнительныеОтчетыИОбработки.Выбрать();
	Пока Выборка.Следующий() = 1 Цикл
		Обработка = Выборка.ПолучитьОбъект();
		Обработка.Удалить();  	
	КонецЦикла
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьМетаданные(Команда)
	ВыгрузитьМетаданныеНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыгрузитьМетаданныеНаСервере()
	Обработка = Обработки.ВыгрузкаМетаданных.Создать();
	Обработка.ВыполнитьВыгрузку();
КонецПроцедуры
