#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ЗначениеФлагов;
Перем ТаблицаТиповОбъектов;
Перем УстановленОтборПоОбъектам;
Перем ТаблицаВыбранныхОбъектов;
Перем РазделительПути;
Перем ЭтоВыгрузкаXMLФайлов;
Перем Контекст;

#КонецОбласти

#Область ПроцедурыИФункцииДляВызоваОбработкиИзКонфигурации

// Процедура предназначена для вызова из кода исправляемой конфигурации,
// например, из регламентного задания по расписанию.
//
Функция АвтоформатироватьКод(ПараметрыАвтоформатирования = Неопределено) Экспорт
	
	Статус = ПроверитьПлатформу836();
	Если НЕ ПустаяСтрока(Статус) Тогда
		Возврат Статус;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыАвтоформатирования) <> Тип("Структура") Тогда
		ПараметрыАвтоформатирования = ПолучитьПараметрыАвтоформатированияПоУмолчанию();
	КонецЕсли;
	
	ЗначениеФлагов = Неопределено;
	Если НЕ ПараметрыАвтоформатирования.Свойство("ЗначениеФлагов", ЗначениеФлагов) Тогда
		ЗначениеФлагов = ПолучитьЗначенияФлаговПоУмолчанию();
	КонецЕсли;
	
	ЗаполнитьПараметры(ПараметрыАвтоформатирования);
	
	ХранилищеУказано = НЕ ПустаяСтрока(КаталогХранилища);
	
	Если ВыгружатьКонфигурациюВФайлыXML Тогда
		
		// Если указан список захваченных объектов, то только заполняем таблицу.
		Если НЕ ПустаяСтрока(СписокЗахваченныхОбъектов) Тогда
			
			Статус = ЗаполнитьТаблицуЗахваченныхОбъектов(СписокЗахваченныхОбъектов, Ложь);
			Если НЕ ПустаяСтрока(Статус) Тогда
				Возврат Статус;
			КонецЕсли;
			
		// Если заполнен каталог с хранилищем, то работаем с ним.
		ИначеЕсли ХранилищеУказано Тогда
			
			// Если флаг "Помещать обработанные объекты в хранилище" установлен,
			Если ПомещатьИзмененныеОбъектыВХранилище Тогда
				// то подключаемся к хранилищу.
				Статус = ПодключитьКонфигурациюКХранилищу();
				Если НЕ ПустаяСтрока(Статус) Тогда
					Возврат Статус;
				КонецЕсли;
				
				// И пытаемся захватить в нем все объекты.
				Статус = ЗахватитьОбъектыКонфигурацииВХранилище();
				Если НЕ ПустаяСтрока(Статус) Тогда
					Возврат Статус;
				КонецЕсли;
			Иначе
				// Если флаг не установлен, то только загружаем конфигурацию из хранилища.
				Статус = ЗагрузитьКонфигурациюИзХранилища();
				Если НЕ ПустаяСтрока(Статус) Тогда
					Возврат Статус;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Статус = ВыгрузитьКонфигурациюВФайлыXML();
		Если НЕ ПустаяСтрока(Статус) Тогда
			Возврат Статус;
		КонецЕсли;
		
		СкопироватьКаталогВыгрузки(КаталогВыгрузки, КаталогВыгрузкиРезультат);
		
	КонецЕсли;
	
	ЭтоВыгрузкаXMLФайлов = ЭтоВыгрузкаXMLФайлов();
	
	ЗаполнитьПравилаПоддержки();
	
	ЗаполнитьРезультат();
	
	ПривестиКонфигурациюКСтандартам();
	
	Если НЕ ПараметрыАвтоформатирования.Свойство("ПутьКФайлуРезультатов") Тогда
		ПараметрыАвтоформатирования.Вставить("ПутьКФайлуРезультатов", ПолучитьИмяВременногоФайла("tz"));
	КонецЕсли;
	СохранитьТаблицуИзмененныхОбъектовВФайл(ПараметрыАвтоформатирования.ПутьКФайлуРезультатов);
	
	ЗаполнитьПравилаПоддержкиДляИзмененныхОбъектов();
	
	Если ЗагружатьКонфигурациюИзФайловXML Тогда
		
		Статус = ЗагрузитьКонфигурациюИзФайловXML();
		Если НЕ ПустаяСтрока(Статус) Тогда
			Возврат Статус;
		КонецЕсли;
		
		Если ОбновитьКонфигурациюБД Тогда
			Статус = ОбновитьКонфигурациюБД();
			Если НЕ ПустаяСтрока(Статус) Тогда
				Возврат Статус;
			КонецЕсли;
		КонецЕсли;
		
		ОчиститьКаталогиВыгрузки("");
		
	КонецЕсли;
	
	Если ХранилищеУказано И ПомещатьИзмененныеОбъектыВХранилище Тогда
		
		Статус = ПоместитьИзмененныеОбъектыВХранилище();
		Если НЕ ПустаяСтрока(Статус) Тогда
			Возврат Статус;
		КонецЕсли;
		
		Статус = ОтменитьЗахватОбъектовВХранилище();
		Если НЕ ПустаяСтрока(Статус) Тогда
			Возврат Статус;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Статус;
	
КонецФункции

// Функция предназначена для вызова из кода исправляемой конфигурации.
// Получает значения флагов для исправления по умолчанию.
//
Функция ПолучитьПараметрыАвтоформатированияПоУмолчанию()
	
	ПараметрыАвтоформатирования = Новый Структура;
	ПараметрыАвтоформатирования.Вставить("ПутьКБазе", СтрокаСоединенияИнформационнойБазы());
	ПараметрыАвтоформатирования.Вставить("Пользователь", ИмяПользователя());
	ПараметрыАвтоформатирования.Вставить("Пароль", "");
	ПараметрыАвтоформатирования.Вставить("КаталогВыгрузкиXML", КаталогВременныхФайлов());
	ПараметрыАвтоформатирования.Вставить("ОбновитьКонфигурациюБД", Ложь);
	ПараметрыАвтоформатирования.Вставить("КаталогХранилища", "");
	ПараметрыАвтоформатирования.Вставить("ПользовательХранилища", "");
	ПараметрыАвтоформатирования.Вставить("ПарольХранилища", "");
	ПараметрыАвтоформатирования.Вставить("ПомещатьИзмененныеОбъектыВХранилище", Ложь);
	ПараметрыАвтоформатирования.Вставить("СтрокаЗапускаПлатформы", КаталогПрограммы() + "1cv8.exe");
	ПараметрыАвтоформатирования.Вставить("СписокИзмененныхОбъектов", ПолучитьИмяВременногоФайла("xml"));
	ПараметрыАвтоформатирования.Вставить("ВыгружатьКонфигурациюВФайлыXML", Истина);
	ПараметрыАвтоформатирования.Вставить("ЗагружатьКонфигурациюИзФайловXML", Истина);
	ПараметрыАвтоформатирования.Вставить("ТекстКомментария", "");
	ПараметрыАвтоформатирования.Вставить("СписокЗахваченныхОбъектов", "");
	ПараметрыАвтоформатирования.Вставить("РежимОтладки", Ложь);
	ПараметрыАвтоформатирования.Вставить("ПутьКФайлуРезультатов", ПолучитьИмяВременногоФайла("tz"));
	
	ПараметрыАвтоформатирования.Вставить("ЗначениеФлагов", ПолучитьЗначенияФлаговПоУмолчанию());
	
	Возврат ПараметрыАвтоформатирования;
	
КонецФункции

// Функция предназначена для вызова из кода исправляемой конфигурации.
// Получает значения флагов для исправления по умолчанию.
//
Функция ПолучитьЗначенияФлаговПоУмолчанию()
	
	ЗначениеФлаговПоУмолчанию = Новый Структура;
	
	ТаблицаСтандартов = Контекст["ТаблицаСтандартов"];
	Если ТаблицаСтандартов = Неопределено Тогда
		ЗаполнитьКонтекст();
		ТаблицаСтандартов = Контекст["ТаблицаСтандартов"];
	КонецЕсли;
	
	Для Каждого СтрокаСтандарта Из ТаблицаСтандартов Цикл
		ЗначениеФлаговПоУмолчанию.Вставить(СтрокаСтандарта.Ключ, НЕ ПустаяСтрока(СтрокаСтандарта.ВыбранПоУмолчанию));
	КонецЦикла;
	
	Возврат ЗначениеФлаговПоУмолчанию;
	
КонецФункции

Функция ПолучитьИмяФайлаБезРасширения(ПутьКФайлу)
	
	Файл = Новый Файл(ПутьКФайлу);
	
	Возврат Файл.ИмяБезРасширения;
	
КонецФункции

Процедура ЗаполнитьПараметры(Знач ПараметрыАвтоформатирования)
	
	// Заполняем параметры "КаталогВыгрузки" и "КаталогВыгрузкиРезультат".
	КаталогВыгрузкиXML = ПараметрыАвтоформатирования.КаталогВыгрузкиXML;
	// Если каталог выгрузки не передан, то заполняем временными каталогами.
	Если ПустаяСтрока(КаталогВыгрузкиXML) Тогда
		КаталогВыгрузки = ПолучитьИмяВременногоФайла("");
		КаталогВыгрузкиРезультат = ПолучитьИмяВременногоФайла("");
	ИначеЕсли ПараметрыАвтоформатирования.ВыгружатьКонфигурациюВФайлыXML Тогда
		// Если передан каталог выгрузки и необходимость выгрузки в файлы XML,
		// то заполняем переданный каталог временными каталогами.
		КаталогВыгрузкиXML = СокрЛП(КаталогВыгрузкиXML);
		ОтредактироватьПутьККаталогу(КаталогВыгрузкиXML);
		
		ИмяФайла = ПолучитьИмяВременногоФайла("");
		ИмяФайла = ПолучитьИмяФайлаБезРасширения(ИмяФайла);
		КаталогВыгрузки = КаталогВыгрузкиXML + ИмяФайла;
		
		ИмяФайла = ПолучитьИмяВременногоФайла("");
		ИмяФайла = ПолучитьИмяФайлаБезРасширения(ИмяФайла);
		КаталогВыгрузкиРезультат = КаталогВыгрузкиXML + ИмяФайла;
	Иначе
		// Если передан каталог выгрузки, и не надо выгружать конфигурацию в файлы XML,
		// то заполняем им КаталогВыгрузкиРезультат, а КаталогВыгрузки - временным каталогом.
		КаталогВыгрузкиРезультат = КаталогВыгрузкиXML;
		КаталогВыгрузки = ПолучитьИмяВременногоФайла("");
	КонецЕсли;
	
	ОтредактироватьПутьККаталогу(КаталогВыгрузки);
	ОтредактироватьПутьККаталогу(КаталогВыгрузкиРезультат);
	
	// Заполняем остальные параметры автоформатирования.
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыАвтоформатирования);
	
	// Проверяем параметр "ПутьКБазе".
	Если ПустаяСтрока(ПутьКБазе) Тогда
		ПутьКБазе = СтрокаСоединенияИнформационнойБазы();
	КонецЕсли;
	
	// Проверяем параметр "Пользователь".
	Если ПустаяСтрока(Пользователь) Тогда
		ТекущийПользователь = ИмяПользователя();
		Если ПустаяСтрока(ТекущийПользователь) Тогда
			Пользователь = "";
			Пароль = "";
		Иначе
			Пользователь = ТекущийПользователь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРезультат(Знач СтруктураОтбораОбъектов = Неопределено) Экспорт
	
	СтруктураПараметровОбъекта = СтруктураОтбораОбъектов;
	Если СтруктураПараметровОбъекта = Неопределено Тогда
		СтруктураПараметровОбъекта = Новый Структура;
		СтруктураПараметровОбъекта.Вставить("МассивВыбранныхОбъектов", Новый Массив);
		СтруктураПараметровОбъекта.Вставить("МассивВключенныхПодсистем", Новый Массив);
		СтруктураПараметровОбъекта.Вставить("МассивИсключенныхПодсистем", Новый Массив);
	КонецЕсли;
	
	Результат.Очистить();
	
	КаталогВыгрузкиРезультат = ОтредактироватьПутьККаталогу(КаталогВыгрузкиРезультат);
	
	Если ЭтоВыгрузкаXMLФайлов() Тогда
		НайденныеФайлы = НайтиФайлы(КаталогВыгрузкиРезультат, ПолучитьМаскуВсеФайлы(), Истина);
	Иначе
		НайденныеФайлы = НайтиФайлы(КаталогВыгрузкиРезультат + "src" + РазделительПути, ПолучитьМаскуВсеФайлы(), Истина);
	КонецЕсли;
	
	СтруктураПараметровОбъекта.Вставить("ПутьОбъекта");
	СтруктураПараметровОбъекта.Вставить("ПутьФайла");
	
	СоответствиеОбъектовДляФорматирования = Новый Соответствие;
	
	Для Каждого Файл Из НайденныеФайлы Цикл
		
		Если Файл.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		
		ПолноеИмяФайла = Файл.ПолноеИмя;
		ПутьОбъекта = ПолучитьПутьОбъектаИзФайлаВыгрузки(ПолноеИмяФайла);
		
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.ПолноеИмяФайла     = ПолноеИмяФайла;
		НоваяСтрока.Объект             = ПутьОбъекта;
		НоваяСтрока.РодительОбъекта    = ПолучитьПутьРодителяОбъекта(ПутьОбъекта);
		НоваяСтрока.Выбран             = Истина;
		НоваяСтрока.Изменен            = Ложь;
		НоваяСтрока.ВозниклоИсключение = Ложь;
		НоваяСтрока.Результат          = "сравнить";
		НоваяСтрока.СодержитОшибки     = Ложь;
		НоваяСтрока.ОписаниеОшибки     = "";
		
		НоваяСтрока.ЗахваченВХранилище = ПолучитьСтатусЗахватаОбъектаВХранилище(ПутьОбъекта);
		НоваяСтрока.РедактированиеРазрешено = Истина;
		
		ОбъектВыбранДляИзменения = СоответствиеОбъектовДляФорматирования[ПутьОбъекта];
		Если ОбъектВыбранДляИзменения = Неопределено Тогда
			СтруктураПараметровОбъекта.ПутьОбъекта = ПутьОбъекта;
			СтруктураПараметровОбъекта.ПутьФайла   = ПолноеИмяФайла;
			ОбъектВыбранДляИзменения = ПроверитьОбъектВыбранДляФорматирования(СтруктураПараметровОбъекта);
			
			СоответствиеОбъектовДляФорматирования.Вставить(ПутьОбъекта, ОбъектВыбранДляИзменения);
		КонецЕсли;
		
		НоваяСтрока.ВыбранДляИзменения = ОбъектВыбранДляИзменения;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПроверитьОбъектВыбранДляФорматирования(СтруктураПараметровОбъекта)
	
	ПутьОбъекта = СтруктураПараметровОбъекта.ПутьОбъекта;
	ПутьФайла   = СтруктураПараметровОбъекта.ПутьФайла;
	
	// Если массив объектов для форматирования заполнен, то ищем в нем.
	МассивВыбранныхОбъектов = СтруктураПараметровОбъекта.МассивВыбранныхОбъектов;
	Если МассивВыбранныхОбъектов.Количество() > 0 Тогда
		Возврат (МассивВыбранныхОбъектов.Найти(ПутьОбъекта) <> Неопределено)
			ИЛИ (МассивВыбранныхОбъектов.Найти(ПутьФайла) <> Неопределено);
	КонецЕсли;
	
	МассивВключенныхПодсистем  = СтруктураПараметровОбъекта.МассивВключенныхПодсистем;
	МассивИсключенныхПодсистем = СтруктураПараметровОбъекта.МассивИсключенныхПодсистем;
	
	ЕстьВключенныеПодсистемы  = (МассивВключенныхПодсистем.Количество() > 0);
	ЕстьИсключенныеПодсистемы = (МассивИсключенныхПодсистем.Количество() > 0);
	
	Если (НЕ ЕстьВключенныеПодсистемы) И (НЕ ЕстьИсключенныеПодсистемы) Тогда
		// Не заполнен ни массив включенных подсистем, ни массив исключенных подсистем, выходим.
		Возврат Истина;
	КонецЕсли;
	
	// Корень конфигурации изменяем всегда вне зависимости от указанных подсистем.
	Если ПутьОбъекта = "Конфигурация" Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Заполняем таблицу объектов и подсистем.
	ЗаполнитьТаблицуОбъектовИПодсистем();
	
	ОбъектВходитВоВключеннуюПодсистему = Ложь;
	ОбъектВходитВИсключеннуюПодсистему = Ложь;
	
	// Если массив включенных подсистем заполнен, то проверяем объект среди них.
	Если ЕстьВключенныеПодсистемы Тогда
		ОбъектВходитВоВключеннуюПодсистему = ОбъектВходитВПодсистему(ПутьОбъекта, МассивВключенныхПодсистем);
	КонецЕсли;
	
	// Если массив исключенных подсистем заполнен, то проверяем объект среди них.
	Если ЕстьИсключенныеПодсистемы Тогда
		ОбъектВходитВИсключеннуюПодсистему = ОбъектВходитВПодсистему(ПутьОбъекта, МассивИсключенныхПодсистем);
	КонецЕсли;
	
	// Если есть включенные подсистемы, то проверяем объект среди них.
	Если ЕстьВключенныеПодсистемы Тогда
		
		// Проверяем, входит ли объект во включенную подсистему.
		Если НЕ ОбъектВходитВоВключеннуюПодсистему Тогда
			// Если объект не входит ни в одну из включенных подсистем, то пропускаем.
			Возврат Ложь;
		КонецЕсли;
		
		// Если объект входит во включенную подсистему, проверяем, входит ли он в исключенную.
		Если ОбъектВходитВИсключеннуюПодсистему Тогда
			// Если объект входит во включенную и в исключенную подсистему, то пропускаем.
			Возврат Ложь;
		КонецЕсли;
		
		// Если объект входит во включенные подсистемы и не входит в исключенные, то включаем.
		Возврат Истина;
		
	КонецЕсли;
	
	// Если нет включенных подсистем, но есть исключенные, то проверяем объект среди них.
	Если ЕстьИсключенныеПодсистемы Тогда
		
		// Проверяем, входит ли объект в исключенную подсистему.
		Если ОбъектВходитВИсключеннуюПодсистему Тогда
			// Если объект входит в исключенную подсистему и, с учетом того, что нет включенных подсистем, пропускаем.
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	// Если нет включенных подсистем, но есть исключенные, и объект в них не входит, то включаем.
	Возврат Истина;
	
КонецФункции

Функция ПолучитьТаблицуИзмененныхОбъектовНаСервере(ЗахваченВХранилище = Неопределено,
	РедактированиеРазрешено = Неопределено) Экспорт
	
	// Получаем только выбранные измененные файлы.
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Изменен", Истина);
	СтруктураОтбора.Вставить("Выбран", Истина);
	
	Если ЗахваченВХранилище <> Неопределено Тогда
		СтруктураОтбора.Вставить("ЗахваченВХранилище", ЗахваченВХранилище);
	КонецЕсли;
	
	Если РедактированиеРазрешено <> Неопределено Тогда
		СтруктураОтбора.Вставить("РедактированиеРазрешено", РедактированиеРазрешено);
	КонецЕсли;
	
	Возврат Результат.Выгрузить(СтруктураОтбора);
	
КонецФункции

Процедура ЗаменитьПутиФайловФормВТаблицеИзмененныхФайлов(ТаблицаФайлов)
	
	// Для форм заменяем путь к измененному файлу путем к файлу XML формы как к объекту метаданных,
	// т.к. при указании, например, файла с модулем формы будет ошибка платформы при загрузке.
	// Модуль формы будет загружен автоматически при указании файла XML формы.
	Для Каждого СтрокаФайла Из ТаблицаФайлов Цикл
		
		КлассОбъекта = ПолучитьКлассОбъекта(СтрокаФайла.Объект);
		Если (СтрСравнить(КлассОбъекта, "Форма") <> 0)
		   И (СтрСравнить(КлассОбъекта, "ОбщаяФорма") <> 0) Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьОбъектаАнгл = ПолучитьПутьОбъектаИзФайлаВыгрузки(СтрокаФайла.ПолноеИмяФайла,, "ИмяАнглМнФормы");
		ПутьОбъектаАнгл = СтрЗаменить(ПутьОбъектаАнгл, ".", РазделительПути);
		
		ПолноеИмяФайлаФормы = КаталогВыгрузкиРезультат + ПутьОбъектаАнгл + СтрШаблон("%1Ext%1Form.xml", РазделительПути);
		Если апк_ФайлСуществует(ПолноеИмяФайлаФормы) Тогда
			СтрокаФайла.ПолноеИмяФайла = ПолноеИмяФайлаФормы;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьФайлыКорняКонфигурацииИзТаблицыИзмененныхФайлов(ТаблицаФайлов)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Объект", "Конфигурация");
	
	МассивФайловКонфигурации = ТаблицаФайлов.НайтиСтроки(СтруктураОтбора);
	Если МассивФайловКонфигурации.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Удалим все файлы корня конфигурации из таблицы, т.к. они были загружены ранее.
	Для Каждого СтрокаФайла Из МассивФайловКонфигурации Цикл
		ТаблицаФайлов.Удалить(СтрокаФайла);
	КонецЦикла;
	
КонецПроцедуры

Функция ПодготовитьФайлИзмененныхОбъектовДляЗагрузкиФайловXML()
	
	ТаблицаФайлов = ПолучитьТаблицуИзмененныхОбъектовНаСервере(Истина, Истина);
	Если ТаблицаФайлов.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	ЗаменитьПутиФайловФормВТаблицеИзмененныхФайлов(ТаблицаФайлов);
	УдалитьФайлыКорняКонфигурацииИзТаблицыИзмененныхФайлов(ТаблицаФайлов);
	
	Если ТаблицаФайлов.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	ТаблицаФайлов.Свернуть("ПолноеИмяФайла");
	
	СписокФайловДляЗагрузкиXML = апк_ПолучитьИмяВременногоФайла("txt");
	ДокументТекст = Новый ТекстовыйДокумент;
	
	Для Каждого СтрокаФайла Из ТаблицаФайлов Цикл
		ДокументТекст.ДобавитьСтроку(СтрокаФайла.ПолноеИмяФайла);
	КонецЦикла;
	
	ДокументТекст.Записать(СписокФайловДляЗагрузкиXML);
	
	Возврат СписокФайловДляЗагрузкиXML;
	
КонецФункции

Функция ПодготовитьФайлКонфигурацииДляЗагрузкиФайловXML(КаталогЗагрузки = "")
	
	ТаблицаФайлов = ПолучитьТаблицуИзмененныхОбъектовНаСервере(Истина, Истина);
	Если ТаблицаФайлов.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	// Если изменен один из файлов корня конфигурации, то будем загружать их все вместе,
	// но отдельно от файлов всех остальных объектов.
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Объект", "Конфигурация");
	
	МассивФайловКонфигурации = ТаблицаФайлов.НайтиСтроки(СтруктураОтбора);
	Если МассивФайловКонфигурации.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	СтруктураОтбора.Вставить("Изменен", Истина);
	
	// Скопируем все файлы корня конфигурации в отдельный каталог.
	КаталогЗагрузки = апк_ПолучитьИмяВременногоФайла();
	ОтредактироватьПутьККаталогу(КаталогЗагрузки);
	СоздатьКаталог(КаталогЗагрузки);
	
	МассивФайлов = НайтиФайлы(КаталогВыгрузкиРезультат, "*");
	Для Каждого Файл Из МассивФайлов Цикл
		// Каталоги пропускаем, копируем только файлы в каталоге выгрузки.
		Если Файл.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяФайлаИсточника = Файл.ПолноеИмя;
		ИмяФайлаПриемника = СтрЗаменить(ИмяФайлаИсточника, КаталогВыгрузкиРезультат, КаталогЗагрузки);
		КопироватьФайл(ИмяФайлаИсточника, ИмяФайлаПриемника);
	КонецЦикла;
	
	// Скопируем также каталог "Ext", содержащий файлы корня конфигурации, из каталога выгрузки файлов XML.
	КаталогВыгрузкиExt = КаталогВыгрузкиРезультат + "Ext" + РазделительПути;
	Если апк_ФайлСуществует(КаталогВыгрузкиExt) Тогда
		КаталогЗагрузкиExt = КаталогЗагрузки + "Ext" + РазделительПути;
		СоздатьКаталог(КаталогЗагрузкиExt);
		апк_КаталогКопировать(КаталогВыгрузкиExt, КаталогЗагрузкиExt);
	КонецЕсли;
	
	СписокФайловДляЗагрузкиXML = апк_ПолучитьИмяВременногоФайла("txt");
	
	ДокументТекст = Новый ТекстовыйДокумент;
	ДокументТекст.ДобавитьСтроку(КаталогЗагрузки + "Configuration.xml");
	
	ДокументТекст.Записать(СписокФайловДляЗагрузкиXML);
	
	Возврат СписокФайловДляЗагрузкиXML;
	
КонецФункции

Процедура ЗаменитьПутиОбъектовКомандВТаблицеИзмененныхОбъектов(ТаблицаОбъектов)
	
	// Для команд заменяем путь к измененному объекту путем к родительскому объекту,
	// т.к. команды нельзя захватить в хранилище отдельно,
	// и ее изменения будут помещены в хранилище только при помещения родительского объекта метаданных верхнего уровня.
	Для Каждого СтрокаОбъекта Из ТаблицаОбъектов Цикл
		
		ПутьОбъекта = СтрокаОбъекта.Объект;
		
		МассивЭлементовПути = СтрРазделить(ПутьОбъекта, ".", Ложь);
		Если МассивЭлементовПути.Количество() < 2 Тогда
			Продолжить;
		КонецЕсли;
		
		НомерПоследнегоЭлемента = МассивЭлементовПути.ВГраница();
		НомерПредпоследнегоЭлемента = НомерПоследнегоЭлемента - 1;
		
		// Получаем наименование предпоследнего элемента.
		ПредпоследнийЭлемент = МассивЭлементовПути[НомерПредпоследнегоЭлемента];
		Если (СтрСравнить(ПредпоследнийЭлемент, "Команда") <> 0)
		 ИЛИ (СтрСравнить(ПредпоследнийЭлемент, "Command") <> 0) Тогда
			// Если не команда, то пропускаем.
			Продолжить;
		КонецЕсли;
		
		// Удаляем последний и предпоследний элемент пути.
		МассивЭлементовПути.Удалить(НомерПоследнегоЭлемента);
		МассивЭлементовПути.Удалить(НомерПредпоследнегоЭлемента);
		
		ОбъектРодителяПуть = СтрСоединить(МассивЭлементовПути, ".");
		СтрокаОбъекта.Объект = ОбъектРодителяПуть;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПодготовитьФайлИзмененныхОбъектовДляЗагрузкиВХранилище()
	
	ТекстОшибки = "";
	Если ПустаяСтрока(СписокИзмененныхОбъектов) Тогда
		СписокИзмененныхОбъектов = ПолучитьИмяВременногоФайла("xml");
	КонецЕсли;
	
	апк_ФайлУдалить(СписокИзмененныхОбъектов);
	
	ТаблицаИзмененныхОбъектов = ПолучитьТаблицуИзмененныхОбъектовНаСервере(Истина, Истина);
	Если ТаблицаИзмененныхОбъектов.Количество() = 0 Тогда
		Возврат ТекстОшибки;
	КонецЕсли;
	
	ТаблицаИзмененныхОбъектов.Свернуть("Объект");
	ЗаменитьПутиОбъектовКомандВТаблицеИзмененныхОбъектов(ТаблицаИзмененныхОбъектов);
	ТаблицаИзмененныхОбъектов.Свернуть("Объект");
	
	Попытка
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.ОткрытьФайл(СписокИзмененныхОбъектов);
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		ЗаписьXML.ЗаписатьНачалоЭлемента("Objects");
		ЗаписьXML.ЗаписатьАтрибут("xmlns", "http://v8.1c.ru/8.3/config/objects");
		ЗаписьXML.ЗаписатьАтрибут("version", "1.0");
		
		Для Каждого СтрокаТаблицы Из ТаблицаИзмененныхОбъектов Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("Object");
			
			ЗаписьXML.ЗаписатьАтрибут("fullName", СтрокаТаблицы.Объект);
			ЗаписьXML.ЗаписатьАтрибут("includeChildObjects", "false");
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.Закрыть();
		
	Исключение
		
		Событие = НСтр("ru='Обработка автоформатирования и локализации.Список измененных объектов';
			|en='Обработка автоформатирования и локализации.Список измененных объектов'", КодОсновногоЯзыка);
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		
		ТекстОшибки = СтрШаблон(НСтр("ru='Не удалось записать файл XML со списком измененных объектов ""%1"" по причине:
			|%2';
			|en='Не удалось записать файл XML со списком измененных объектов ""%1"" по причине:
			|%2'", КодОсновногоЯзыка), СписокИзмененныхОбъектов, ОписаниеОшибки);
		
		ЗаписьЖурналаРегистрации(Событие,,,, ТекстОшибки);
		
	КонецПопытки;
	
	Возврат ТекстОшибки;
	
КонецФункции

Процедура ТаблицаТиповОбъектовИнициализировать()
	
	Если ТаблицаТиповОбъектов <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаТиповОбъектов = Новый ТаблицаЗначений;
	ТаблицаТиповОбъектов.Колонки.Добавить("Группа");
	ТаблицаТиповОбъектов.Колонки.Добавить("Имя");
	ТаблицаТиповОбъектов.Колонки.Добавить("ИмяМнФормы");
	ТаблицаТиповОбъектов.Колонки.Добавить("ИмяАнгл");
	ТаблицаТиповОбъектов.Колонки.Добавить("ИмяАнглМнФормы");
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Constant";
	СтрокаТипаОбъекта.Имя = "Константа";
	СтрокаТипаОбъекта.ИмяМнФормы = "Константы";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Constants";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Catalog";
	СтрокаТипаОбъекта.Имя = "Справочник";
	СтрокаТипаОбъекта.ИмяМнФормы = "Справочники";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Catalogs";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Document";
	СтрокаТипаОбъекта.Имя = "Документ";
	СтрокаТипаОбъекта.ИмяМнФормы = "Документы";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Documents";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "DocumentJournal";
	СтрокаТипаОбъекта.Имя = "ЖурналДокументов";
	СтрокаТипаОбъекта.ИмяМнФормы = "ЖурналыДокументов";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "DocumentJournals";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Enum";
	СтрокаТипаОбъекта.Имя = "Перечисление";
	СтрокаТипаОбъекта.ИмяМнФормы = "Перечисления";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Enums";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Report";
	СтрокаТипаОбъекта.Имя = "Отчет";
	СтрокаТипаОбъекта.ИмяМнФормы = "Отчеты";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Reports";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "DataProcessor";
	СтрокаТипаОбъекта.Имя = "Обработка";
	СтрокаТипаОбъекта.ИмяМнФормы = "Обработки";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "DataProcessors";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ChartOfCharacteristicTypes";
	СтрокаТипаОбъекта.Имя = "ПланВидовХарактеристик";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПланыВидовХарактеристик";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ChartsOfCharacteristicTypes";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ChartOfAccounts";
	СтрокаТипаОбъекта.Имя = "ПланСчетов";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПланыСчетов";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ChartsOfAccounts";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ChartOfCalculationTypes";
	СтрокаТипаОбъекта.Имя = "ПланВидовРасчета";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПланыВидовРасчета";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ChartsOfCalculationTypes";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "InformationRegister";
	СтрокаТипаОбъекта.Имя = "РегистрСведений";
	СтрокаТипаОбъекта.ИмяМнФормы = "РегистрыСведений";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "InformationRegisters";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "AccumulationRegister";
	СтрокаТипаОбъекта.Имя = "РегистрНакопления";
	СтрокаТипаОбъекта.ИмяМнФормы = "РегистрыНакопления";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "AccumulationRegisters";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "AccountingRegister";
	СтрокаТипаОбъекта.Имя = "РегистрБухгалтерии";
	СтрокаТипаОбъекта.ИмяМнФормы = "РегистрыБухгалтерии";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "AccountingRegisters";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "CalculationRegister";
	СтрокаТипаОбъекта.Имя = "РегистрРасчета";
	СтрокаТипаОбъекта.ИмяМнФормы = "РегистрыРасчета";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "CalculationRegisters";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "BusinessProcess";
	СтрокаТипаОбъекта.Имя = "БизнесПроцесс";
	СтрокаТипаОбъекта.ИмяМнФормы = "БизнесПроцессы";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "BusinessProcesses";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Task";
	СтрокаТипаОбъекта.Имя = "Задача";
	СтрокаТипаОбъекта.ИмяМнФормы = "Задачи";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Tasks";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Form";
	СтрокаТипаОбъекта.Имя = "Форма";
	СтрокаТипаОбъекта.ИмяМнФормы = "Формы";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Forms";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Attribute";
	СтрокаТипаОбъекта.Имя = "Реквизит";
	СтрокаТипаОбъекта.ИмяМнФормы = "Реквизиты";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Attributes";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "ExchangePlan";
	СтрокаТипаОбъекта.Имя = "ПланОбмена";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПланыОбмена";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ExchangePlans";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Characteristic";
	СтрокаТипаОбъекта.Имя = "Характеристика";
	СтрокаТипаОбъекта.ИмяМнФормы = "Характеристика";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Characteristics";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Sequence";
	СтрокаТипаОбъекта.Имя = "Последовательность";
	СтрокаТипаОбъекта.ИмяМнФормы = "Последовательности";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Sequences";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Recalculation";
	СтрокаТипаОбъекта.Имя = "Перерасчет";
	СтрокаТипаОбъекта.ИмяМнФормы = "Перерасчеты";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Recalculations";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Dimension";
	СтрокаТипаОбъекта.Имя = "Измерение";
	СтрокаТипаОбъекта.ИмяМнФормы = "Измерения";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Dimensions";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Resource";
	СтрокаТипаОбъекта.Имя = "Ресурс";
	СтрокаТипаОбъекта.ИмяМнФормы = "Ресурсы";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Resources";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "TabularSection";
	СтрокаТипаОбъекта.Имя = "ТабличнаяЧасть";
	СтрокаТипаОбъекта.ИмяМнФормы = "ТабличныеЧасти";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "TabularSections";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Attribute";
	СтрокаТипаОбъекта.Имя = "Реквизит";
	СтрокаТипаОбъекта.ИмяМнФормы = "РеквизитыТабличнойЧасти";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "AttributesTabularSections";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Command";
	СтрокаТипаОбъекта.Имя = "Команда";
	СтрокаТипаОбъекта.ИмяМнФормы = "Команды";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Commands";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "Role";
	СтрокаТипаОбъекта.Имя = "Роль";
	СтрокаТипаОбъекта.ИмяМнФормы = "Роли";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Roles";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "SessionParameter";
	СтрокаТипаОбъекта.Имя = "ПараметрСеанса";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПараметрыСеанса";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "SessionParameters";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "CommonModule";
	СтрокаТипаОбъекта.Имя = "ОбщийМодуль";
	СтрокаТипаОбъекта.ИмяМнФормы = "ОбщиеМодули";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "CommonModules";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "FilterCriterion";
	СтрокаТипаОбъекта.Имя = "КритерийОтбора";
	СтрокаТипаОбъекта.ИмяМнФормы = "КритерииОтбора";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "FilterCriteria";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "EventSubscription";
	СтрокаТипаОбъекта.Имя = "ПодпискаНаСобытие";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПодпискиНаСобытия";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "EventSubscriptions";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "ScheduledJob";
	СтрокаТипаОбъекта.Имя = "РегламентноеЗадание";
	СтрокаТипаОбъекта.ИмяМнФормы = "РегламентныеЗадания";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ScheduledJobs";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "SettingsStorage";
	СтрокаТипаОбъекта.Имя = "ХранилищеНастроек";
	СтрокаТипаОбъекта.ИмяМнФормы = "ХранилищаНастроек";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "SettingsStorages";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "CommonForm";
	СтрокаТипаОбъекта.Имя = "ОбщаяФорма";
	СтрокаТипаОбъекта.ИмяМнФормы = "ОбщиеФормы";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "CommonForms";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "CommonCommand";
	СтрокаТипаОбъекта.Имя = "ОбщаяКоманда";
	СтрокаТипаОбъекта.ИмяМнФормы = "ОбщиеКоманды";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "CommonCommands";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "CommandGroup";
	СтрокаТипаОбъекта.Имя = "ГруппаКоманд";
	СтрокаТипаОбъекта.ИмяМнФормы = "ГруппыКоманд";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "CommandGroups";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "Interface";
	СтрокаТипаОбъекта.Имя = "Интерфейс";
	СтрокаТипаОбъекта.ИмяМнФормы = "Интерфейсы";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Interfaces";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "CommonTemplate";
	СтрокаТипаОбъекта.Имя = "ОбщийМакет";
	СтрокаТипаОбъекта.ИмяМнФормы = "ОбщиеМакеты";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "CommonTemplates";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "CommonPicture";
	СтрокаТипаОбъекта.Имя = "ОбщаяКартинка";
	СтрокаТипаОбъекта.ИмяМнФормы = "ОбщиеКартинки";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "CommonPictures";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "XDTOPackage";
	СтрокаТипаОбъекта.Имя = "ПакетXDTO";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПакетыXDTO";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "XDTOPackages";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "WebService";
	СтрокаТипаОбъекта.Имя = "WebСервис";
	СтрокаТипаОбъекта.ИмяМнФормы = "WebСервисы";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "WebServices";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "HTTPService";
	СтрокаТипаОбъекта.Имя = "HTTPСервис";
	СтрокаТипаОбъекта.ИмяМнФормы = "HTTPСервисы";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "HTTPServices";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "Style";
	СтрокаТипаОбъекта.Имя = "Стиль";
	СтрокаТипаОбъекта.ИмяМнФормы = "Стили";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Styles";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "StyleItem";
	СтрокаТипаОбъекта.Имя = "ЭлементСтиля";
	СтрокаТипаОбъекта.ИмяМнФормы = "ЭлементыСтиля";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "StyleItems";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "DocumentNumerator";
	СтрокаТипаОбъекта.Имя = "НумераторДокументов";
	СтрокаТипаОбъекта.ИмяМнФормы = "НумераторыДокументов";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "DocumentNumerators";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "AddressingAttribute";
	СтрокаТипаОбъекта.Имя = "РеквизитАдресации";
	СтрокаТипаОбъекта.ИмяМнФормы = "РеквизитыАдресации";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "AddressingAttributes";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "AccountingFlag";
	СтрокаТипаОбъекта.Имя = "ПризнакУчета";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПризнакиУчета";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "AccountingFlags";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ExtDimensionAccountingFlag";
	СтрокаТипаОбъекта.Имя = "ПризнакУчетаСубконто";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПризнакиУчетаСубконто";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ExtDimensionsAccountingFlags";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "Subsystem";
	СтрокаТипаОбъекта.Имя = "Подсистема";
	СтрокаТипаОбъекта.ИмяМнФормы = "Подсистемы";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Subsystems";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "WSReference";
	СтрокаТипаОбъекта.Имя = "WSСсылка";
	СтрокаТипаОбъекта.ИмяМнФормы = "WSСсылки";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "WSReferences";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "FunctionalOptionsParameter";
	СтрокаТипаОбъекта.Имя = "ПараметрФункциональныхОпций";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПараметрыФункциональныхОпций";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "FunctionalOptionsParameters";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "FunctionalOption";
	СтрокаТипаОбъекта.Имя = "ФункциональнаяОпция";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "FunctionalOptions";
	СтрокаТипаОбъекта.ИмяМнФормы = "ФункциональныеОпции";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "CommonAttribute";
	СтрокаТипаОбъекта.Имя = "ОбщийРеквизит";
	СтрокаТипаОбъекта.ИмяМнФормы = "ОбщиеРеквизиты";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "CommonAttributes";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Template";
	СтрокаТипаОбъекта.Имя = "Макет";
	СтрокаТипаОбъекта.ИмяМнФормы = "Макеты";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Templates";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Predefined";
	СтрокаТипаОбъекта.Имя = "Предопределенный";
	СтрокаТипаОбъекта.ИмяМнФормы = "Предопределенные";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Predefineds";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Configuration";
	СтрокаТипаОбъекта.Имя = "Конфигурация";
	СтрокаТипаОбъекта.ИмяМнФормы = "Конфигурация";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Configurations";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "Language";
	СтрокаТипаОбъекта.Имя = "Язык";
	СтрокаТипаОбъекта.ИмяМнФормы = "Языки";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Languages";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "EnumValue";
	СтрокаТипаОбъекта.Имя = "ЗначениеПеречисления";
	СтрокаТипаОбъекта.ИмяМнФормы = "ЗначенияПеречисления";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "EnumValues";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Column";
	СтрокаТипаОбъекта.Имя = "Графа";
	СтрокаТипаОбъекта.ИмяМнФормы = "Графы";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Columns";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ExternalDataSource";
	СтрокаТипаОбъекта.Имя = "ВнешнийИсточникДанных";
	СтрокаТипаОбъекта.ИмяМнФормы = "ВнешниеИсточникиДанных";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ExternalDataSources";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Table";
	СтрокаТипаОбъекта.Имя = "Таблица";
	СтрокаТипаОбъекта.ИмяМнФормы = "Таблицы";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Tables";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Field";
	СтрокаТипаОбъекта.Имя = "Поле";
	СтрокаТипаОбъекта.ИмяМнФормы = "Поля";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Fields";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Operation";
	СтрокаТипаОбъекта.Имя = "Операция";
	СтрокаТипаОбъекта.ИмяМнФормы = "Операции";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Operations";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Parameter";
	СтрокаТипаОбъекта.Имя = "Параметр";
	СтрокаТипаОбъекта.ИмяМнФормы = "Параметры";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Parameters";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "URLTemplate";
	СтрокаТипаОбъекта.Имя = "ШаблонURL";
	СтрокаТипаОбъекта.ИмяМнФормы = "ШаблоныURL";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "URLTemplates";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Method";
	СтрокаТипаОбъекта.Имя = "МетодШаблонаURL";
	СтрокаТипаОбъекта.ИмяМнФормы = "МетодыШаблонаURL";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Methods";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Aggregate";
	СтрокаТипаОбъекта.Имя = "Агрегат";
	СтрокаТипаОбъекта.ИмяМнФормы = "Агрегаты";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Aggregates";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "Общие";
	СтрокаТипаОбъекта.ИмяАнгл = "DefinedType";
	СтрокаТипаОбъекта.Имя = "ОпределяемыйТип";
	СтрокаТипаОбъекта.ИмяМнФормы = "ОпределяемыеТипы";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "DefinedTypes";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "StandardTabularSection";
	СтрокаТипаОбъекта.Имя = "СтандартнаяТабличнаяЧасть";
	СтрокаТипаОбъекта.ИмяМнФормы = "СтандартныеТабличныеЧасти";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "StandardTabularSections";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "StandardAttribute";
	СтрокаТипаОбъекта.Имя = "СтандартныйРеквизит";
	СтрокаТипаОбъекта.ИмяМнФормы = "СтандартныеРеквизиты";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "StandardAttributes";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Ref";
	СтрокаТипаОбъекта.Имя = "Ссылка";
	СтрокаТипаОбъекта.ИмяМнФормы = "Ссылка";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Ref";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "DeletionMark";
	СтрокаТипаОбъекта.Имя = "ПометкаУдаления";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПометкаУдаления";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "DeletionMark";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Predefined";
	СтрокаТипаОбъекта.Имя = "Предопределенный";
	СтрокаТипаОбъекта.ИмяМнФормы = "Предопределенные";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Predefineds";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "PredefinedDataName";
	СтрокаТипаОбъекта.Имя = "ИмяПредопределенныхДанных";
	СтрокаТипаОбъекта.ИмяМнФормы = "ИмяПредопределенныхДанных";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "PredefinedDataName";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Date";
	СтрокаТипаОбъекта.Имя = "Дата";
	СтрокаТипаОбъекта.ИмяМнФормы = "Дата";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Date";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Number";
	СтрокаТипаОбъекта.Имя = "Номер";
	СтрокаТипаОбъекта.ИмяМнФормы = "Номер";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Number";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Posted";
	СтрокаТипаОбъекта.Имя = "Проведен";
	СтрокаТипаОбъекта.ИмяМнФормы = "Проведен";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Posted";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "LineNumber";
	СтрокаТипаОбъекта.Имя = "НомерСтроки";
	СтрокаТипаОбъекта.ИмяМнФормы = "НомерСтроки";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "LineNumber";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Code";
	СтрокаТипаОбъекта.Имя = "Код";
	СтрокаТипаОбъекта.ИмяМнФормы = "Код";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Code";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Description";
	СтрокаТипаОбъекта.Имя = "Наименование";
	СтрокаТипаОбъекта.ИмяМнФормы = "Наименование";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Description";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Parent";
	СтрокаТипаОбъекта.Имя = "Родитель";
	СтрокаТипаОбъекта.ИмяМнФормы = "Родитель";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Parent";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Owner";
	СтрокаТипаОбъекта.Имя = "Владелец";
	СтрокаТипаОбъекта.ИмяМнФормы = "Владелец";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Owner";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "IsFolder";
	СтрокаТипаОбъекта.Имя = "ЭтоГруппа";
	СтрокаТипаОбъекта.ИмяМнФормы = "ЭтоГруппа";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "IsFolder";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Order";
	СтрокаТипаОбъекта.Имя = "Порядок";
	СтрокаТипаОбъекта.ИмяМнФормы = "Порядок";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Order";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ThisNode";
	СтрокаТипаОбъекта.Имя = "ЭтотУзел";
	СтрокаТипаОбъекта.ИмяМнФормы = "ЭтотУзел";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ThisNode";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "OffBalance";
	СтрокаТипаОбъекта.Имя = "Забалансовый";
	СтрокаТипаОбъекта.ИмяМнФормы = "Забалансовый";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "OffBalance";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Executed";
	СтрокаТипаОбъекта.Имя = "Выполнена";
	СтрокаТипаОбъекта.ИмяМнФормы = "Выполнена";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Executed";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "RoutePoint";
	СтрокаТипаОбъекта.Имя = "ТочкаМаршрута";
	СтрокаТипаОбъекта.ИмяМнФормы = "ТочкаМаршрута";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "RoutePoint";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Recorder";
	СтрокаТипаОбъекта.Имя = "Регистратор";
	СтрокаТипаОбъекта.ИмяМнФормы = "Регистратор";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Recorder";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "CalculationType";
	СтрокаТипаОбъекта.Имя = "ВидРасчета";
	СтрокаТипаОбъекта.ИмяМнФормы = "ВидРасчета";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "CalculationType";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ActionPeriod";
	СтрокаТипаОбъекта.Имя = "ПериодДействия";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПериодДействия";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ActionPeriod";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "BegOfActionPeriod";
	СтрокаТипаОбъекта.Имя = "ПериодДействияНачало";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПериодДействияНачало";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "BegOfActionPeriod";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "EndOfActionPeriod";
	СтрокаТипаОбъекта.Имя = "ПериодДействияКонец";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПериодДействияКонец";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "EndOfActionPeriod";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "BegOfBasePeriod";
	СтрокаТипаОбъекта.Имя = "БазовыйПериодНачало";
	СтрокаТипаОбъекта.ИмяМнФормы = "БазовыйПериодНачало";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "BegOfBasePeriod";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "EndOfBasePeriod";
	СтрокаТипаОбъекта.Имя = "БазовыйПериодКонец";
	СтрокаТипаОбъекта.ИмяМнФормы = "БазовыйПериодКонец";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "EndOfBasePeriod";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Active";
	СтрокаТипаОбъекта.Имя = "Активность";
	СтрокаТипаОбъекта.ИмяМнФормы = "Активность";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Active";
	
	Для НомерСубконто = 1 По 10 Цикл
		СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
		СтрокаТипаОбъекта.Группа = "";
		СтрокаТипаОбъекта.ИмяАнгл = "ExtDimension" + НомерСубконто;
		СтрокаТипаОбъекта.Имя = "Субконто" + НомерСубконто;
		СтрокаТипаОбъекта.ИмяМнФормы = "Субконто" + НомерСубконто;
		СтрокаТипаОбъекта.ИмяАнглМнФормы = "ExtDimension" + НомерСубконто;
		
		СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
		СтрокаТипаОбъекта.Группа = "";
		СтрокаТипаОбъекта.ИмяАнгл = "ExtDimensionType" + НомерСубконто;
		СтрокаТипаОбъекта.Имя = "ВидСубконто" + НомерСубконто;
		СтрокаТипаОбъекта.ИмяМнФормы = "ВидСубконто" + НомерСубконто;
		СтрокаТипаОбъекта.ИмяАнглМнФормы = "ExtDimensionType" + НомерСубконто;
	КонецЦикла;
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ReversingEntry";
	СтрокаТипаОбъекта.Имя = "Сторно";
	СтрокаТипаОбъекта.ИмяМнФормы = "Сторно";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ReversingEntry";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "RegistrationPeriod";
	СтрокаТипаОбъекта.Имя = "ПериодРегистрации";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПериодРегистрации";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "RegistrationPeriod";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "SentNo";
	СтрокаТипаОбъекта.Имя = "НомерОтправленного";
	СтрокаТипаОбъекта.ИмяМнФормы = "НомерОтправленного";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "SentNo";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ReceivedNo";
	СтрокаТипаОбъекта.Имя = "НомерПринятого";
	СтрокаТипаОбъекта.ИмяМнФормы = "НомерПринятого";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ReceivedNo";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Account";
	СтрокаТипаОбъекта.Имя = "Счет";
	СтрокаТипаОбъекта.ИмяМнФормы = "Счет";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Account";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "RecordType";
	СтрокаТипаОбъекта.Имя = "ВидДвижения";
	СтрокаТипаОбъекта.ИмяМнФормы = "ВидДвижения";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "RecordType";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Period";
	СтрокаТипаОбъекта.Имя = "Период";
	СтрокаТипаОбъекта.ИмяМнФормы = "Период";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Period";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Started";
	СтрокаТипаОбъекта.Имя = "Стартован";
	СтрокаТипаОбъекта.ИмяМнФормы = "Стартован";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Started";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "HeadTask";
	СтрокаТипаОбъекта.Имя = "ВедущаяЗадача";
	СтрокаТипаОбъекта.ИмяМнФормы = "ВедущаяЗадача";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "HeadTask";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Completed";
	СтрокаТипаОбъекта.Имя = "Завершен";
	СтрокаТипаОбъекта.ИмяМнФормы = "Завершен";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Completed";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ActionPeriodIsBasic";
	СтрокаТипаОбъекта.Имя = "ПериодДействияБазовый";
	СтрокаТипаОбъекта.ИмяМнФормы = "ПериодДействияБазовый";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ActionPeriodIsBasic";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ValueType";
	СтрокаТипаОбъекта.Имя = "ТипЗначения";
	СтрокаТипаОбъекта.ИмяМнФормы = "ТипЗначения";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ValueType";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Type";
	СтрокаТипаОбъекта.Имя = "Тип";
	СтрокаТипаОбъекта.ИмяМнФормы = "Тип";// - ЖурналДокументов
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Type";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Type";
	СтрокаТипаОбъекта.Имя = "Вид";
	СтрокаТипаОбъекта.ИмяМнФормы = "Вид";// - ПланСчетов
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Type";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ExtDimensionTypes";
	СтрокаТипаОбъекта.Имя = "ВидыСубконто";
	СтрокаТипаОбъекта.ИмяМнФормы = "ВидыСубконто";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ExtDimensionTypes";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "TurnoversOnly";
	СтрокаТипаОбъекта.Имя = "ТолькоОбороты";
	СтрокаТипаОбъекта.ИмяМнФормы = "ТолькоОбороты";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "TurnoversOnly";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ExtDimensionType";
	СтрокаТипаОбъекта.Имя = "ВидСубконто";
	СтрокаТипаОбъекта.ИмяМнФормы = "ВидСубконто";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ExtDimensionType";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "BaseCalculationTypes";
	СтрокаТипаОбъекта.Имя = "БазовыеВидыРасчета";
	СтрокаТипаОбъекта.ИмяМнФормы = "БазовыеВидыРасчета";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "BaseCalculationTypes";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "DisplacingCalculationTypes";
	СтрокаТипаОбъекта.Имя = "ВытесняющиеВидыРасчета";
	СтрокаТипаОбъекта.ИмяМнФормы = "ВытесняющиеВидыРасчета";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "DisplacingCalculationTypes";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "LeadingCalculationTypes";
	СтрокаТипаОбъекта.Имя = "ВедущиеВидыРасчета";
	СтрокаТипаОбъекта.ИмяМнФормы = "ВедущиеВидыРасчета";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "LeadingCalculationTypes";
	
	// Модули
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Module";
	СтрокаТипаОбъекта.Имя = "Модуль";
	СтрокаТипаОбъекта.ИмяМнФормы = "Модуль";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Module";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "CommandModule";
	СтрокаТипаОбъекта.Имя = "МодульКоманды";
	СтрокаТипаОбъекта.ИмяМнФормы = "МодульКоманды";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "CommandModule";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ObjectModule";
	СтрокаТипаОбъекта.Имя = "МодульОбъекта";
	СтрокаТипаОбъекта.ИмяМнФормы = "МодульОбъекта";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ObjectModule";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ManagerModule";
	СтрокаТипаОбъекта.Имя = "МодульМенеджера";
	СтрокаТипаОбъекта.ИмяМнФормы = "МодульМенеджера";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ManagerModule";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "RecordSetModule";
	СтрокаТипаОбъекта.Имя = "МодульНабораЗаписей";
	СтрокаТипаОбъекта.ИмяМнФормы = "МодульНабораЗаписей";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "RecordSetModule";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ValueManagerModule";
	СтрокаТипаОбъекта.Имя = "МодульМенеджераЗначения";
	СтрокаТипаОбъекта.ИмяМнФормы = "МодульМенеджераЗначения";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ValueManagerModule";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ApplicationModule";
	СтрокаТипаОбъекта.Имя = "МодульПриложения";
	СтрокаТипаОбъекта.ИмяМнФормы = "МодульПриложения";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ApplicationModule";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ManagedApplicationModule";
	СтрокаТипаОбъекта.Имя = "МодульУправляемогоПриложения";
	СтрокаТипаОбъекта.ИмяМнФормы = "МодульУправляемогоПриложения";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ManagedApplicationModule";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "SessionModule";
	СтрокаТипаОбъекта.Имя = "МодульСеанса";
	СтрокаТипаОбъекта.ИмяМнФормы = "МодульСеанса";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "SessionModule";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "ExternalConnectionModule";
	СтрокаТипаОбъекта.Имя = "МодульВнешнегоСоединения";
	СтрокаТипаОбъекта.ИмяМнФормы = "МодульВнешнегоСоединения";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "ExternalConnectionModule";
	
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "OrdinaryApplicationModule";
	СтрокаТипаОбъекта.Имя = "МодульОбычногоПриложения";
	СтрокаТипаОбъекта.ИмяМнФормы = "МодульОбычногоПриложения";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "OrdinaryApplicationModule";
	
	// Права
	СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Добавить();
	СтрокаТипаОбъекта.Группа = "";
	СтрокаТипаОбъекта.ИмяАнгл = "Right";
	СтрокаТипаОбъекта.Имя = "Право";
	СтрокаТипаОбъекта.ИмяМнФормы = "Права";
	СтрокаТипаОбъекта.ИмяАнглМнФормы = "Rights";
	
	ТаблицаТиповОбъектов.Индексы.Добавить("ИмяАнгл");
	ТаблицаТиповОбъектов.Индексы.Добавить("Имя");
	ТаблицаТиповОбъектов.Индексы.Добавить("ИмяМнФормы");
	ТаблицаТиповОбъектов.Индексы.Добавить("ИмяАнглМнФормы");
	
КонецПроцедуры

Функция ПолучитьТипОбъектаПоТаблицеТипов(ЗначениеПоиска, КолонкаПоиска = "ИмяАнгл", КолонкаИмени = "Имя", ЗначениеПоУмолчанию = Неопределено)
	
	ТаблицаТиповОбъектовИнициализировать();
	
	СтандартныйТип = ТаблицаТиповОбъектов.Найти(ЗначениеПоиска, КолонкаПоиска);
	Возврат ?(СтандартныйТип = Неопределено,
		?(ЗначениеПоУмолчанию = Неопределено, ЗначениеПоиска, ЗначениеПоУмолчанию),
		СтандартныйТип[КолонкаИмени]);
	
КонецФункции

Функция ПолучитьКлассОбъекта(ПутьОбъекта, Разделитель = ".")
	
	МассивПути = СтрРазделить(ПутьОбъекта, Разделитель, Ложь);
	КоличествоЭлементовПути = МассивПути.Количество();
	
	Если КоличествоЭлементовПути = 0 Тогда
		Возврат "";
	ИначеЕсли КоличествоЭлементовПути <= 2 Тогда
		НомерЭлемента = 0;
	Иначе
		НомерЭлемента = 2;
	КонецЕсли;
	
	Возврат МассивПути[НомерЭлемента];
	
КонецФункции

Функция ПолучитьПутьОбъектаИзФайлаВыгрузки(ФайлВыгрузки, Разделитель = ".", КолонкаИмени = "Имя")
	
	ТаблицаТиповОбъектовИнициализировать();
	
	// Удаляем каталог выгрузки из пути объекта.
	ИмяОбъекта = СтрЗаменить(ФайлВыгрузки, КаталогВыгрузкиРезультат, "");
	
	Если ЭтоВыгрузкаXMLФайлов() Тогда
		// Очищаем каталог "Ext" из пути объекта
		Если СтрНачинаетсяС(ИмяОбъекта, "Ext" + РазделительПути) Тогда
			// Для файлов конфигурации, например "Configuration.xml", каталог "Ext" лежит в корне каталога выгрузки,
			// удалим его из начала пути, взяв оставшуюся часть по длине строки "Ext\".
			ИмяОбъекта = Сред(ИмяОбъекта, СтрДлина("Ext" + РазделительПути) + 1);
		Иначе
			// Для файлов всех остальных объектов очистим каталог "Ext" заменой на "\".
			ИмяОбъекта = СтрЗаменить(ИмяОбъекта, СтрШаблон("%1Ext%1", РазделительПути), РазделительПути);
		КонецЕсли;
	Иначе
		Если СтрНачинаетсяС(ВРег(ИмяОбъекта), ВРег("src" + РазделительПути)) Тогда
			ИмяОбъекта = Сред(ИмяОбъекта, СтрДлина("src" + РазделительПути) + 1);
		КонецЕсли;
	КонецЕсли;
	
	ИмяОбъекта = СтрЗаменить(ИмяОбъекта, РазделительПути, Разделитель);
	ИмяОбъекта = ПолучитьИмяФайлаБезРасширения(ИмяОбъекта);
	
	МассивПутиАнгл = СтрРазделить(ИмяОбъекта, Разделитель, Ложь);
	КоличествоЭлементовПутиАнгл = МассивПутиАнгл.Количество();
	
	// Для файлов конфигурации, лежащих в самом каталоге выгрузки, задаем имя объекта как "Конфигурация" (или "Configuration").
	Если ЭтоВыгрузкаXMLФайлов() Тогда
		// Для выгрузки XML количество элементов будет меньше 2-х, т.к. каталог "Ext" удалили из пути ранее.
		Если КоличествоЭлементовПутиАнгл < 2 Тогда
			Возврат ПолучитьТипОбъектаПоТаблицеТипов("Конфигурация", "Имя", КолонкаИмени);
		КонецЕсли;
	Иначе
		// Для проекта ETD файлы конфигурации будут лежать в каталоге "Configuration".
		Если СтрСравнить(МассивПутиАнгл[0], "Configuration") = 0 Тогда
			Возврат ПолучитьТипОбъектаПоТаблицеТипов("Конфигурация", "Имя", КолонкаИмени);
		КонецЕсли;
	КонецЕсли;
	
	ПутьФактический = "";
	
	// Для общих форм всегда берем 2 элемента пути, т.к. в пути к модулю будет 4 элемента пути, и объект определяется неправильно.
	Если СтрСравнить(МассивПутиАнгл[0], "CommonForms") = 0 Тогда
		КоличествоЭлементов = 2;
	Иначе
		КоличествоЭлементов = ?(КоличествоЭлементовПутиАнгл < 4, 2, 4);
	КонецЕсли;
	
	МассивПути = Новый Массив;
	Для Счетчик = 1 По КоличествоЭлементов Цикл
		
		ЭлементПути = МассивПутиАнгл[Счетчик - 1];
		// Если элемент пути стоит на нечетном месте (нумерация с 1) в имени файла,
		// то ищем его эквивалент на русском языке в единственном числе.
		Если Счетчик % 2 = 1 Тогда
			ЭлементПути = ПолучитьТипОбъектаПоТаблицеТипов(ЭлементПути, "ИмяАнглМнФормы", КолонкаИмени);
		КонецЕсли;
		
		// Четные элементы пути оставляем как есть - это наименования объектов метаданных.
		МассивПути.Добавить(ЭлементПути);
		
	КонецЦикла;
	
	ПутьФактический = СтрСоединить(МассивПути, Разделитель);
	
	Возврат ПутьФактический;
	
КонецФункции

Функция ПолучитьПутьРодителяОбъекта(ПутьОбъекта)
	
	ПутьРодителяОбъекта = "";
	
	МассивПутьОбъекта = СтрРазделить(ПутьОбъекта, ".");
	
	// Если путь состоит из 2 элементов, то родитель - Конфигурация.
	// Например: "Роли.Роль1", "РегистрыБухгалтерии.РегистрБухгалтерии1".
	Если МассивПутьОбъекта.Количество() = 2 Тогда
		ПутьРодителяОбъекта = "Конфигурация";
		
	// Если путь состоит из 4 элементов, то родитель - объект метаданных.
	// Например: "РегистрРасчета.РегистрРасчета1.Реквизит.Реквизит1". "Справочник.ИдентификаторыОбъектовМетаданных.Форма.ФормаЭлемента".
	ИначеЕсли МассивПутьОбъекта.Количество() = 4 Тогда
		ПутьРодителяОбъекта = МассивПутьОбъекта[0] + "." + МассивПутьОбъекта[1];
		
	КонецЕсли;
	
	Возврат ПутьРодителяОбъекта;
	
КонецФункции

Функция ПолучитьЗначениеОбъекта(ЗначениеПоиска, КолонкаПоиска = "ПолноеИмяФайла", КолонкаВозврата = "Объект",
	ПараметрыОтбора = Неопределено, ЗначениеПоУмолчанию = "")
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить(КолонкаПоиска, ЗначениеПоиска);
	
	ПолноеИмяФайлаОкончание = "";
	Если ПараметрыОтбора <> Неопределено Тогда
		
		Если ПараметрыОтбора.Свойство("ЗахваченВХранилище") Тогда
			СтруктураОтбора.Вставить("ЗахваченВХранилище", ПараметрыОтбора.ЗахваченВХранилище);
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("РедактированиеРазрешено") Тогда
			СтруктураОтбора.Вставить("РедактированиеРазрешено", ПараметрыОтбора.РедактированиеРазрешено);
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("Выбран") Тогда
			СтруктураОтбора.Вставить("Выбран", ПараметрыОтбора.Выбран);
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("Изменен") Тогда
			СтруктураОтбора.Вставить("Изменен", ПараметрыОтбора.Изменен);
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("ПолноеИмяФайлаОкончание") Тогда
			ПолноеИмяФайлаОкончание = ПараметрыОтбора.ПолноеИмяФайлаОкончание;
		КонецЕсли;
		
	КонецЕсли;
	
	МассивСтрокРезультат = Результат.НайтиСтроки(СтруктураОтбора);
	
	КоличествоСтрок = МассивСтрокРезультат.Количество();
	Если КоличествоСтрок = 0 Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	ЗначениеВозврата = Неопределено;
	Для Каждого СтрокаРезультата Из МассивСтрокРезультат Цикл
		
		ЗначениеРезультата = СтрокаРезультата[КолонкаВозврата];
		
		// Если задан дополнительный отбор по окончанию имени файла, то проверяем.
		Если (КолонкаВозврата = "ПолноеИмяФайла") И (НЕ ПустаяСтрока(ПолноеИмяФайлаОкончание)) Тогда
			
			// Если окончание имени файла подходит, то прерываем.
			Если СтрЗаканчиваетсяНа(ВРег(ЗначениеРезультата), ВРег(ПолноеИмяФайлаОкончание)) Тогда
				ЗначениеВозврата = ЗначениеРезультата;
				Прервать;
			КонецЕсли;
			
			// Если не подходит, то ищем дальше.
			Продолжить;
			
		КонецЕсли;
		
		// Иначе возвращаем первое попавшееся значение.
		ЗначениеВозврата = ЗначениеРезультата;
		Прервать;
		
	КонецЦикла;
	
	Возврат ?(ЗначениеВозврата = Неопределено, ЗначениеПоУмолчанию, ЗначениеВозврата);
	
КонецФункции

// Функция проверяет выбран ли хоть один объект для автоформатирования.
// Если не выбран ни один, то обрабатываем все.
//
Функция ПроверитьУстановленОтборПоОбъектам()
	
	Если СтруктураКонфигурации.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат (СтруктураКонфигурации.Найти(Истина, "Флаг") <> Неопределено);
	
КонецФункции

Процедура ИнициализироватьТаблицуВыбранныхОбъектов()
	
	ТаблицаПутейОбъектов = СтруктураКонфигурации.Выгрузить(, "ПутьОбъекта, Флаг");
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Флаг", Истина);
	
	ТаблицаВыбранныхОбъектов = ТаблицаПутейОбъектов.Скопировать(ПараметрыОтбора);
	ТаблицаВыбранныхОбъектов.Индексы.Добавить("ПутьОбъекта");
	
КонецПроцедуры

Процедура СохранитьТаблицуИзмененныхОбъектовВФайл(ПутьКФайлу) Экспорт
	
	Попытка
		ЗначениеВФайл(ПутьКФайлу, ТаблицаИзмененныхОбъектовИСтандартов);
	Исключение
		// АПК:280 - обработка исключения не требуется.
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область КомандыЗапускаКонфигуратораВПакетномРежиме

// Функция запускает проверяемую конфигурацию в режиме конфигуратора,
// подключается к хранилищу, обновляется из него и обновляет информационную базу.
//
Функция ЗагрузитьКонфигурациюИзХранилища() Экспорт
	
	ИмяФайлаЛога = ПолучитьИмяВременногоФайла("txt");
	
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда
		СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	КонецЕсли;
	
	Если НЕ апк_ФайлСуществует(СтрокаЗапускаПлатформы) Тогда
		Статус = НСтр("ru = 'Не найден файл запуска платформы в каталоге программы по пути:';
			|en = 'Не найден файл запуска платформы в каталоге программы по пути:'", КодОсновногоЯзыка) + Символы.ПС + СтрокаЗапускаПлатформы;
		Возврат Статус;
	КонецЕсли;
	
	КоманднаяСтрока = ЗаключитьСтрокуВКавычки(СтрокаЗапускаПлатформы)
		+ " DESIGNER " + ПолучитьСтрокуПодключенияКБазе(ПутьКБазе)
		+ " /N" + ЗаключитьСтрокуВКавычки(Пользователь)
		+ " /P" + ЗаключитьСтрокуВКавычки(Пароль)
		+ " /ConfigurationRepositoryF " + ЗаключитьСтрокуВКавычки(КаталогХранилища)
		+ " /ConfigurationRepositoryN " + ЗаключитьСтрокуВКавычки(ПользовательХранилища)
		+ " /ConfigurationRepositoryP " + ЗаключитьСтрокуВКавычки(ПарольХранилища)
		+ " /ConfigurationRepositoryUpdateCfg -revised -force"
		+ " /Out " + ЗаключитьСтрокуВКавычки(ИмяФайлаЛога)
		+ " /DisableStartupDialogs /DisableStartupMessages";
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(КоманднаяСтрока,, Истина, КодВозврата);
	
	Если КодВозврата = 0 Тогда
		апк_ФайлУдалить(ИмяФайлаЛога);
		Возврат "";
	КонецЕсли;
	
	ФайлЛога = ПолучитьТекстовыйДокументИзФайла(ИмяФайлаЛога);
	Если ФайлЛога = Неопределено Тогда
		Статус = НСтр("ru='Не найден файл лога по пути:'; en='Не найден файл лога по пути:'", КодОсновногоЯзыка)
			+ Символы.ПС + ИмяФайлаЛога;
		Возврат Статус;
	КонецЕсли;
	
	ТекстЛога = ФайлЛога.ПолучитьТекст();
	
	апк_ФайлУдалить(ИмяФайлаЛога);
	
	Возврат ТекстЛога;
	
КонецФункции

// Функция запускает проверяемую конфигурацию в режиме конфигуратора и подключается к хранилищу.
//
Функция ПодключитьКонфигурациюКХранилищу() Экспорт
	
	ИмяФайлаЛога = ПолучитьИмяВременногоФайла("txt");
	
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда
		СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	КонецЕсли;
	
	Если НЕ апк_ФайлСуществует(СтрокаЗапускаПлатформы) Тогда
		Статус = НСтр("ru = 'Не найден файл запуска платформы в каталоге программы по пути:';
			|en = 'Не найден файл запуска платформы в каталоге программы по пути:'", КодОсновногоЯзыка) + Символы.ПС + СтрокаЗапускаПлатформы;
		Возврат Статус;
	КонецЕсли;
	
	КоманднаяСтрока = ЗаключитьСтрокуВКавычки(СтрокаЗапускаПлатформы)
		+ " DESIGNER " + ПолучитьСтрокуПодключенияКБазе(ПутьКБазе)
		+ " /N" + ЗаключитьСтрокуВКавычки(Пользователь)
		+ " /P" + ЗаключитьСтрокуВКавычки(Пароль)
		+ " /ConfigurationRepositoryF " + ЗаключитьСтрокуВКавычки(КаталогХранилища)
		+ " /ConfigurationRepositoryN " + ЗаключитьСтрокуВКавычки(ПользовательХранилища)
		+ " /ConfigurationRepositoryP " + ЗаключитьСтрокуВКавычки(ПарольХранилища)
		+ " /ConfigurationRepositoryBindCfg -forceBindAlreadyBindedUser -forceReplaceCfg"
		+ " /Out " + ЗаключитьСтрокуВКавычки(ИмяФайлаЛога)
		+ " /DisableStartupDialogs /DisableStartupMessages";
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(КоманднаяСтрока,, Истина, КодВозврата);
	
	// Подключение прошло успешно, возвращаем пустую строку.
	Если КодВозврата = 0 Тогда
		апк_ФайлУдалить(ИмяФайлаЛога);
		Возврат "";
	КонецЕсли;
	
	// Подключение прошло с ошибкой, возвращаем текст ошибки.
	ТекстЛога = ПолучитьТекстФайла(ИмяФайлаЛога);
	
	Возврат ТекстЛога;
	
КонецФункции

// Функция запускает проверяемую конфигурацию в режиме конфигуратора и захватывает все объекты в хранилище.
//
Функция ЗахватитьОбъектыКонфигурацииВХранилище() Экспорт
	
	ИмяФайлаЛога = ПолучитьИмяВременногоФайла("txt");
	
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда
		СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	КонецЕсли;
	
	Если НЕ апк_ФайлСуществует(СтрокаЗапускаПлатформы) Тогда
		Статус = НСтр("ru = 'Не найден файл запуска платформы в каталоге программы по пути:';
			|en = 'Не найден файл запуска платформы в каталоге программы по пути:'", КодОсновногоЯзыка) + Символы.ПС + СтрокаЗапускаПлатформы;
		Возврат Статус;
	КонецЕсли;
	
	КоманднаяСтрока = ЗаключитьСтрокуВКавычки(СтрокаЗапускаПлатформы)
		+ " DESIGNER " + ПолучитьСтрокуПодключенияКБазе(ПутьКБазе)
		+ " /N" + ЗаключитьСтрокуВКавычки(Пользователь)
		+ " /P" + ЗаключитьСтрокуВКавычки(Пароль)
		+ " /ConfigurationRepositoryF " + ЗаключитьСтрокуВКавычки(КаталогХранилища)
		+ " /ConfigurationRepositoryN " + ЗаключитьСтрокуВКавычки(ПользовательХранилища)
		+ " /ConfigurationRepositoryP " + ЗаключитьСтрокуВКавычки(ПарольХранилища)
		+ " /ConfigurationRepositoryLock -revised"
		+ " /Out " + ЗаключитьСтрокуВКавычки(ИмяФайлаЛога)
		+ " /DisableStartupDialogs /DisableStartupMessages";
	
	// Код возврата в данном случае не анализируем, т.к. он будет отличен от 0,
	// даже если хотя бы один объект захватить не удалось.
	ЗапуститьПриложение(КоманднаяСтрока,, Истина);
	
	// Заполняем таблицу захваченных объектов.
	Статус = ЗаполнитьТаблицуЗахваченныхОбъектов(ИмяФайлаЛога);
	
	апк_ФайлУдалить(ИмяФайлаЛога);
	
	Возврат Статус;
	
КонецФункции

// Функция запускает проверяемую конфигурацию в режиме конфигуратора, чтобы выгрузить файлы XML.
// Возвращает пустую строку, если выгрузка удачна, иначе лог выгрузки.
//
Функция ВыгрузитьКонфигурациюВФайлыXML() Экспорт
	
	ФайлЛога = ПолучитьИмяВременногоФайла("txt");
	
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда
		СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	КонецЕсли;
	
	Если НЕ апк_ФайлСуществует(СтрокаЗапускаПлатформы) Тогда
		Статус = НСтр("ru = 'Не найден файл запуска платформы в каталоге программы по пути:';
			|en = 'Не найден файл запуска платформы в каталоге программы по пути:'", КодОсновногоЯзыка) + Символы.ПС + СтрокаЗапускаПлатформы;
		Возврат Статус;
	КонецЕсли;
	
	СоздатьКаталог(КаталогВыгрузки);
	СоздатьКаталог(КаталогВыгрузкиРезультат);
	
	// Выгружаем конфигурацию в файлы xml.
	СтрокаЗапуска = """%1"" DESIGNER %2 /N""%3"" /P""%4"" /DumpConfigToFiles ""%5"" /Out ""%6"""
		" /DisableStartupDialogs /DisableStartupMessages";
	СтрокаЗапуска = СтрШаблон(СтрокаЗапуска,
		СтрокаЗапускаПлатформы,
		ПолучитьСтрокуПодключенияКБазе(ПутьКБазе),
		Пользователь,
		Пароль,
		КаталогВыгрузки,
		ФайлЛога);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(СтрокаЗапуска,, Истина, КодВозврата);
	
	Если КодВозврата = 0 Тогда
		апк_ФайлУдалить(ФайлЛога);
		Возврат "";
	КонецЕсли;
	
	Статус = ПолучитьЛогВыгрузкиФайловКонфигурации(ФайлЛога);
	Возврат Статус;
	
КонецФункции

// Выполняет частичную загрузку файлов XML.
//
Функция ЗагрузитьКонфигурациюИзФайловXMLПоСпискуФайлов(КаталогЗагрузки, СписокФайловДляЗагрузкиXML)
	
	ФайлЛога = ПолучитьИмяВременногоФайла("txt");
	
	// Загружаем конфигурацию из файлов xml.
	СтрокаЗапуска = """%1"" DESIGNER %2 /N""%3"" /P""%4"" /LoadConfigFromFiles ""%5"" -listFile ""%6"" /Out ""%7"""
		" /DisableStartupDialogs /DisableStartupMessages";
	СтрокаЗапуска = СтрШаблон(СтрокаЗапуска,
		СтрокаЗапускаПлатформы,
		ПолучитьСтрокуПодключенияКБазе(ПутьКБазе),
		Пользователь,
		Пароль,
		КаталогЗагрузки,
		СписокФайловДляЗагрузкиXML,
		ФайлЛога);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(СтрокаЗапуска,, Истина, КодВозврата);
	
	// В режиме отладки копируем файл лога в родительский каталог выгрузки.
	Если РежимОтладки Тогда
		СкопироватьФайлЛога(ФайлЛога);
	КонецЕсли;
	
	Если КодВозврата = 0 Тогда
		апк_ФайлУдалить(ФайлЛога);
		Возврат "";
	КонецЕсли;
	
	Статус = ПолучитьЛогВыгрузкиФайловКонфигурации(ФайлЛога);
	
	Возврат Статус;
	
КонецФункции

// Функция запускает проверяемую конфигурацию в режиме конфигуратора, чтобы загрузить файлы XML.
//
Функция ЗагрузитьКонфигурациюИзФайловXML() Экспорт
	
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда
		СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	КонецЕсли;
	
	Если НЕ апк_ФайлСуществует(СтрокаЗапускаПлатформы) Тогда
		Статус = НСтр("ru = 'Не найден файл запуска платформы в каталоге программы по пути:';
			|en = 'Не найден файл запуска платформы в каталоге программы по пути:'", КодОсновногоЯзыка) + Символы.ПС + СтрокаЗапускаПлатформы;
		Возврат Статус;
	КонецЕсли;
	
	Статус = ЗагрузитьКореньКонфигурацииИзФайловXML();
	Если НЕ ПустаяСтрока(Статус) Тогда
		Возврат Статус;
	КонецЕсли;
	
	Статус = ЗагрузитьОбъектыКонфигурацииИзФайловXML();
	Если НЕ ПустаяСтрока(Статус) Тогда
		Возврат Статус;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ЗагрузитьКореньКонфигурацииИзФайловXML()
	
	// Подготовим отдельно файл конфигурации для загрузки.
	КаталогЗагрузки = "";
	СписокФайловДляЗагрузкиXML = ПодготовитьФайлКонфигурацииДляЗагрузкиФайловXML(КаталогЗагрузки);
	Если ПустаяСтрока(СписокФайловДляЗагрузкиXML) Тогда
		Возврат "";
	КонецЕсли;
	
	Статус = ЗагрузитьКонфигурациюИзФайловXMLПоСпискуФайлов(КаталогЗагрузки, СписокФайловДляЗагрузкиXML);
	
	// В режиме отладки не удаляем исходную информацию.
	Если НЕ РежимОтладки Тогда
		апк_ФайлУдалить(КаталогЗагрузки);
		апк_ФайлУдалить(СписокФайловДляЗагрузкиXML);
	КонецЕсли;
	
	Возврат Статус;
	
КонецФункции

Функция ЗагрузитьОбъектыКонфигурацииИзФайловXML()
	
	// Подготовим файл измененных объектов XML, которые нужно загрузить в конфигурацию.
	СписокФайловДляЗагрузкиXML = ПодготовитьФайлИзмененныхОбъектовДляЗагрузкиФайловXML();
	Если ПустаяСтрока(СписокФайловДляЗагрузкиXML) Тогда
		// Если измененных файлов нет, то вернется пустая строка. Загружать нечего, выходим.
		Возврат "";
	КонецЕсли;
	
	Статус = ЗагрузитьКонфигурациюИзФайловXMLПоСпискуФайлов(КаталогВыгрузкиРезультат, СписокФайловДляЗагрузкиXML);
	
	// В режиме отладки не удаляем исходную информацию.
	Если НЕ РежимОтладки Тогда
		апк_ФайлУдалить(СписокФайловДляЗагрузкиXML);
	КонецЕсли;
	
	Возврат Статус;
	
КонецФункции

Функция ОбновитьКонфигурациюБД() Экспорт
	
	ИмяФайлаЛога = ПолучитьИмяВременногоФайла("txt");
	
	КлючСервер = "";
	Если ТипИсточника = 1 Тогда
		КлючСервер = " -Server";
	КонецЕсли;
	
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда
		СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	КонецЕсли;
	
	Если НЕ апк_ФайлСуществует(СтрокаЗапускаПлатформы) Тогда
		Статус = НСтр("ru = 'Не найден файл запуска платформы в каталоге программы по пути:';
			|en = 'Не найден файл запуска платформы в каталоге программы по пути:'", КодОсновногоЯзыка) + Символы.ПС + СтрокаЗапускаПлатформы;
		Возврат Статус;
	КонецЕсли;
	
	КоманднаяСтрока = ЗаключитьСтрокуВКавычки(СтрокаЗапускаПлатформы)
		+ " DESIGNER " + ПолучитьСтрокуПодключенияКБазе(ПутьКБазе)
		+ " /N" + ЗаключитьСтрокуВКавычки(Пользователь)
		+ " /P" + ЗаключитьСтрокуВКавычки(Пароль)
		+ " /UpdateDBCfg " + КлючСервер
		+ " /Out " + ЗаключитьСтрокуВКавычки(ИмяФайлаЛога);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(КоманднаяСтрока,, Истина, КодВозврата);
	
	Если КодВозврата = 0 Тогда
		апк_ФайлУдалить(ИмяФайлаЛога);
		Возврат "";
	КонецЕсли;
	
	ТекстЛога = ПолучитьЛогВыгрузкиФайловКонфигурации(ИмяФайлаЛога);
	
	Возврат ?(СтрНайти(ТекстЛога, НСтр("ru = 'Обновление конфигурации успешно завершено';
		|en = 'Обновление конфигурации успешно завершено'", КодОсновногоЯзыка)) > 0, "", ТекстЛога);
	
КонецФункции

Функция ПоместитьИзмененныеОбъектыВХранилище() Экспорт
	
	ИмяФайлаЛога = ПолучитьИмяВременногоФайла("txt");
	
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда
		СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	КонецЕсли;
	
	Если НЕ апк_ФайлСуществует(СтрокаЗапускаПлатформы) Тогда
		Статус = НСтр("ru = 'Не найден файл запуска платформы в каталоге программы по пути:';
			|en = 'Не найден файл запуска платформы в каталоге программы по пути:'", КодОсновногоЯзыка)
			+ Символы.ПС + СтрокаЗапускаПлатформы;
		Возврат Статус;
	КонецЕсли;
	
	Статус = ПодготовитьФайлИзмененныхОбъектовДляЗагрузкиВХранилище();
	Если НЕ ПустаяСтрока(Статус) Тогда
		// При создании файла произошла ошибка, возвращаем текст ошибки.
		Возврат Статус;
	КонецЕсли;
	
	Если НЕ апк_ФайлСуществует(СписокИзмененныхОбъектов) Тогда
		// Файла не существует, значит, нет измененных объектов для помещения в хранилище, выходим.
		Возврат "";
	КонецЕсли;
	
	// Поместим только захваченные измененные объекты в хранилище.
	СтрокаЗапуска = """%1"" DESIGNER %2 /N""%3"" /P""%4"""
		+ " /ConfigurationRepositoryF ""%5"""
		+ " /ConfigurationRepositoryN ""%6"""
		+ " /ConfigurationRepositoryP ""%7"""
		+ " /ConfigurationRepositoryCommit -objects ""%8"" -comment ""%9"""
		+ " /Out ""%10"""
		+ " /DisableStartupDialogs /DisableStartupMessages";
	СтрокаЗапуска = СтрШаблон(СтрокаЗапуска,
		СтрокаЗапускаПлатформы,
		ПолучитьСтрокуПодключенияКБазе(ПутьКБазе),
		Пользователь,
		Пароль,
		КаталогХранилища,
		ПользовательХранилища,
		ПарольХранилища,
		СписокИзмененныхОбъектов,
		ТекстКомментария,
		ИмяФайлаЛога);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(СтрокаЗапуска,, Истина, КодВозврата);
	
	// Помещение объектов прошло успешно, возвращаем пустую строку.
	Если КодВозврата = 0 Тогда
		апк_ФайлУдалить(ИмяФайлаЛога);
		Возврат "";
	КонецЕсли;
	
	// Помещение объектов прошло с ошибкой, возвращаем текст ошибки.
	ТекстЛога = ПолучитьТекстФайла(ИмяФайлаЛога);
	
	Возврат ТекстЛога;
	
КонецФункции

Функция ОтменитьЗахватОбъектовВХранилище() Экспорт
	
	ИмяФайлаЛога = ПолучитьИмяВременногоФайла("txt");
	
	Если ПустаяСтрока(СтрокаЗапускаПлатформы) Тогда
		СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	КонецЕсли;
	
	Если НЕ апк_ФайлСуществует(СтрокаЗапускаПлатформы) Тогда
		Статус = НСтр("ru = 'Не найден файл запуска платформы в каталоге программы по пути:';
			|en = 'Не найден файл запуска платформы в каталоге программы по пути:'", КодОсновногоЯзыка)
			+ Символы.ПС + СтрокаЗапускаПлатформы;
		Возврат Статус;
	КонецЕсли;
	
	// Отменим захваченные объекты в хранилище.
	СтрокаЗапуска = """%1"" DESIGNER %2 /N""%3"" /P""%4"""
		+ " /ConfigurationRepositoryF ""%5"""
		+ " /ConfigurationRepositoryN ""%6"""
		+ " /ConfigurationRepositoryP ""%7"""
		+ " /ConfigurationRepositoryUnlock -force"
		+ " /Out ""%8"""
		+ " /DisableStartupDialogs /DisableStartupMessages";
	СтрокаЗапуска = СтрШаблон(СтрокаЗапуска,
		СтрокаЗапускаПлатформы,
		ПолучитьСтрокуПодключенияКБазе(ПутьКБазе),
		Пользователь,
		Пароль,
		КаталогХранилища,
		ПользовательХранилища,
		ПарольХранилища,
		ИмяФайлаЛога);
	
	КодВозврата = Неопределено;
	ЗапуститьПриложение(СтрокаЗапуска,, Истина, КодВозврата);
	
	// Отмена захвата объектов прошла успешно, возвращаем пустую строку.
	Если КодВозврата = 0 Тогда
		апк_ФайлУдалить(ИмяФайлаЛога);
		Возврат "";
	КонецЕсли;
	
	// Отмена захвата объектов завершилась с ошибкой, возвращаем текст ошибки.
	ТекстЛога = ПолучитьТекстФайла(ИмяФайлаЛога);
	
	Возврат ТекстЛога;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуИзМакета(Макет)
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	
	ТабличныйДокумент = ПолучитьМакет(Макет);
	
	РабочаяОбласть = ТабличныйДокумент.ПолучитьОбласть();
	Для НомерКолонки = 1 По РабочаяОбласть.ШиринаТаблицы Цикл
		ИмяКолонки = РабочаяОбласть.Область(1, НомерКолонки).Текст;
		ТаблицаДанных.Колонки.Добавить(ИмяКолонки);
	КонецЦикла;
	
	Для НомерСтроки = 2 По РабочаяОбласть.ВысотаТаблицы Цикл
		НоваяСтрока = ТаблицаДанных.Добавить();
		Для НомерКолонки = 1 По РабочаяОбласть.ШиринаТаблицы Цикл
			НоваяСтрока[НомерКолонки - 1] = РабочаяОбласть.Область(НомерСтроки, НомерКолонки).Текст;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаДанных;
	
КонецФункции

Функция ПолучитьТаблицуСтандартовИзМакета() Экспорт
	
	Возврат ПолучитьТаблицуИзМакета("СтандартыРазработки");
	
КонецФункции

Функция ПолучитьТаблицуПустыхТегов()
	
	ТаблицаПустыхТегов = Новый ТаблицаЗначений;
	ТаблицаПустыхТегов.Колонки.Добавить("СокращенныйТег");
	ТаблицаПустыхТегов.Колонки.Добавить("ПолныйТег");
	
	НоваяСтрока = ТаблицаПустыхТегов.Добавить();
	НоваяСтрока.СокращенныйТег = "<value/>";
	НоваяСтрока.ПолныйТег = "<value></value>";
	
	Возврат ТаблицаПустыхТегов;
	
КонецФункции

// Возвращает "Истина", если ПредыдущийРелиз меньше СледующийРелиз.
//
Функция апк_РелизыПоПорядку(ПредыдущийРелиз, СледующийРелиз)
	
	Если ПустаяСтрока(ПредыдущийРелиз) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ПредыдущийРелиз = СледующийРелиз Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МассивЧиселПредыдущегоРелиза = СтрРазделить(ПредыдущийРелиз, ".", Ложь);
	МассивЧиселСледующегоРелиза = СтрРазделить(СледующийРелиз, ".", Ложь);
	
	КоличествоЧиселПредыдущегоРелиза = МассивЧиселПредыдущегоРелиза.Количество();
	Если КоличествоЧиселПредыдущегоРелиза <> МассивЧиселСледующегоРелиза.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для НомерЭлемента = 0 По КоличествоЧиселПредыдущегоРелиза - 1 Цикл
		ЧислоПредыдущего = Число(МассивЧиселПредыдущегоРелиза[НомерЭлемента]);
		ЧислоСледующего = Число(МассивЧиселСледующегоРелиза[НомерЭлемента]);
		Если ЧислоПредыдущего <> ЧислоСледующего Тогда
			Возврат (ЧислоСледующего > ЧислоПредыдущего);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ПроверитьПлатформу836() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ВерсияПриложения = СистемнаяИнформация.ВерсияПриложения;
	
	Если апк_РелизыПоПорядку("8.3.6.0", ВерсияПриложения) Тогда
		Возврат "";
	КонецЕсли;
	
	Синоним = Метаданные().Синоним;
	
	Статус = НСтр("ru='Для запуска внешней обработки ""%1"" необходима версия платформы не меньше, чем 8.3.6.
		|Текущая версия %2';
		|en='Для запуска внешней обработки ""%1"" необходима версия платформы не меньше, чем 8.3.6.
		|Текущая версия %2'", КодОсновногоЯзыка);
	Статус = СтрШаблон(Статус, Синоним, ВерсияПриложения);
	
	Возврат Статус;
	
КонецФункции

Функция ЗаполнитьТаблицуЗахваченныхОбъектов(ФайлЗахваченныхОбъектов, УдалитьФайл = Истина)
	
	ЗахваченныеОбъекты.Очистить();
	
	Если НЕ апк_ФайлСуществует(ФайлЗахваченныхОбъектов) Тогда
		ТекстОшибки = НСтр("ru='Не найден файл захваченных объектов, указанный по пути:';
			|en='Не найден файл захваченных объектов, указанный по пути:'", КодОсновногоЯзыка)
			+ Символы.ПС + ФайлЗахваченныхОбъектов;
		Возврат ТекстОшибки;
	КонецЕсли;
	
	// Получаем лог захваченных объектов.
	ТекстФайлаЗахваченныхОбъектов = ПолучитьТекстФайла(ФайлЗахваченныхОбъектов,, УдалитьФайл);
	
	// Анализируем лог захвата объектов.
	ТекстНачалоОперации = НСтр("ru='---- Начало операции с хранилищем конфигурации ----';
		|en='---- Начало операции с хранилищем конфигурации ----'", КодОсновногоЯзыка);
	Если СтрНайти(ТекстФайлаЗахваченныхОбъектов, ТекстНачалоОперации) = 0 Тогда
		// Если такой фразы в логе нет, значит, произошла ошибка, возвращаем текст ошибки.
		Возврат ТекстФайлаЗахваченныхОбъектов;
	КонецЕсли;
	
	ТекстОбъектЗахваченУспешно = НСтр("ru='Объект захвачен для редактирования:';
		|en='Объект захвачен для редактирования:'", КодОсновногоЯзыка);
	
	ДокументТекст = Новый ТекстовыйДокумент;
	ДокументТекст.УстановитьТекст(ТекстФайлаЗахваченныхОбъектов);
	
	КоличествоСтрок = ДокументТекст.КоличествоСтрок();
	
	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		
		СтрокаТекста = ДокументТекст.ПолучитьСтроку(НомерСтроки);
		
		// Пытаемся получить объект из строки лога.
		ПозицияПоиска = СтрНайти(СтрокаТекста, ":");
		Если ПозицияПоиска = 0 Тогда
			// Если в строке нет двоеточия, это не строка с объектом, пропускаем.
			Продолжить;
		КонецЕсли;
		
		ПутьОбъекта = Сред(СтрокаТекста, ПозицияПоиска + 1);
		
		// Если объект захвачен другим пользователем, то в конце строки будет имя пользователя в скобках, удаляем.
		ПозицияПоиска = СтрНайти(ПутьОбъекта, "(");
		Если ПозицияПоиска > 0 Тогда
			ПутьОбъекта = Лев(ПутьОбъекта, ПозицияПоиска - 1);
		КонецЕсли;
		
		ПутьОбъекта = СокрЛП(ПутьОбъекта);
		// Если в пути к объекту остались пробелы, значит, это не объект, пропускаем.
		Если СтрНайти(ПутьОбъекта, " ") > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектЗахваченУспешно = СтрНачинаетсяС(СтрокаТекста, ТекстОбъектЗахваченУспешно);
		
		// Если в пути к объекту нет точек, тогда это корень конфигурации, переименуем его.
		Если СтрНайти(ПутьОбъекта, ".") = 0 Тогда
			ПутьОбъекта = "Конфигурация";
		КонецЕсли;
		
		НовыйОбъект = ЗахваченныеОбъекты.Добавить();
		НовыйОбъект.Объект = ПутьОбъекта;
		НовыйОбъект.ЗахваченДляРедактирования = ОбъектЗахваченУспешно;
		
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

Функция ПолучитьСтатусЗахватаОбъектаВХранилище(ПутьОбъекта)
	
	// Если не указана ни одна настройка, связанная с хранилищем, то предполагаем, что объект по умолчанию захвачен.
	Если ПустаяСтрока(КаталогХранилища)
	   И (НЕ апк_ФайлСуществует(СписокИзмененныхОбъектов))
	   И (НЕ ПомещатьИзмененныеОбъектыВХранилище) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ЗахваченВХранилище = Ложь;
	
	// Иначе определяем статус захвата объекта в таблице захваченных объектов.
	СтрокаЗахваченногоОбъекта = ЗахваченныеОбъекты.Найти(ПутьОбъекта, "Объект");
	Если (СтрокаЗахваченногоОбъекта = Неопределено) Тогда
		ЗахваченВХранилище = ПолучитьСтатусЗахватаРодителяОбъектаВХранилище(ПутьОбъекта);
	Иначе
		ЗахваченВХранилище = СтрокаЗахваченногоОбъекта.ЗахваченДляРедактирования;
	КонецЕсли;
	
	Возврат ЗахваченВХранилище;
	
КонецФункции

Функция ПолучитьСтатусЗахватаРодителяОбъектаВХранилище(ПутьОбъекта)
	
	// Некоторые объекты, например, команды, нельзя захватить в хранилище.
	// Для них получим состояние родительского объекта.
	МассивЭлементовПути = СтрРазделить(ПутьОбъекта, ".", Ложь);
	Если МассивЭлементовПути.Количество() < 2 Тогда
		// У объекта нет родительского объекта, выходим.
		Возврат Ложь;
	КонецЕсли;
	
	НомерПоследнегоЭлемента = МассивЭлементовПути.ВГраница();
	НомерПредпоследнегоЭлемента = НомерПоследнегоЭлемента - 1;
	
	// Получаем наименование предпоследнего элемента.
	ПредпоследнийЭлемент = МассивЭлементовПути[НомерПредпоследнегоЭлемента];
	Если (СтрСравнить(ПредпоследнийЭлемент, "Команда") <> 0)
	 ИЛИ (СтрСравнить(ПредпоследнийЭлемент, "Command") <> 0) Тогда
		// Если не команда, то выходим.
		Возврат Ложь;
	КонецЕсли;
	
	// Удаляем последний и предпоследний элемент пути.
	МассивЭлементовПути.Удалить(НомерПоследнегоЭлемента);
	МассивЭлементовПути.Удалить(НомерПредпоследнегоЭлемента);
	
	ОбъектРодителяПуть = СтрСоединить(МассивЭлементовПути, ".");
	
	СтрокаЗахваченногоОбъекта = ЗахваченныеОбъекты.Найти(ОбъектРодителяПуть, "Объект");
	Возврат ?(СтрокаЗахваченногоОбъекта = Неопределено, Ложь, СтрокаЗахваченногоОбъекта.ЗахваченДляРедактирования);
	
КонецФункции

Функция ПрочитатьПравилаПоддержки(ФайлПравилПоддержки)
	
	ТекстовыйДокумент = ПолучитьТекстовыйДокументИзФайла(ФайлПравилПоддержки);
	
	ПараметрыПоддержки = ?(ТекстовыйДокумент = Неопределено, "", ТекстовыйДокумент.ПолучитьТекст());
	ТекстовыйДокумент  = Неопределено;
	ПараметрыПоддержки = СтрРазделить(ПараметрыПоддержки, ",", Ложь);
	
	КоличествоКонфигураций = 0;
	СчетчикКонфигураций    = 0;
	КоличествоОбъектов     = 0;
	СчетчикОбъектов        = 0;
	
	МассивПараметров = Новый Массив;
	
	Если ПараметрыПоддержки.ВГраница() > 2 Тогда
		Попытка
			КоличествоКонфигураций = Число(ПараметрыПоддержки[2]);
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	Если КоличествоКонфигураций = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПравилаПоддержки = Новый Соответствие;
	ПравилаПоддержки.Вставить(0, НСтр("ru='Не редактируется'; en='Не редактируется'", КодОсновногоЯзыка));
	ПравилаПоддержки.Вставить(1, НСтр("ru='Редактируется с сохранением поддержки';
		|en='Редактируется с сохранением поддержки'", КодОсновногоЯзыка));
	ПравилаПоддержки.Вставить(2, НСтр("ru='Снят с поддержки'; en='Снят с поддержки'", КодОсновногоЯзыка));
	
	ПравилаПоставки = Новый Соответствие;
	ПравилаПоставки.Вставить(0, НСтр("ru='Изменения разрешены'; en='Изменения разрешены'", КодОсновногоЯзыка));
	ПравилаПоставки.Вставить(1, НСтр("ru='Изменения не рекомендуются'; en='Изменения не рекомендуются'",
		КодОсновногоЯзыка));
	ПравилаПоставки.Вставить(2, НСтр("ru='Изменения запрещены'; en='Изменения запрещены'", КодОсновногоЯзыка));
	ПравилаПоставки.Вставить(-1, НСтр("ru='Включение в конфигурацию не рекомендуется';
		|en='Включение в конфигурацию не рекомендуется'", КодОсновногоЯзыка));
	
	Индекс = 3;
	Для СчетчикКонфигураций = 1 По КоличествоКонфигураций Цикл
		
		Поставка = Новый Структура;
		// Начало конфигурации
		Поставка.Вставить("УИД1",ПараметрыПоддержки[Индекс]);
		Индекс = Индекс + 1;
		Поставка.Вставить("Параметр", ПараметрыПоддержки[Индекс]);
		Индекс = Индекс + 1;
		Поставка.Вставить("УИД2", ПараметрыПоддержки[Индекс]);
		Индекс = Индекс + 1;
		Поставка.Вставить("Версия", СтрЗаменить(ПараметрыПоддержки[Индекс], """", ""));
		Индекс = Индекс + 1;
		Поставка.Вставить("Поставщик", ПараметрыПоддержки[Индекс]);
		Индекс = Индекс + 1;
		Поставка.Вставить("КонфигурацияПоставщика", СтрЗаменить(ПараметрыПоддержки[Индекс], """", ""));
		Индекс = Индекс + 1;
		Попытка
			КоличествоОбъектов = Число(ПараметрыПоддержки[Индекс]);
			Индекс = Индекс + 1;
		Исключение
			Возврат Неопределено;
		КонецПопытки;
		
		МассивОбъектов = Новый Массив;
		Для СчетчикОбъектов = 1 По КоличествоОбъектов Цикл
			Если Индекс + 4 > ПараметрыПоддержки.ВГраница() Тогда
				СчетчикОбъектов = СчетчикОбъектов + 1;
				Прервать;
			КонецЕсли;
			
			НастройкиОбъекта = Новый Структура;
			НастройкиОбъекта.Вставить("ПравилоПоддержки", ПравилаПоддержки.Получить(Число(ПараметрыПоддержки[Индекс])));
			Индекс = Индекс + 1;
			НастройкиОбъекта.Вставить("ПравилоПоставки", ПравилаПоставки.Получить(Число(ПараметрыПоддержки[Индекс])));
			Индекс = Индекс + 1;
			НастройкиОбъекта.Вставить("ОбъектМетаданных", ПараметрыПоддержки[Индекс]);
			Индекс = Индекс + 1;
			НастройкиОбъекта.Вставить("ОбъектПоставщика", ПараметрыПоддержки[Индекс]);
			Индекс = Индекс + 1;
			
			МассивОбъектов.Добавить(НастройкиОбъекта);
		КонецЦикла;
		
		Поставка.Вставить("Объекты", МассивОбъектов);
		
		Индекс = Индекс + 2; // пустые параметры в конце
		
		МассивПараметров.Добавить(Поставка);
	КонецЦикла;
	
	Возврат МассивПараметров;
	
КонецФункции

Процедура ЗаполнитьПравилаПоддержки() Экспорт
	
	ПравилаПоддержкиОбъектов.Очистить();
	
	Если ЭтоВыгрузкаXMLФайлов() Тогда
		ФайлПравилПоддержки = КаталогВыгрузкиРезультат + СтрШаблон("Ext%1ParentConfigurations.bin", РазделительПути);
	Иначе
		ФайлПравилПоддержки = КаталогВыгрузкиРезультат + СтрШаблон("src%1Configuration%1ParentConfigurations.bin", РазделительПути);
	КонецЕсли;
	
	Если НЕ апк_ФайлСуществует(ФайлПравилПоддержки) Тогда
		Возврат;
	КонецЕсли;
	
	МассивПравилПоддержки = ПрочитатьПравилаПоддержки(ФайлПравилПоддержки);
	Если МассивПравилПоддержки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстНеРедактируется = НСтр("ru='Не редактируется'; en='Не редактируется'", КодОсновногоЯзыка);
	
	Для Каждого Элемент Из МассивПравилПоддержки Цикл
		
		// Проверяем свойство "Параметр", если он равен 1, то изменения запрещены.
		ИзмененияЗапрещены = (Элемент.Параметр = "1");
		
		Объекты = Элемент.Объекты;
		Для Каждого Объект Из Объекты Цикл
			
			uuidОбъекта = Объект.ОбъектМетаданных;
			
			// Если объекта еще нет в таблице, то добавим его.
			СтрокаТаблицы = ПравилаПоддержкиОбъектов.Найти(uuidОбъекта, "Объект");
			Если СтрокаТаблицы = Неопределено Тогда
				СтрокаТаблицы = ПравилаПоддержкиОбъектов.Добавить();
				СтрокаТаблицы.Объект = uuidОбъекта;
				СтрокаТаблицы.ПравилоПоддержки = ?(ИзмененияЗапрещены, ТекстНеРедактируется, Объект.ПравилоПоддержки);
				
				Продолжить;
			КонецЕсли;
			
			// Если объект уже есть, проверим его правило поддержки.
			Если СтрСравнить(СтрокаТаблицы.ПравилоПоддержки, ТекстНеРедактируется) <> 0 Тогда
				// Если изменения для объекта возможны, то заменяем текущее правило поддержки.
				СтрокаТаблицы.ПравилоПоддержки = Объект.ПравилоПоддержки;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеXDTO(ФайлВыгрузкиXML)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ФайлВыгрузкиXML);
	
	Данные = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	ЧтениеXML.Закрыть();
	
	Возврат Данные;
	
КонецФункции

Функция ПолучитьИмяПодчиненногоОбъектаXDTO(ДанныеПодчиненногоОбъекта)
	
	СвойстваПодчиненногоОбъекта = ДанныеПодчиненногоОбъекта.Свойства();
	Если СвойстваПодчиненногоОбъекта.Получить("Properties") = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ДанныеСвойствПодчиненногоОбъекта = ДанныеПодчиненногоОбъекта.Properties;
	
	СвойстваПодчиненногоОбъекта = ДанныеСвойствПодчиненногоОбъекта.Свойства();
	Если СвойстваПодчиненногоОбъекта.Получить("Name") = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат ДанныеСвойствПодчиненногоОбъекта.Name;
	
КонецФункции

Функция ПолучитьUuidПодчиненногоОбъекта(ПутьОбъектаАнгл, КлассОбъекта)
	
	МассивПутиАнгл = СтрРазделить(ПутьОбъектаАнгл, ".", Ложь);
	КоличествоЭлементовПутиАнгл = МассивПутиАнгл.Количество();
	
	// Если путь объекта короче 4-х элементов, то это не подчиненный объект.
	Если КоличествоЭлементовПутиАнгл < 4 Тогда
		Возврат "";
	КонецЕсли;
	
	КлассРодителяОбъектаМнЧ = МассивПутиАнгл[0];
	ПутьРодителяОбъекта = КлассРодителяОбъектаМнЧ + РазделительПути + МассивПутиАнгл[1];
	
	ФайлВыгрузкиXML = КаталогВыгрузкиРезультат + ПутьРодителяОбъекта + ".xml";
	Если НЕ апк_ФайлСуществует(ФайлВыгрузкиXML) Тогда
		Возврат "";
	КонецЕсли;
	
	ИмяОбъекта = МассивПутиАнгл[МассивПутиАнгл.ВГраница()];
	КлассРодителяОбъектаЕдЧ = ПолучитьТипОбъектаПоТаблицеТипов(КлассРодителяОбъектаМнЧ, "ИмяАнглМнФормы", "ИмяАнгл");
	
	Данные = ПолучитьДанныеXDTO(ФайлВыгрузкиXML);
	ДанныеОбъектаРодителя = Данные[КлассРодителяОбъектаЕдЧ];
	
	// Проверяем, что у объекта-родителя указаны подчиненные объекты.
	СвойстваОбъектаРодителя = ДанныеОбъектаРодителя.Свойства();
	Если СвойстваОбъектаРодителя.Получить("ChildObjects") = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ДанныеПодчиненныхОбъектов = ДанныеОбъектаРодителя["ChildObjects"];
	
	// Проверяем, что среди подчиненных объектов есть нужный класс объекта.
	СвойстваПодчиненныхОбъектов = ДанныеПодчиненныхОбъектов.Свойства();
	Если СвойстваПодчиненныхОбъектов.Получить(КлассОбъекта) = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ПодчиненныеОбъектыПоКлассу = ДанныеПодчиненныхОбъектов[КлассОбъекта];
	
	ПодчиненныйОбъект = Неопределено;
	Если ТипЗнч(ПодчиненныеОбъектыПоКлассу) = Тип("ОбъектXDTO") Тогда
		Если СтрСравнить(ПолучитьИмяПодчиненногоОбъектаXDTO(ПодчиненныеОбъектыПоКлассу), ИмяОбъекта) = 0 Тогда
			ПодчиненныйОбъект = ПодчиненныеОбъектыПоКлассу;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ПодчиненныеОбъектыПоКлассу) = Тип("СписокXDTO") Тогда
		Для Каждого ПодчиненныйОбъектПоКлассу Из ПодчиненныеОбъектыПоКлассу Цикл
			Если СтрСравнить(ПолучитьИмяПодчиненногоОбъектаXDTO(ПодчиненныйОбъектПоКлассу), ИмяОбъекта) = 0 Тогда
				ПодчиненныйОбъект = ПодчиненныйОбъектПоКлассу;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ПодчиненныйОбъект = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	СвойстваПодчиненногоОбъекта = ПодчиненныйОбъект.Свойства();
	Если СвойстваПодчиненногоОбъекта.Получить("uuid") = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат ПодчиненныйОбъект.uuid;
	
КонецФункции

Функция ПолучитьUuidОбъекта(ПутьОбъектаАнгл, КлассОбъекта)
	
	// XML файла для команды не существует, описание команды содержится в XML файле его родителя.
	Если КлассОбъекта = "Command" Тогда
		Возврат ПолучитьUuidПодчиненногоОбъекта(ПутьОбъектаАнгл, КлассОбъекта);
	КонецЕсли;
	
	ИмяФайла = СтрЗаменить(ПутьОбъектаАнгл, ".", РазделительПути);
	ФайлВыгрузкиXML = КаталогВыгрузкиРезультат + ИмяФайла + ".xml";
	
	Если НЕ апк_ФайлСуществует(ФайлВыгрузкиXML) Тогда
		Возврат "";
	КонецЕсли;
	
	Данные = ПолучитьДанныеXDTO(ФайлВыгрузкиXML);
	
	Возврат Данные[КлассОбъекта].uuid;
	
КонецФункции

Процедура ЗаполнитьПравилаПоддержкиДляИзмененныхОбъектов() Экспорт
	
	Если ПравилаПоддержкиОбъектов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстНеРедактируется = НСтр("ru='Не редактируется'; en='Не редактируется'", КодОсновногоЯзыка);
	
	Для Каждого СтрокаРезультата Из Результат Цикл
		
		Если НЕ СтрокаРезультата.Изменен Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ СтрокаРезультата.ЗахваченВХранилище Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьОбъектаАнглМнЧ = ПолучитьПутьОбъектаИзФайлаВыгрузки(СтрокаРезультата.ПолноеИмяФайла,, "ИмяАнглМнФормы");
		КлассОбъектаМнЧ = ПолучитьКлассОбъекта(ПутьОбъектаАнглМнЧ);
		КлассОбъектаЕдЧ = ПолучитьТипОбъектаПоТаблицеТипов(КлассОбъектаМнЧ, "ИмяАнглМнФормы", "ИмяАнгл");
		
		uuidОбъекта = ПолучитьUuidОбъекта(ПутьОбъектаАнглМнЧ, КлассОбъектаЕдЧ);
		
		СтрокаПравилПоддержки = ПравилаПоддержкиОбъектов.Найти(uuidОбъекта, "Объект");
		Если СтрокаПравилПоддержки <> Неопределено Тогда
			СтрокаРезультата.РедактированиеРазрешено = (СтрокаПравилПоддержки.ПравилоПоддержки <> ТекстНеРедактируется);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТаблицуИнструкцийПрепроцессора(Знач ТекстМодуля, ТолькоВерхнегоУровня = Ложь)
	
	ТаблицаИнструкций = Новый ТаблицаЗначений();
	ТаблицаИнструкций.Колонки.Добавить("ТекстИнструкции");
	ТаблицаИнструкций.Колонки.Добавить("ТекстИнструкцииВРег");
	ТаблицаИнструкций.Колонки.Добавить("ПозицияЕсли");
	ТаблицаИнструкций.Колонки.Добавить("ПозицияИначе");
	ТаблицаИнструкций.Колонки.Добавить("ПозицияКонецЕсли");
	ТаблицаИнструкций.Колонки.Добавить("ТекстКонецЕсли");
	ТаблицаИнструкций.Колонки.Добавить("ТекстИначе");
	
	ДеревоИнструкций = Новый ДеревоЗначений;
	Для Каждого Колонка Из ТаблицаИнструкций.Колонки Цикл
		ДеревоИнструкций.Колонки.Добавить(Колонка.Имя);
	КонецЦикла;
	ДеревоИнструкций.Колонки.Добавить("ЭтоИнструкция");
	ДеревоИнструкций.Колонки.Добавить("ЭтоИнструкцияВерхнегоУровня");
	
	ТекущаяИнструкция = ДеревоИнструкций.Строки.Добавить();
	ТекущаяИнструкция.ЭтоИнструкция = Ложь;
	
	ДокументТекст = Новый ТекстовыйДокумент;
	ДокументТекст.УстановитьТекст(ТекстМодуля);
	
	ТекстМодуля = ВРег(ТекстМодуля);
	
	МассивТекстЕсли      = Контекст["МассивТекстЕсли"];
	МассивТекстКонецЕсли = Контекст["МассивТекстКонецЕсли"];
	МассивТекстИначе     = Контекст["МассивТекстИначе"];
	
	МассивПоиска = Новый Массив;
	ДополнитьМассив(МассивПоиска, МассивТекстЕсли);
	ДополнитьМассив(МассивПоиска, МассивТекстКонецЕсли);
	ДополнитьМассив(МассивПоиска, МассивТекстИначе);
	
	ТекущаяИнструкция = ДеревоИнструкций.Строки.Добавить();
	ТекущаяИнструкция.ЭтоИнструкция = Ложь;
	
	ПозицияПоиска = 0;
	Пока Истина Цикл
		
		СтруктураПоиска = СтрНайтиПоМассиву(ТекстМодуля, МассивПоиска,, ПозицияПоиска + 1);
		Если НЕ СтруктураПоиска.Успешно Тогда
			Прервать;
		КонецЕсли;
		
		ПозицияПоиска = СтруктураПоиска.Позиция;
		НомерСтроки = ПолучитьНомерСтрокиМодуля(ТекстМодуля, ПозицияПоиска);
		
		ТекстИнструкции = ДокументТекст.ПолучитьСтроку(НомерСтроки);
		ТекстИнструкции = СокрЛП(ТекстИнструкции);
		
		Если НЕ СтрНачинаетсяС(ТекстИнструкции, "#") Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстИнструкцииВРег = ВРег(ТекстИнструкции);
		ТекстИнструкцииВРег = СтрЗаменить(ТекстИнструкцииВРег, " ", "");
		ТекстИнструкцииВРег = СтрЗаменить(ТекстИнструкцииВРег, Символы.Таб, "");
		
		НайденныйЭлемент = СтруктураПоиска.НайденныйЭлемент;
		Если МассивТекстЕсли.Найти(НайденныйЭлемент) <> Неопределено Тогда
			
			НоваяИнструкция = ТекущаяИнструкция.Строки.Добавить();
			НоваяИнструкция.ТекстИнструкции = ТекстИнструкции;
			НоваяИнструкция.ТекстИнструкцииВРег = ТекстИнструкцииВРег;
			НоваяИнструкция.ПозицияЕсли = ПозицияПоиска;
			НоваяИнструкция.ЭтоИнструкция = Истина;
			НоваяИнструкция.ЭтоИнструкцияВерхнегоУровня = (ТекущаяИнструкция.Родитель = Неопределено);
			
			ТекущаяИнструкция = НоваяИнструкция;
		
		ИначеЕсли МассивТекстИначе.Найти(НайденныйЭлемент) <> Неопределено Тогда
			
			ТекущаяИнструкция.ПозицияИначе = ПозицияПоиска;
			ТекущаяИнструкция.ТекстИначе = НайденныйЭлемент;
			
		ИначеЕсли МассивТекстКонецЕсли.Найти(НайденныйЭлемент) <> Неопределено Тогда
			
			ТекущаяИнструкция.ПозицияКонецЕсли = ПозицияПоиска;
			ТекущаяИнструкция.ТекстКонецЕсли = НайденныйЭлемент;
			
			ТекущаяИнструкция = ТекущаяИнструкция.Родитель;
			Если ТекущаяИнструкция = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыОтбора = Новый Структура("ЭтоИнструкция", Истина);
	МассивСтрокИнструкций = ДеревоИнструкций.Строки.НайтиСтроки(ПараметрыОтбора, Истина);
	
	Для Каждого СтрокаИнструкции Из МассивСтрокИнструкций Цикл
		
		НоваяИнструкция = ТаблицаИнструкций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяИнструкция, СтрокаИнструкции);
		
	КонецЦикла;
	
	Возврат ТаблицаИнструкций;
	
КонецФункции

Функция ПолучитьТаблицуДирективКомпиляции(Знач ТекстМодуля)
	
	ТаблицаДиректив = Новый ТаблицаЗначений;
	ТаблицаДиректив.Колонки.Добавить("ТекстДирективы");
	ТаблицаДиректив.Колонки.Добавить("ПозицияНачала");
	ТаблицаДиректив.Колонки.Добавить("ПозицияКонца");
	
	ТекстМодуляВРег = ВРег(ТекстМодуля);
	
	ДокументТекст = Новый ТекстовыйДокумент;
	ДокументТекст.УстановитьТекст(ТекстМодуля);
	
	МассивТекстНачалоДирективы = Новый Массив;
	МассивТекстНачалоДирективы.Добавить(ВРег("&На"));
	МассивТекстНачалоДирективы.Добавить(ВРег("&At"));
	
	Позиция = 0;
	Пока Истина Цикл
		
		Позиция = СтрНайтиПоМассиву(ТекстМодуляВРег, МассивТекстНачалоДирективы,, Позиция + 1).Позиция;
		Если Позиция = 0 Тогда
			Прервать;
		КонецЕсли;
		
		НомерСтроки = ПолучитьНомерСтрокиМодуля(ТекстМодуля, Позиция);
		ТекстСтроки = ДокументТекст.ПолучитьСтроку(НомерСтроки);
		
		Если НЕ СтрНачинаетсяС(СокрЛ(ТекстСтроки), "&") Тогда
			Продолжить;
		КонецЕсли;
		
		ПозицияКонца = Позиция + СтрДлина(ТекстСтроки);
		
		СтрокаТаблицыДиректив = ТаблицаДиректив.Добавить();
		СтрокаТаблицыДиректив.ТекстДирективы = ТекстСтроки;
		СтрокаТаблицыДиректив.ПозицияНачала = Позиция;
		СтрокаТаблицыДиректив.ПозицияКонца = ПозицияКонца;
		
	КонецЦикла;
	
	Возврат ТаблицаДиректив;
	
КонецФункции

Функция ПолучитьТаблицуОбластейМодуля83(Знач ТекстМодуля)
	
	ТаблицаОбластей = Новый ТаблицаЗначений();
	ТаблицаОбластей.Колонки.Добавить("Наименование");
	ТаблицаОбластей.Колонки.Добавить("НаименованиеВРег");
	ТаблицаОбластей.Колонки.Добавить("ТекстОпределения");
	ТаблицаОбластей.Колонки.Добавить("НомерСтрокиНачало");
	ТаблицаОбластей.Колонки.Добавить("НомерСтрокиКонец");
	ТаблицаОбластей.Колонки.Добавить("ВерхнегоУровня");
	
	ДеревоОбластей = Новый ДеревоЗначений;
	Для Каждого Колонка Из ТаблицаОбластей.Колонки Цикл
		ДеревоОбластей.Колонки.Добавить(Колонка.Имя);
	КонецЦикла;
	ДеревоОбластей.Колонки.Добавить("ЭтоОбласть");
	ТаблицаОбластей.Колонки.Добавить("Родитель");
	
	КореньДереваОбластей = ДеревоОбластей.Строки.Добавить();
	КореньДереваОбластей.Наименование = "Области";
	КореньДереваОбластей.ЭтоОбласть = Ложь;
	
	ТекущаяОбласть = КореньДереваОбластей;
	
	ДокументТекст = Новый ТекстовыйДокумент;
	ДокументТекст.УстановитьТекст(ТекстМодуля);
	
	ТекстМодуля = СтрЗаменить(ТекстМодуля, Символы.Таб, "");
	ТекстМодуля = СтрЗаменить(ТекстМодуля, " ", "");
	ТекстМодуля = ВРег(ТекстМодуля);
	
	МассивТекстОбласть      = Контекст["МассивТекстОбласть"];
	МассивТекстКонецОбласти = Контекст["МассивТекстКонецОбласти"];
	
	МассивПоиска = Новый Массив;
	ДополнитьМассив(МассивПоиска, МассивТекстОбласть);
	ДополнитьМассив(МассивПоиска, МассивТекстКонецОбласти);
	
	ПозицияПоиска = 0;
	Пока Истина Цикл
		
		СтруктураПоиска = СтрНайтиПоМассиву(ТекстМодуля, МассивПоиска,, ПозицияПоиска + 1);
		Если НЕ СтруктураПоиска.Успешно Тогда
			Прервать;
		КонецЕсли;
		
		ПозицияПоиска = СтруктураПоиска.Позиция;
		НомерСтроки = ПолучитьНомерСтрокиМодуля(ТекстМодуля, ПозицияПоиска);
		
		ТекстОбласти = ДокументТекст.ПолучитьСтроку(НомерСтроки);
		ТекстОбласти = СокрЛП(ТекстОбласти);
		
		Если НЕ СтрНачинаетсяС(ТекстОбласти, "#") Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстОбластиБезПробелов = ТекстОбласти;
		ТекстОбластиБезПробелов = СтрЗаменить(ТекстОбластиБезПробелов, " ", "");
		ТекстОбластиБезПробелов = СтрЗаменить(ТекстОбластиБезПробелов, Символы.Таб, "");
		
		НайденныйЭлемент = СтруктураПоиска.НайденныйЭлемент;
		
		Если МассивТекстОбласть.Найти(НайденныйЭлемент) <> Неопределено Тогда
			
			НаименованиеОбласти = ПолучитьНаименованиеОбласти(ТекстОбластиБезПробелов);
			
			НоваяОбласть = ТекущаяОбласть.Строки.Добавить();
			НоваяОбласть.Наименование = НаименованиеОбласти;
			НоваяОбласть.НаименованиеВРег = ВРег(НаименованиеОбласти);
			НоваяОбласть.ТекстОпределения = ТекстОбласти;
			НоваяОбласть.НомерСтрокиНачало = НомерСтроки;
			НоваяОбласть.ЭтоОбласть = Истина;
			
			ТекущаяОбласть = НоваяОбласть;
			
		ИначеЕсли МассивТекстКонецОбласти.Найти(НайденныйЭлемент) <> Неопределено Тогда
			
			ТекущаяОбласть.НомерСтрокиКонец = НомерСтроки;
			
			ТекущаяОбласть = ТекущаяОбласть.Родитель;
			Если ТекущаяОбласть = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыОтбора = Новый Структура("ЭтоОбласть", Истина);
	МассивСтрокОбластей = ДеревоОбластей.Строки.НайтиСтроки(ПараметрыОтбора, Истина);
	Для Каждого СтрокаОбласти Из МассивСтрокОбластей Цикл
		НоваяОбласть = ТаблицаОбластей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяОбласть, СтрокаОбласти);
		// Заполним флаг "ВерхнегоУровня" для областей.
		НоваяОбласть.ВерхнегоУровня = (СтрокаОбласти.Родитель = КореньДереваОбластей);
	КонецЦикла;
	
	Возврат ТаблицаОбластей.Скопировать();
	
КонецФункции

Функция ПолучитьНаименованиеОбласти(СтрокаМодуля)
	
	НаименованиеОбласти = СокрЛ(СтрокаМодуля);
	
	МассивТекстОбласть = Контекст["МассивТекстОбласть"];
	
	РезультатПоиска = СтрНайтиПоМассиву(ВРег(НаименованиеОбласти), МассивТекстОбласть);
	Если РезультатПоиска.Успешно Тогда
		НаименованиеОбласти = Сред(НаименованиеОбласти, СтрДлина(РезультатПоиска.НайденныйЭлемент) + 1);
	КонецЕсли;
	
	ПозицияКомментария = СтрНайти(НаименованиеОбласти, "//");
	Если ПозицияКомментария > 0 Тогда
		НаименованиеОбласти = Лев(НаименованиеОбласти, ПозицияКомментария - 1);
	КонецЕсли;
	
	Возврат СокрЛП(НаименованиеОбласти);
	
КонецФункции

Функция ПолучитьТаблицуПроцедурИФункций(Знач ТекстМодуля)
	
	СоответствиеПолучитьТаблицуПроцедурИФункций = Контекст["ПолучитьТаблицуПроцедурИФункций"];
	
	КлючСоответствия = ПолучитьХешСуммуИзСтроки(ТекстМодуля, ХешФункция.MD5);
	ЗначениеСоответствия = СоответствиеПолучитьТаблицуПроцедурИФункций[КлючСоответствия];
	Если ЗначениеСоответствия <> Неопределено Тогда
		Возврат ЗначениеСоответствия;
	КонецЕсли;
	
	ТаблицаМетодов = Новый ТаблицаЗначений;
	ТаблицаМетодов.Колонки.Добавить("ТипМетода");
	ТаблицаМетодов.Колонки.Добавить("ИмяМетода");
	ТаблицаМетодов.Колонки.Добавить("ИмяМетодаВРег");
	ТаблицаМетодов.Колонки.Добавить("ОписаниеМетода");
	ТаблицаМетодов.Колонки.Добавить("ТекстМетода");
	ТаблицаМетодов.Колонки.Добавить("ТелоМетода");
	ТаблицаМетодов.Колонки.Добавить("ПозицияНачалаМетода");
	ТаблицаМетодов.Колонки.Добавить("ПозицияКонцаОписания");
	ТаблицаМетодов.Колонки.Добавить("ПозицияКонцаМетода");
	ТаблицаМетодов.Колонки.Добавить("НомерСтрокиНачалаМетода");
	ТаблицаМетодов.Колонки.Добавить("НомерСтрокиКонцаМетода");
	ТаблицаМетодов.Колонки.Добавить("ЕстьЭкспорт");
	ТаблицаМетодов.Колонки.Добавить("МассивПараметров");
	ТаблицаМетодов.Колонки.Добавить("ПозицияНачалаДирективы");
	ТаблицаМетодов.Колонки.Добавить("ТекстДирективы");
	ТаблицаМетодов.Колонки.Добавить("ТекстКомментарияМетода");
	ТаблицаМетодов.Колонки.Добавить("НомерСтрокиНачалаКомментарияМетода");
	ТаблицаМетодов.Колонки.Добавить("НомерСтрокиКонцаКомментарияМетода");
	
	ДокументТекст = Новый ТекстовыйДокумент;
	ДокументТекст.УстановитьТекст(ТекстМодуля);
	
	ВРегТекстМодуля = ВРег(ТекстМодуля);
	
	МассивТекстПроцедураФункция      = Контекст["МассивТекстПроцедураФункция"];
	МассивТекстКонецПроцедурыФункции = Контекст["МассивТекстКонецПроцедурыФункции"];
	МассивТекстЭкспорт               = Контекст["МассивТекстЭкспорт"];
	
	МассивТекстПроцедура = Новый Массив;
	МассивТекстПроцедура.Добавить(ВРег("Процедура"));
	МассивТекстПроцедура.Добавить(ВРег("Procedure"));
	
	МассивПоиска = Новый Массив;
	ДополнитьМассив(МассивПоиска, МассивТекстПроцедураФункция);
	ДополнитьМассив(МассивПоиска, МассивТекстКонецПроцедурыФункции);
	
	ТаблицаДиректив = ПолучитьТаблицуДирективКомпиляции(ТекстМодуля);
	ТаблицаДиректив.Колонки.Добавить("Проверена");
	ТаблицаДиректив.ЗаполнитьЗначения(Ложь, "Проверена");
	
	// Составим массив допустимых символов, которые можно писать после "КонецПроцедуры".
	МассивДопустимыхСимволовПослеКонцаМетода = Новый Массив;
	МассивДопустимыхСимволовПослеКонцаМетода.Добавить("/");
	МассивДопустимыхСимволовПослеКонцаМетода.Добавить(";");
	
	ДлинаТекста = СтрДлина(ВРегТекстМодуля);
	СтрокаТаблицыМетодов = Неопределено;
	ПозицияНачалаМетода = 0;
	Пока Истина Цикл
		
		СтруктураПоиска = СтрНайтиПоМассиву(ВРегТекстМодуля, МассивПоиска,, ПозицияНачалаМетода + 1);
		Если НЕ СтруктураПоиска.Успешно Тогда
			Прервать;
		КонецЕсли;
		
		ТипМетодаВРег = СтруктураПоиска.НайденныйЭлемент;
		ПозицияНачалаМетода = СтруктураПоиска.Позиция;
		
		НомерСтрокиНачалаМетода = ПолучитьНомерСтрокиМодуля(ТекстМодуля, ПозицияНачалаМетода);
		ТекстСтроки = ДокументТекст.ПолучитьСтроку(НомерСтрокиНачалаМетода);
		ТекстСтроки = СокрЛ(ТекстСтроки);
		Если НЕ СтрНачинаетсяС(ВРег(ТекстСтроки), ТипМетодаВРег) Тогда
			Продолжить;
		КонецЕсли;
		
		// Проверяем следующий символ.
		СледующийСимвол = Сред(ТекстСтроки, СтрДлина(ТипМетодаВРег) + 1, 1);
		Если НЕ ПустаяСтрока(СледующийСимвол) Тогда
			// Если не нашли допустимый символ, то пропускаем.
			Если МассивДопустимыхСимволовПослеКонцаМетода.Найти(СледующийСимвол) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ПозицияСледующегоСимвола = ПозицияНачалаМетода + СтрДлина(ТипМетодаВРег);
		
		// Если это конец метода, то записываем строку в таблицу методов.
		Если СтрНачинаетсяСПоМассиву(ТипМетодаВРег, МассивТекстКонецПроцедурыФункции).Успешно Тогда
			
			// Если строка в таблице не открыта, то продолжаем.
			Если СтрокаТаблицыМетодов = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ПозицияКонцаОписания = СтрокаТаблицыМетодов.ПозицияКонцаОписания;
			ТелоМетода = Сред(ТекстМодуля, ПозицияКонцаОписания + 1, ПозицияНачалаМетода - ПозицияКонцаОписания - 1);
			
			ПозицияНачалаМетода = СтрокаТаблицыМетодов.ПозицияНачалаМетода;
			ТекстМетода = Сред(ТекстМодуля, ПозицияНачалаМетода, ПозицияСледующегоСимвола - ПозицияНачалаМетода);
			
			СтрокаТаблицыМетодов.ТелоМетода = ТелоМетода;
			СтрокаТаблицыМетодов.ТекстМетода = ТекстМетода;
			СтрокаТаблицыМетодов.ПозицияКонцаМетода = ПозицияСледующегоСимвола;
			СтрокаТаблицыМетодов.НомерСтрокиКонцаМетода = ПолучитьНомерСтрокиМодуля(ТекстМодуля, ПозицияСледующегоСимвола);
			
			// Обнуляем строку таблицы методов.
			СтрокаТаблицыМетодов = Неопределено;
			ПозицияНачалаМетода = ПозицияСледующегоСимвола;
			Если ДлинаТекста < ПозицияНачалаМетода + 1 Тогда
				Прервать;
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		// Если строка таблицы методов открыта, то это ошибка, продолжаем.
		Если СтрокаТаблицыМетодов <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Ищем открывающую скобку.
		ПозицияОткрывающейСкобки = СтрНайти(ТекстМодуля, "(",, ПозицияСледующегоСимвола);
		Если ПозицияОткрывающейСкобки = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Ищем закрывающую скобку.
		ПозицияЗакрывающейСкобки = СтрНайти(ТекстМодуля, ")",, ПозицияОткрывающейСкобки);
		Если ПозицияЗакрывающейСкобки = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяМетода = Сред(ТекстМодуля, ПозицияСледующегоСимвола, ПозицияОткрывающейСкобки - ПозицияСледующегоСимвола);
		ИмяМетода = СокрЛП(ИмяМетода);
		
		// Определяем массив параметров метода.
		ТекстПараметровМетода = Сред(ТекстМодуля, ПозицияОткрывающейСкобки + 1, ПозицияЗакрывающейСкобки - ПозицияОткрывающейСкобки - 1);
		ТекстПараметровМетода = СокрЛП(ТекстПараметровМетода);
		МассивПараметровМетода = СтрРазделить(ТекстПараметровМетода, ",", Ложь);
		
		ПозицияКонцаОписания = ПозицияЗакрывающейСкобки;
		ЕстьЭкспорт = Ложь;
		
		// Определяем, есть ли "Экспорт" после метода.
		ТекстМодуляПослеСкобки = Сред(ТекстМодуля, ПозицияЗакрывающейСкобки + 1);
		СтрДлинаТекстМодуляПослеСкобки = СтрДлина(ТекстМодуляПослеСкобки);
		ТекстМодуляПослеСкобки = СокрЛ(ТекстМодуляПослеСкобки);
		ТекстМодуляПослеСкобки = ВРег(ТекстМодуляПослеСкобки);
		
		РезультатПоискаТекстЭкспорт = СтрНачинаетсяСПоМассиву(ТекстМодуляПослеСкобки, МассивТекстЭкспорт);
		Если РезультатПоискаТекстЭкспорт.Успешно Тогда
			// Если текст после скобки начинается с "Экспорт", то переопределим позицию конца описания метода.
			СдвигНаЭкспорт = СтрДлина(РезультатПоискаТекстЭкспорт.НайденныйЭлемент) + СтрДлинаТекстМодуляПослеСкобки - СтрДлина(ТекстМодуляПослеСкобки);
			ПозицияКонцаОписания = ПозицияКонцаОписания + СдвигНаЭкспорт;
			
			// Проверяем следующий символ после "Экспорт".
			СледующийСимволПослеЭкспорт = Сред(ТекстМодуля, ПозицияКонцаОписания + 1, 1);
			Если ПустаяСтрока(СледующийСимволПослеЭкспорт) Тогда
				ЕстьЭкспорт = Истина;
			Иначе
				ПозицияКонцаОписания = ПозицияЗакрывающейСкобки;
			КонецЕсли;
		КонецЕсли;
		
		ОписаниеМетода = Сред(ТекстМодуля, ПозицияНачалаМетода, ПозицияКонцаОписания - ПозицияНачалаМетода + 1);
		
		ТекстДирективы = "";
		ПозицияНачалаДирективы = 0;
		
		// Определяем директиву компиляции.
		Если ТаблицаДиректив.Количество() > 0 Тогда
			
			Для Каждого СтрокаДирективы Из ТаблицаДиректив Цикл
				
				// Если директива уже проверена, то пропускаем.
				Если СтрокаДирективы.Проверена Тогда
					Продолжить;
				КонецЕсли;
				
				// Если директива находится ниже проверяемого метода, выходим.
				Если СтрокаДирективы.ПозицияНачала > ПозицияНачалаМетода Тогда
					Прервать;
				КонецЕсли;
				
				// Проверяем директиву.
				ПозицияКонцаДирективы = СтрокаДирективы.ПозицияКонца;
				
				// Получаем текст между директивой и началом метода.
				ТекстМеждуДирективойИМетодом = Сред(ТекстМодуля, ПозицияКонцаДирективы, ПозицияНачалаМетода - ПозицияКонцаДирективы);
				
				// Проверяем, есть ли исполняемый код в этом тексте.
				ДокументТекстМеждуДирективойИМетодом = Новый ТекстовыйДокумент;
				ДокументТекстМеждуДирективойИМетодом.УстановитьТекст(ТекстМеждуДирективойИМетодом);
				
				МеждуДирективойИМетодомЕстьКод = Ложь;
				
				КоличествоСтрок = ДокументТекстМеждуДирективойИМетодом.КоличествоСтрок();
				Для НомерСтроки = 1 По КоличествоСтрок Цикл
					
					СтрокаМодуля = ДокументТекстМеждуДирективойИМетодом.ПолучитьСтроку(НомерСтроки);
					СтрокаМодуля = СокрЛ(СтрокаМодуля);
					
					// Не учитываем строки с "#", т.к. если между директивой и методом есть инструкция препроцессору или объявление области,
					// то это некорректный код. Например, удалять пустые методы с директивой при этом явно нельзя -
					// для этого нужен более глубокий анализ человеком.
					Если ПустаяСтрока(СтрокаМодуля) ИЛИ СтрНачинаетсяС(СтрокаМодуля, "//") Тогда
						Продолжить;
					КонецЕсли;
					
					// Нашли код, прерываем.
					МеждуДирективойИМетодомЕстьКод = Истина;
					Прервать;
					
				КонецЦикла;
				
				// Устанавливаем флаг, что директива проверена.
				СтрокаДирективы.Проверена = Истина;
				
				// Нашли код, проверяем следующую директиву.
				Если МеждуДирективойИМетодомЕстьКод Тогда
					Продолжить;
				КонецЕсли;
				
				// Записываем найденную директиву.
				ПозицияНачалаДирективы = СтрокаДирективы.ПозицияНачала;
				ТекстДирективы = СтрокаДирективы.ТекстДирективы;
				
				Прервать;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// Получаем комментарий перед методом.
		ТекстКомментарияМетода = "";
		НомерСтрокиНачалаКомментарияМетода = 0;
		НомерСтрокиКонцаКомментарияМетода = 0;
		
		Для НомерСтроки = 1 По НомерСтрокиНачалаМетода Цикл
			
			НомерСтрокиКомментария = НомерСтрокиНачалаМетода - НомерСтроки;
			СтрокаМодуляИсходная = ДокументТекст.ПолучитьСтроку(НомерСтрокиКомментария);
			
			СтрокаМодуля = СокрЛП(СтрокаМодуляИсходная);
			
			// Если перед методом директива компиляции, то проверяем дальше.
			Если СтрНачинаетсяС(СтрокаМодуля, "&") Тогда
				// Если комментария еще не было, то ищем дальше.
				Если НомерСтрокиКонцаКомментарияМетода = 0 Тогда
					Продолжить;
				Иначе
					// Если комментарий уже был, то запоминаем номер строки начала комментария и прерываем.
					НомерСтрокиНачалаКомментарияМетода = НомерСтрокиКомментария + 1;
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
			// Если перед методом встретилась строка без комментария, то прерываем.
			// Если в строке больше двух слешей, то это не комментарий.
			Если (НЕ СтрНачинаетсяС(СтрокаМодуля, "//"))
				ИЛИ (СтрЧислоВхождений(СтрокаМодуля, "/") > 2) Тогда
				// Запоминаем номер строки начала комментария, если он был.
				Если НомерСтрокиКонцаКомментарияМетода > 0 Тогда
					НомерСтрокиНачалаКомментарияМетода = НомерСтрокиКомментария + 1;
				КонецЕсли;
				// В любом случае, прерываем.
				Прервать;
			КонецЕсли;
			
			// Иначе нашли комментарий.
			Если НомерСтрокиКонцаКомментарияМетода = 0 Тогда
				// Запоминаем номер строки окончания комментария.
				НомерСтрокиКонцаКомментарияМетода = НомерСтрокиКомментария;
			КонецЕсли;
			
			// Запоминаем текст комментария.
			ТекстКомментарияМетода = СтрокаМодуляИсходная + Символы.ПС + ТекстКомментарияМетода;
			
		КонецЦикла;
		
		ЭтоПроцедура = (МассивТекстПроцедура.Найти(ТипМетодаВРег) <> Неопределено);
		
		СтрокаТаблицыМетодов = ТаблицаМетодов.Добавить();
		СтрокаТаблицыМетодов.ТипМетода = ?(ЭтоПроцедура, "Процедура", "Функция");
		СтрокаТаблицыМетодов.ИмяМетода = ИмяМетода;
		СтрокаТаблицыМетодов.ИмяМетодаВРег = ВРег(ИмяМетода);
		СтрокаТаблицыМетодов.ОписаниеМетода = ОписаниеМетода;
		СтрокаТаблицыМетодов.ПозицияНачалаМетода = ПозицияНачалаМетода;
		СтрокаТаблицыМетодов.ПозицияКонцаОписания = ПозицияКонцаОписания;
		СтрокаТаблицыМетодов.НомерСтрокиНачалаМетода = НомерСтрокиНачалаМетода;
		СтрокаТаблицыМетодов.ЕстьЭкспорт = ЕстьЭкспорт;
		СтрокаТаблицыМетодов.МассивПараметров = МассивПараметровМетода;
		СтрокаТаблицыМетодов.ПозицияНачалаДирективы = ПозицияНачалаДирективы;
		СтрокаТаблицыМетодов.ТекстДирективы = ТекстДирективы;
		СтрокаТаблицыМетодов.ТекстКомментарияМетода = СокрП(ТекстКомментарияМетода); // удаляем последний перенос строки.
		СтрокаТаблицыМетодов.НомерСтрокиНачалаКомментарияМетода = НомерСтрокиНачалаКомментарияМетода;
		СтрокаТаблицыМетодов.НомерСтрокиКонцаКомментарияМетода = НомерСтрокиКонцаКомментарияМетода;
		
	КонецЦикла;
	
	СоответствиеПолучитьТаблицуПроцедурИФункций.Вставить(КлючСоответствия, ТаблицаМетодов);
	
	Возврат ТаблицаМетодов;
	
КонецФункции

Функция ПолучитьУровеньВложенностиПараметра(Знач ИмяПараметра)
	
	УровеньВложенностиПараметра = 0;
	Если ПустаяСтрока(ИмяПараметра) Тогда
		Возврат УровеньВложенностиПараметра;
	КонецЕсли;
	
	ИмяПараметра = СокрЛ(ИмяПараметра);
	
	СтрДлинаИмяПараметра = СтрДлина(ИмяПараметра);
	Для НомерСимвола = 1 По СтрДлинаИмяПараметра Цикл
		СимволИмениПараметра = Сред(ИмяПараметра, НомерСимвола, 1);
		Если СимволИмениПараметра <> "*" Тогда
			Прервать;
		КонецЕсли;
		УровеньВложенностиПараметра = УровеньВложенностиПараметра + 1;
	КонецЦикла;
	
	Возврат УровеньВложенностиПараметра;
	
КонецФункции

Функция ПолучитьСтруктуруОписанияПараметра(Знач СтрокаКомментария, ПолучатьИмяПараметра, УровеньВложенностиПредыдущегоПараметра)
	
	ИмяПараметра = Неопределено;
	УровеньВложенностиПараметра = 0;
	ПозицияИмениПараметра = 0;
	ТипПараметра = Неопределено;
	ТипПараметраМножественный = Ложь;
	ПозицияТипаПараметра = 0;
	ТекстовоеОписаниеПараметра = "";
	ПозицияТекстовогоОписанияПараметра = 0;
	
	РазделительЭлементовОписанияПараметра = "-";
	ДлинаРазделителяЭлементовОписанияПараметра = СтрДлина(РазделительЭлементовОписанияПараметра);
	
	// Если в комментарии есть двоеточие, то проверим определенные типы параметров.
	Если СтрНайти(СтрокаКомментария, ":") > 0 Тогда
		МассивТиповПараметровДляКоторыхДопустимРазделительДвоеточие = Контекст["МассивТиповПараметровДляКоторыхДопустимРазделительДвоеточие"];
		Если СтрНайтиПоМассиву(ВРег(СтрокаКомментария), МассивТиповПараметровДляКоторыхДопустимРазделительДвоеточие).Успешно Тогда
			// Если в комментарии есть типы параметров, для которых допустимо двоеточие в качестве разделителя,
			// то переопределим разделитель элементов описания параметра.
			// При этом длину разделителя переопределять не нужно.
			РазделительЭлементовОписанияПараметра = "-:";
		КонецЕсли;
	КонецЕсли;
	
	ДлинаЭлементовОписанияПараметра = 0;
	ПозицияЭлементаОписанияПараметра = 0;
	ПозицияРазделителяПередТипомПараметра = 0;
	ПозицияРазделителяПередТекстовымОписаниемПараметра = 0;
	
	ПервыйЭлементПустой = Ложь;
	
	// Делим всю строку по разделителю и обрабатываем каждый элемент отдельно.
	МассивЭлементовОписанияПараметра = СтрРазделить(СтрокаКомментария, РазделительЭлементовОписанияПараметра);
	Для Каждого ЭлементОписанияПараметра Из МассивЭлементовОписанияПараметра Цикл
		
		ЭлементОписанияПараметраБуфер = ЭлементОписанияПараметра;
		ЭлементОписанияПараметраБуфер = СтрЗаменить(ЭлементОписанияПараметраБуфер, "/", " ");
		ЭлементОписанияПараметраБуфер = СокрЛ(ЭлементОписанияПараметраБуфер);
		
		ПозицияРазделителя = ДлинаЭлементовОписанияПараметра;
		ДлинаЭлементовОписанияПараметра = ДлинаЭлементовОписанияПараметра + СтрДлина(ЭлементОписанияПараметра) + ДлинаРазделителяЭлементовОписанияПараметра;
		ПозицияЭлементаОписанияПараметра = ДлинаЭлементовОписанияПараметра - СтрДлина(ЭлементОписанияПараметраБуфер);
		
		ЭлементОписанияПараметраБуфер = СокрП(ЭлементОписанияПараметраБуфер);
		
		Если ИмяПараметра = Неопределено Тогда
			
			Если ПустаяСтрока(ЭлементОписанияПараметраБуфер) Тогда
				
				// Запоминаем, что описание параметра начинается с тире.
				ПервыйЭлементПустой = Истина;
				
				// Описание параметра начинается с тире, рассмотрим 2 ситуации.
				Если НЕ ПолучатьИмяПараметра Тогда
					// 1. Это описание следующего типа параметра, объявленного на предыдущих строках.
					// Устанавливаем имя элемента пустой строкой, в следующем элементе должен быть описан тип параметра.
					ИмяПараметра = "";
					// Уровень вложенности берем из предыдущего параметра.
					УровеньВложенностиПараметра = УровеньВложенностиПредыдущегоПараметра;
				Иначе
					// 2. Описание каждого параметра начинается с тире.
					// Отступы проверяемого параметра и самого первого параметра в секции равны, ничего не делаем.
				КонецЕсли;
				
				// В любом случае переходим к следующему элементу.
				Продолжить;
				
			КонецЕсли;
			
			ЭтоОписаниеСвойства = СтрНачинаетсяС(ЭлементОписанияПараметраБуфер, "*");
			
			// Если необходимо получать имя параметра или это описание свойства, то запоминаем как имя параметра и его позицию.
			Если ПолучатьИмяПараметра ИЛИ ЭтоОписаниеСвойства Тогда
				ИмяПараметра = ЭлементОписанияПараметраБуфер;
				// Если строка начинается с тире, то наследуем уровень вложенности от предыдущего параметра,
				// иначе определяем по имени параметра.
				УровеньВложенностиПараметра = ?(ПервыйЭлементПустой, УровеньВложенностиПредыдущегоПараметра, ПолучитьУровеньВложенностиПараметра(ИмяПараметра));
				ПозицияИмениПараметра = ПозицияЭлементаОписанияПараметра;
				Продолжить;
			Иначе
				// Это описание возвращаемого значения, тогда имя параметра устанавливаем пустым.
				ИмяПараметра = "";
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТипПараметра = Неопределено Тогда
			
			// Пропускаем пустой элемент.
			Если ПустаяСтрока(ЭлементОписанияПараметраБуфер) Тогда
				Продолжить;
			КонецЕсли;
			
			ЭтоОписаниеТипаПараметра = Истина;
			
			ЭлементОписанияПараметраБуферВРег = ВРег(ЭлементОписанияПараметраБуфер);
			
			// Иногда описание может быть записано в тип параметра. Например:
			//  ... - см.ВариантыОтчетов.СвойстваВариантовОтчетовИзФайлов
			//  ... - См.ВариантыОтчетов.СвойстваВариантовОтчетовИзФайлов
			
			// Проверим, если элемент содержит литерал "см." / "see", это не тип параметра.
			МассивТекстСм = Контекст["МассивТекстСм"];
			Если СтрНачинаетсяСПоМассиву(ЭлементОписанияПараметраБуферВРег, МассивТекстСм).Успешно Тогда
				ЭтоОписаниеТипаПараметра = Ложь;
			КонецЕсли;
			
			Если ЭтоОписаниеТипаПараметра Тогда
				
				ЭлементОписанияПараметраБуферВРег = СтрЗаменить(ЭлементОписанияПараметраБуферВРег, Символы.Таб, " ");
				ЭлементОписанияПараметраБуферВРег = СтрСоединить(СтрРазделить(ЭлементОписанияПараметраБуферВРег, " ", Ложь), " ");
				
				// Заменим некоторые типы с пробелом.
				ТаблицаТиповПараметровДляПолученияОписания = Контекст["ТаблицаТиповПараметровДляПолученияОписания"];
				Для Каждого СтрокаТипаПараметра Из ТаблицаТиповПараметровДляПолученияОписания Цикл
					ЭлементОписанияПараметраБуферВРег = СтрЗаменить(ЭлементОписанияПараметраБуферВРег,
						СтрокаТипаПараметра.ТипПараметраДляПоиска, СтрокаТипаПараметра.ТипПараметраДляЗаменыВРег);
				КонецЦикла;
				
				МассивИсключенийТиповПараметров = Контекст["МассивИсключенийТиповПараметров"];
				
				// Тип параметра может быть множественным (перечислен через запятую), тогда проверяем каждый тип отдельно.
				МассивЭлементовТипаПараметра = СтрРазделить(ЭлементОписанияПараметраБуферВРег, ",;");
				Для Каждого ЭлементТипа Из МассивЭлементовТипаПараметра Цикл
					
					ЭлементТипа = СокрЛП(ЭлементТипа);
					
					// Если нашли исключение из типов параметров, то это не описание типа, прерываем.
					Если МассивИсключенийТиповПараметров.Найти(ЭлементТипа) <> Неопределено Тогда
						ЭтоОписаниеТипаПараметра = Ложь;
						Прервать;
					КонецЕсли;
					
					// Проверяем пробел в элементе описания параметра.
					Если СтрНайти(ЭлементТипа, " ") > 0 Тогда
						// Если нашли, то это не описание типа, прерываем.
						ЭтоОписаниеТипаПараметра = Ложь;
						Прервать;
					КонецЕсли;
					
					// Если элемент заканчивается на скобки, то это не тип параметра.
					Если СтрЗаканчиваетсяНа(ЭлементТипа, "()") ИЛИ СтрЗаканчиваетсяНа(ЭлементТипа, "().") Тогда
						ЭтоОписаниеТипаПараметра = Ложь;
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если ЭтоОписаниеТипаПараметра Тогда
				// Если это описание типа параметра, то запоминаем и переходим к следующему элементу описания.
				ТипПараметра = ЭлементОписанияПараметраБуфер;
				ТипПараметраМножественный = (МассивЭлементовТипаПараметра.Количество() > 1);
				ПозицияРазделителяПередТипомПараметра = ПозицияРазделителя;
				ПозицияТипаПараметра = ПозицияЭлементаОписанияПараметра;
				Продолжить;
			Иначе
				// Иначе это описание параметра или возвращаемого значения, тип параметра устанавливаем пустым.
				ТипПараметра = "";
			КонецЕсли;
			
		КонецЕсли;
		
		// Прошли элементы с именем и типом параметра, запоминаем позицию начала текстового описания и выходим.
		ПозицияРазделителяПередТекстовымОписаниемПараметра = ПозицияРазделителя;
		ПозицияТекстовогоОписанияПараметра = ПозицияЭлементаОписанияПараметра;
		Прервать;
		
	КонецЦикла;
	
	// Если удалось определить позицию текстового описания параметра, то получаем текстовое описание.
	Если ПозицияТекстовогоОписанияПараметра > 0 Тогда
		ТекстовоеОписаниеПараметра = Сред(СтрокаКомментария, ПозицияТекстовогоОписанияПараметра);
		
		// Возможно, текстовое описание будет начинаться со следующей строки, тогда очистим его позицию.
		Если ПустаяСтрока(ТекстовоеОписаниеПараметра) Тогда
			ПозицияТекстовогоОписанияПараметра = 0;
		КонецЕсли;
	КонецЕсли;
	
	СтрокаКомментарияБуфер = СтрЗаменить(СтрокаКомментария, "/", "");
	СтрокаКомментарияБуфер = СокрЛ(СтрокаКомментарияБуфер);
	
	СтруктураОписанияПараметра = Новый Структура;
	СтруктураОписанияПараметра.Вставить("ИмяПараметра", Строка(ИмяПараметра));
	СтруктураОписанияПараметра.Вставить("УровеньВложенностиПараметра", УровеньВложенностиПараметра);
	СтруктураОписанияПараметра.Вставить("ПозицияИмениПараметра", ПозицияИмениПараметра);
	СтруктураОписанияПараметра.Вставить("ТипПараметра", Строка(ТипПараметра));
	СтруктураОписанияПараметра.Вставить("ТипПараметраМножественный", ТипПараметраМножественный);
	СтруктураОписанияПараметра.Вставить("ПозицияРазделителяПередТипомПараметра", ПозицияРазделителяПередТипомПараметра);
	СтруктураОписанияПараметра.Вставить("ПозицияТипаПараметра", ПозицияТипаПараметра);
	СтруктураОписанияПараметра.Вставить("ТекстовоеОписаниеПараметра", ТекстовоеОписаниеПараметра);
	СтруктураОписанияПараметра.Вставить("ПозицияРазделителяПередТекстовымОписаниемПараметра", ПозицияРазделителяПередТекстовымОписаниемПараметра);
	СтруктураОписанияПараметра.Вставить("ПозицияТекстовогоОписанияПараметра", ПозицияТекстовогоОписанияПараметра);
	СтруктураОписанияПараметра.Вставить("ОписаниеПараметраНачинаетсяСТире", ПервыйЭлементПустой);
	СтруктураОписанияПараметра.Вставить("ОписаниеПараметраНачинаетсяСоЗвездочки", СтрНачинаетсяС(СтрокаКомментарияБуфер, "*"));
	
	Возврат СтруктураОписанияПараметра;
	
КонецФункции

Функция ПолучитьТекстОписанияПараметраДоПервойПустойСтроки(Знач ОписаниеПараметра)
	
	Если ПустаяСтрока(ОписаниеПараметра) Тогда
		Возврат ОписаниеПараметра;
	КонецЕсли;
	
	МассивСтрокОписанияПараметраИсходный = СтрРазделить(ОписаниеПараметра, Символы.ПС, Истина);
	МассивСтрокОписанияПараметраРезультат = Новый Массив;
	
	Для Каждого СтрокаОписанияПараметра Из МассивСтрокОписанияПараметраИсходный Цикл
		
		// Если строка комментария пустая, то прерываем.
		СтрокаОписанияПараметраБуфер = СтрЗаменить(СтрокаОписанияПараметра, "/", "");
		Если ПустаяСтрока(СтрокаОписанияПараметраБуфер) Тогда
			Прервать;
		КонецЕсли;
		
		// Непустые строки добавляем в результат.
		МассивСтрокОписанияПараметраРезультат.Добавить(СтрокаОписанияПараметра);
		
	КонецЦикла;
	
	Возврат СтрСоединить(МассивСтрокОписанияПараметраРезультат, Символы.ПС);
	
КонецФункции

Функция ПолучитьДлинуОтступаПервогоПараметра(ДокументТекст, НомерСтрокиНачалаСекции, КоличествоСтрокКомментария)
	
	ДлинаОтступаПервогоПараметра = 0;
	Для НомерСтрокиСекции = НомерСтрокиНачалаСекции + 1 По КоличествоСтрокКомментария Цикл
		
		// Ищем первую заполненную строку после открытия секции.
		СтрокаСекции = ДокументТекст.ПолучитьСтроку(НомерСтрокиСекции);
		ОтступПервогоПараметра = ПолучитьОтступПослеЗнакаКомментария(СтрокаСекции, Ложь);
		
		// Нельзя проверять методом "ПустаяСтрока()", т.к. в переменной будут только пробелы.
		Если ОтступПервогоПараметра <> "" Тогда
			// Для сравнения отступов заменим таб на 2 пробела, т.к. отступ часто делают визуально.
			ОтступПервогоПараметра = СтрЗаменить(ОтступПервогоПараметра, Символы.Таб, "  ");
			ДлинаОтступаПервогоПараметра = СтрДлина(ОтступПервогоПараметра);
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДлинаОтступаПервогоПараметра;
	
КонецФункции

Функция СтрокаСодержитОписаниеПараметра(Знач СтрокаКомментария, СтруктураДанныхОписанияПараметра)
	
	// Если в строке количество знаков комментария больше 2-х, то это может быть шаблон для описания другой процедуры, например:
	//       * ОпределитьНастройкиФормы - Булево - отчет имеет программный интерфейс для тесной интеграции с формой отчета,
	//           в том числе может переопределять некоторые настройки формы и подписываться на ее события.
	//           Если Истина и отчет подключен к общей форме ФормаОтчета,
	//           тогда в модуле объекта отчета следует определить процедуру по шаблону:
	//               
	//               // Задать настройки формы отчета.
	//               //
	//               // Параметры:
	//               //   Форма - ФормаКлиентскогоПриложения, Неопределено -
	//               //   КлючВарианта - Строка, Неопределено -
	//               //   Настройки - см. ОтчетыКлиентСервер.НастройкиОтчетаПоУмолчанию
	//               //
	//               Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	//               	// Код процедуры.
	//               КонецПроцедуры
	Если СтрЧислоВхождений(СтрокаКомментария, "// ") > 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтрокаКомментарияБуфер = СтрокаКомментария;
	СтрокаКомментарияБуфер = СтрЗаменить(СтрокаКомментарияБуфер, "/", "");
	СтрокаКомментарияБуфер = СокрЛ(СтрокаКомментарияБуфер);
	
	// Если строка начинается со "*", то это описание свойства составного параметра для Структура, ТаблицаЗначений и т.п.
	Если СтрНачинаетсяС(СтрокаКомментарияБуфер, "*") Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Если строка начинается с "-", то нужен дополнительный анализ.
	Если СтрНачинаетсяС(СтрокаКомментарияБуфер, "-") Тогда
		
		// Если в первом слове есть заглавные буквы, то это описание параметра или его типа.
		ПервоеСлово = ПолучитьПервоеСловоИзСтроки(СтрокаКомментарияБуфер, Истина);
		Если НРег(ПервоеСлово) <> ПервоеСлово Тогда
			Возврат Истина;
		КонецЕсли;
		
		// Если строка начинается со ссылки "- см. ", то считаем, что это описание следующего типа параметра.
		МассивТекстСм = Контекст["МассивТекстСм"];
		Если СтрНачинаетсяСПоМассиву(ВРег(ПервоеСлово) + " ", МассивТекстСм).Успешно Тогда
			Возврат Истина;
		КонецЕсли;
		
		// Если строка комментария начинается с типа параметра, то считаем, что строка содержит описание параметра.
		Если СтрокаНачинаетсяСТипаПараметра(СтрокаКомментарияБуфер).Успешно Тогда
			Возврат Истина;
		КонецЕсли;
		
		// Иначе это продолжение описания предыдущего параметра.
		Возврат Ложь;
		
	КонецЕсли;
	
	СтрокаОписанияПредыдущегоПараметра = СтруктураДанныхОписанияПараметра.СтрокаОписанияПредыдущегоПараметра;
	
	// Получаем уровень вложенности предыдущего параметра.
	УровеньВложенностиПредыдущегоПараметра = 0;
	Если СтрокаОписанияПредыдущегоПараметра <> Неопределено Тогда
		УровеньВложенностиПредыдущегоПараметра = СтрокаОписанияПредыдущегоПараметра.УровеньВложенностиПараметра;
	КонецЕсли;
	
	ДлинаОтступаТекущегоПараметра = СтруктураДанныхОписанияПараметра.ДлинаОтступаТекущегоПараметра;
	ДлинаОтступаПредыдущегоПараметра = СтруктураДанныхОписанияПараметра.ДлинаОтступаПредыдущегоПараметра;
	РазницаОтступовТекущегоИПредыдущегоПараметров = ДлинаОтступаТекущегоПараметра - ДлинаОтступаПредыдущегоПараметра;
	
	// Если уровень вложенности предыдущего параметра больше 0 (перед ним стояла "*"),
	// а уровень вложенности текущего параметра = 0 (проверено выше - не начинается со "*"),
	// но при этом она сдвинута вправо, то это точно не описание нового параметра.
	Если (УровеньВложенностиПредыдущегоПараметра > 0) И (РазницаОтступовТекущегоИПредыдущегоПараметров > 0) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Если в строке нет тире, то это не описание параметра.
	ПозицияТире = СтрНайти(СтрокаКомментарияБуфер, " - ");
	Если ПозицияТире = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Выделяем текст до тире.
	ПервыйЭлементОписания = Лев(СтрокаКомментарияБуфер, ПозицияТире);
	ПервыйЭлементОписания = СокрП(ПервыйЭлементОписания);
	
	// Если в строке до тире есть пробелы, то это не описание параметра.
	СтрокаНезначимыхСимволов = " ,.," + Символы.Таб;
	МассивНезначимыхСимволов = СтрРазделить(СтрокаНезначимыхСимволов, ",");
	Если СтрНайтиПоМассиву(ПервыйЭлементОписания, МассивНезначимыхСимволов).Успешно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Если в первом элементе описания нет заглавных букв, то это не описание параметра.
	Если НРег(ПервыйЭлементОписания) = ПервыйЭлементОписания Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Если строка начинается с булевого значения, то это продолжение описания предыдущего параметра.
	МассивТекстИстинаЛожь = Контекст["МассивТекстИстинаЛожь"];
	Если МассивТекстИстинаЛожь.Найти(ВРег(ПервыйЭлементОписания)) <> Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Если строка начинается с ссылки "см. ", то считаем, что это продолжение описания предыдущего параметра.
	МассивТекстСм = Контекст["МассивТекстСм"];
	Если СтрНачинаетсяСПоМассиву(ВРег(СтрокаКомментарияБуфер), МассивТекстСм).Успешно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Проверяем отдельно секцию "Параметры".
	СекцияОписания = СтруктураДанныхОписанияПараметра.СекцияОписания;
	Если СекцияОписания = "Параметры" Тогда
		
		МассивПараметров = Новый Массив;
		ТекущийОбрабатываемыйМетод = Контекст["ТекущийОбрабатываемыйМетод"];
		Если ТекущийОбрабатываемыйМетод <> Неопределено Тогда
			МассивПараметров = ТекущийОбрабатываемыйМетод.МассивПараметров;
		КонецЕсли;
		
		// Ищем первое слово среди параметров метода.
		Для Каждого Параметр Из МассивПараметров Цикл
			ИмяПараметра = ПолучитьИмяПараметра(Параметр);
			Если СтрСравнить(ИмяПараметра, ПервыйЭлементОписания) = 0 Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// Предполагаем, что если вторым элементом (после тире) написан тип параметра, то это строка с описанием параметра.
	МассивЭлементовОписания = СтрРазделить(СтрокаКомментарияБуфер, "-", Ложь);
	Если МассивЭлементовОписания.Количество() > 1 Тогда
		
		// Определяем второй параметр.
		ВторойЭлементОписания = МассивЭлементовОписания[1];
		ВторойЭлементОписания = СокрЛ(ВторойЭлементОписания);
		ВторойЭлементОписания = ВРег(ВторойЭлементОписания);
		Если СтрНачинаетсяСПоМассиву(ВторойЭлементОписания, МассивТекстСм).Успешно Тогда
			// Если второй элемент описания содержит гиперссылку, то это описание параметра.
			Возврат Истина;
		КонецЕсли;
		
		// Проверим второй параметр в исключениях для типа параметра.
		МассивИсключенийТиповПараметров = Контекст["МассивИсключенийТиповПараметров"];
		Если СтрНачинаетсяСПоМассиву(ВторойЭлементОписания, МассивИсключенийТиповПараметров).Успешно Тогда
			Возврат Ложь;
		КонецЕсли;
		
		// Если второй элемент начинается с типа параметра, то это строка с описанием параметра.
		Если СтрокаНачинаетсяСТипаПараметра(ВторойЭлементОписания).Успешно Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтрокаОписанияПредыдущегоПараметра = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Если отступ текущего параметра равен предыдущему, то переопределяем предыдущий параметр.
	Если РазницаОтступовТекущегоИПредыдущегоПараметров = 0 Тогда
		
		// Получаем таблицу параметров.
		ТаблицаОписанияПараметров = СтрокаОписанияПредыдущегоПараметра.Владелец();
		ИндексСтрокиПредыдущегоПараметра = ТаблицаОписанияПараметров.Индекс(СтрокаОписанияПредыдущегоПараметра) - 1;
		
		// Ищем вверх по таблице параметр, у которого отступ меньше, чем у текущего.
		Для ИндексСтроки = 0 По ИндексСтрокиПредыдущегоПараметра Цикл
			
			ИндексСтрокиВверх = ИндексСтрокиПредыдущегоПараметра - ИндексСтроки;
			
			// Если секции не равны, то прерываем.
			СтрокаОписанияПараметраВверх = ТаблицаОписанияПараметров[ИндексСтрокиВверх];
			Если СтрокаОписанияПараметраВверх.СекцияОписания <> СекцияОписания Тогда
				Прервать;
			КонецЕсли;
			
			// Получаем полное описание предыдущего параметра и вычисляем отступ с учетом замены таба на 2 пробела.
			ПолноеОписаниеПараметраВверх = СтрокаОписанияПараметраВверх.ПолноеОписаниеПараметра;
			ОтступПредыдущегоПараметраВверх = ПолучитьОтступПослеЗнакаКомментария(ПолноеОписаниеПараметраВверх, Ложь);
			ОтступПредыдущегоПараметраВверх = СтрЗаменить(ОтступПредыдущегоПараметраВверх, Символы.Таб, "  ");
			ДлинаОтступаПараметраВверх = СтрДлина(ОтступПредыдущегоПараметраВверх);
			
			// Если нашли параметр с отступом меньше, чем у текущего, то запоминаем его как предыдущий параметр.
			Если ДлинаОтступаПараметраВверх < ДлинаОтступаТекущегоПараметра Тогда
				СтрокаОписанияПредыдущегоПараметра = СтрокаОписанияПараметраВверх;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Получаем тип предыдущего параметра.
	ТипПредыдущегоПараметра = СтрокаОписанияПредыдущегоПараметра.ТипПараметра;
	Если СтрокаОписанияПредыдущегоПараметра.ТипПараметраМножественный Тогда
		// Если тип множественный, то берем первый тип из описания.
		МассивТиповПараметра = СтрРазделить(ТипПредыдущегоПараметра, ",", Ложь);
		ТипПредыдущегоПараметра = МассивТиповПараметра[0];
	КонецЕсли;
	
	// Подготовим тип предыдущего параметра для поиска в массиве составных типов параметров.
	ТипПредыдущегоПараметра = ПреобразоватьТекстДляСравнения(ТипПредыдущегоПараметра);
	
	// Если предыдущий параметр составного типа, то проверим другие показатели.
	МассивСоставныхТиповПараметров = Контекст["МассивСоставныхТиповПараметров"];
	Если МассивСоставныхТиповПараметров.Найти(ТипПредыдущегоПараметра) <> Неопределено Тогда
		
		// Нашли тип параметра среди составных типов, проверяем двоеточие в конце описания параметра.
		ПолноеОписаниеПредыдущегоПараметра = СокрП(СтрокаОписанияПредыдущегоПараметра.ПолноеОписаниеПараметра);
		Если СтрЗаканчиваетсяНа(ПолноеОписаниеПредыдущегоПараметра, ":") Тогда
			Возврат Истина;
		КонецЕсли;
		
		// Если текст до тире равен "Ключ" или "Значение", то это описание параметра.
		МассивТекстКлючЗначение = Контекст["МассивТекстКлючЗначение"];
		Если МассивТекстКлючЗначение.Найти(ВРег(ПервыйЭлементОписания)) <> Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	// Иначе это продолжение текстового описания текущего параметра.
	Возврат Ложь;
	
КонецФункции

Функция СтрокаСодержитИмяПараметра(Знач СтрокаКомментария, ЭтоОписаниеВозвращаемогоЗначения = Ложь)
	
	СтрокаКомментария = СтрЗаменить(СтрокаКомментария, "/", "");
	Если ПустаяСтрока(СтрокаКомментария) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтрокаКомментария = СтрЗаменить(СтрокаКомментария, Символы.Таб, " ");
	СтрокаКомментария = СокрЛП(СтрокаКомментария);
	СтрокаКомментария = ВРег(СтрокаКомментария);
	
	// Если строка комментария начинается со "*", то имя параметра точно указано.
	Если СтрНачинаетсяС(СтрокаКомментария, "*") Тогда
		// Описание возвращаемого значения не может начинаться со "*", перебиваем флаг "ЭтоОписаниеВозвращаемогоЗначения".
		ЭтоОписаниеВозвращаемогоЗначения = Ложь;
		Возврат Истина;
	КонецЕсли;
	
	// Запомним флаг, что строка начинается с тире.
	СтрокаКомментарияНачинаетсяСТире = СтрНачинаетсяС(СтрокаКомментария, "-");
	Если СтрокаКомментарияНачинаетсяСТире Тогда
		// Удалим все символы "-" в начале комментария.
		Пока СтрНачинаетсяС(СтрокаКомментария, "-") Цикл
			СтрокаКомментария = Сред(СтрокаКомментария, 2);
			СтрокаКомментария = СокрЛ(СтрокаКомментария);
		КонецЦикла;
	КонецЕсли;
	
	// Рассмотрим общий случай - это комментарий любой строки секции "Параметры" или
	// описание любого свойства секции "Возвращаемое значение",
	// кроме самого описания возвращаемого значения (как правило, первой строки секции "Возвращаемое значение").
	Если НЕ ЭтоОписаниеВозвращаемогоЗначения Тогда
		
		// В общем случае всегда необходимо получать имя параметра.
		// Кроме случая, когда строка начинается с "-", возможно, это описание следующего типа предыдущего параметра.
		Если НЕ СтрокаКомментарияНачинаетсяСТире Тогда
			Возврат Истина;
		КонецЕсли;
		
		// Если строка комментария начинается с типа параметра, то имя параметра не указано.
		СтруктураПоискаТипаПараметра = СтрокаНачинаетсяСТипаПараметра(СтрокаКомментария);
		Если СтруктураПоискаТипаПараметра.Успешно Тогда
			
			// Если не нашли тип параметра в массиве типов для проверки, то имя параметра не указано.
			МассивТиповПараметровДляПроверки = Контекст["МассивТиповПараметровДляПроверки"];
			Если МассивТиповПараметровДляПроверки.Найти(СтруктураПоискаТипаПараметра.НайденныйЭлемент) = Неопределено Тогда
				Возврат Ложь;
			КонецЕсли;
			
			// Разделим строку по элементам.
			МассивЭлементовОписания = СтрРазделить(СтрокаКомментария, "-", Ложь);
			Если МассивЭлементовОписания.Количество() < 2 Тогда
				// Если в строке только 1 элемент, то выходим.
				Возврат Ложь;
			КонецЕсли;
			
			// Если второй элемент описания является типом, то первым элементом указано имя параметра.
			Возврат СтрокаНачинаетсяСТипаПараметра(МассивЭлементовОписания[1]).Успешно;
			
		КонецЕсли;
		
		// Если строка комментария начинается со ссылки "см.", то имя параметра не указано.
		МассивТекстСм = Контекст["МассивТекстСм"];
		Если СтрНачинаетсяСПоМассиву(СтрокаКомментария, МассивТекстСм).Успешно Тогда
			Возврат Ложь;
		КонецЕсли;
		
		// Получаем массив параметров текущего метода.
		МассивПараметров = Новый Массив;
		ТекущийОбрабатываемыйМетод = Контекст["ТекущийОбрабатываемыйМетод"];
		Если ТекущийОбрабатываемыйМетод <> Неопределено Тогда
			МассивПараметров = ТекущийОбрабатываемыйМетод.МассивПараметров;
		КонецЕсли;
		
		// Ищем первое слово среди параметров метода.
		ПервоеСловоСтрокиКомментария = ПолучитьПервоеСловоИзСтроки(СтрокаКомментария);
		Для Каждого Параметр Из МассивПараметров Цикл
			ИмяПараметра = ПолучитьИмяПараметра(Параметр);
			Если СтрСравнить(ИмяПараметра, ПервоеСловоСтрокиКомментария) = 0 Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		
		// Иногда тип параметра ошибочно указывается в скобках после имени параметра.
		Если СтрокаСодержитТипПараметраВСкобках(СтрокаКомментария).Успешно Тогда
			// Если текст в скобках является типом параметра, то имя параметра указано.
			Возврат Истина;
		КонецЕсли;
		
	Иначе
		
		// Рассмотрим случай, когда передана строка комментария описания возвращаемого значения.
		// Если строка комментария начинается со ссылки "см.", то имя параметра не указано.
		МассивТекстСм = Контекст["МассивТекстСм"];
		Если СтрНачинаетсяСПоМассиву(СтрокаКомментария, МассивТекстСм).Успешно Тогда
			Возврат Ложь;
		КонецЕсли;
		
		// Если строка начинается с типа параметра, то имя параметра не указано.
		СтруктураПоискаТипаПараметра = СтрокаНачинаетсяСТипаПараметра(СтрокаКомментария);
		Если СтруктураПоискаТипаПараметра.Успешно Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверяем исключения для первого элемента описания параметра.
	МассивИсключенийИменПараметров = Контекст["МассивИсключенийИменПараметров"];
	Если СтрНачинаетсяСПоМассиву(СтрокаКомментария, МассивИсключенийИменПараметров).Успешно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Если внутри строки есть тире, то имя параметра указано.
	Если СтрНайти(СтрокаКомментария, " - ") > 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	// В остальных случаях имя параметра не указано.
	Возврат Ложь;
	
КонецФункции

Функция СтрокаНачинаетсяСТипаПараметра(Знач СтрокаКомментария)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("НайденныйЭлемент", "");
	СтруктураВозврата.Вставить("Успешно", Ложь);
	
	СтрокаКомментария = СтрЗаменить(СтрокаКомментария, "/", "");
	СтрокаКомментария = СтрЗаменить(СтрокаКомментария, Символы.Таб, " ");
	СтрокаКомментария = СокрЛП(СтрокаКомментария);
	СтрокаКомментария = ВРег(СтрокаКомментария);
	
	// Делим строку комментария на элементы описания параметра.
	МассивЭлементовОписания = СтрРазделить(СтрокаКомментария, "-", Ложь);
	Если МассивЭлементовОписания.Количество() = 0 Тогда
		// Если в строке нет элементов, то выходим.
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	ТаблицаТиповПараметров = Контекст["ТаблицаТиповПараметров"];
	
	// Сначала ищем первый элемент описания в массиве всех типов.
	ПервыйЭлементОписания = СокрЛП(МассивЭлементовОписания[0]);
	Если ТаблицаТиповПараметров.Найти(ПервыйЭлементОписания, "ТипПараметраДляПоиска") <> Неопределено Тогда
		// Если нашли, то выходим.
		СтруктураВозврата.Успешно = Истина;
		СтруктураВозврата.НайденныйЭлемент = ПервыйЭлементОписания;
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	// Если не нашли, то получаем первое слово первого элемента описания.
	ПервоеСловоПервогоЭлементаОписания = ПолучитьПервоеСловоИзСтроки(ПервыйЭлементОписания);
	
	// Если первое слово равно первому элементу описания, то искать повторно не имеет смысла, выходим.
	Если ПервоеСловоПервогоЭлементаОписания = ПервыйЭлементОписания Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	// Затем ищем первое слово первого элемента описания в массиве типов.
	Если ТаблицаТиповПараметров.Найти(ПервоеСловоПервогоЭлементаОписания, "ТипПараметраДляПоиска") <> Неопределено Тогда
		// Если нашли, то выходим.
		СтруктураВозврата.Успешно = Истина;
		СтруктураВозврата.НайденныйЭлемент = ПервоеСловоПервогоЭлементаОписания;
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	// Иначе строка комментария не начинается с типа параметра.
	Возврат СтруктураВозврата;
	
КонецФункции

Функция СтрокаСодержитТипПараметраВСкобках(Знач СтрокаКомментария)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ПозицияОткрытойСкобки", 0);
	СтруктураВозврата.Вставить("ПозицияЗакрытойСкобки", 0);
	СтруктураВозврата.Вставить("ТекстВСкобках", "");
	СтруктураВозврата.Вставить("Успешно", Ложь);
	
	ПозицияОткрытойСкобки = СтрНайти(СтрокаКомментария, "(");
	Если ПозицияОткрытойСкобки = 0 Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	СтруктураВозврата.ПозицияОткрытойСкобки = ПозицияОткрытойСкобки;
	
	ПозицияЗакрытойСкобки = СтрНайти(СтрокаКомментария, ")");
	Если ПозицияЗакрытойСкобки = 0 Тогда
		ПозицияЗакрытойСкобки = СтрДлина(СтрокаКомментария);
	КонецЕсли;
	
	СтруктураВозврата.ПозицияЗакрытойСкобки = ПозицияЗакрытойСкобки;
	
	ТекстВСкобках = Сред(СтрокаКомментария, ПозицияОткрытойСкобки + 1, ПозицияЗакрытойСкобки - ПозицияОткрытойСкобки - 1);
	СтруктураВозврата.ТекстВСкобках = ТекстВСкобках;
	
	Если СтрокаНачинаетсяСТипаПараметра(ТекстВСкобках).Успешно Тогда
		СтруктураВозврата.Успешно = Истина;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция СтрокаСодержитОписаниеСвойства(Знач СтрокаКомментария, ИмяСвойства)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Позиция", 0);
	СтруктураВозврата.Вставить("НайденныйЭлемент", "");
	СтруктураВозврата.Вставить("Успешно", Ложь);
	
	МассивПоиска = Новый Массив;
	Если ТипЗнч(ИмяСвойства) = Тип("Строка") Тогда
		МассивПоиска.Добавить(ВРег(ИмяСвойства));
	ИначеЕсли ТипЗнч(ИмяСвойства) = Тип("Массив") Тогда
		МассивПоиска = ИмяСвойства;
	Иначе
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	СтрокаКомментария = ВРег(СтрокаКомментария);
	
	ПозицияСвойства = 0;
	Пока Истина Цикл
		
		РезультатПоиска = СтрНайтиПоМассиву(СтрокаКомментария, МассивПоиска,, ПозицияСвойства + 1);
		Если НЕ РезультатПоиска.Успешно Тогда
			Возврат СтруктураВозврата;
		КонецЕсли;
		
		ПозицияСвойства = РезультатПоиска.Позиция;
		
		// Проверяем предыдущий и следующий символы.
		Если ПозицияСвойства > 1 Тогда
			ПредыдущийСимвол = Сред(СтрокаКомментария, ПозицияСвойства - 1, 1);
			Если апк_СловоСодержитЗначимыеСимволы(ПредыдущийСимвол) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НайденныйЭлемент = РезультатПоиска.НайденныйЭлемент;
		СледующийСимвол = Сред(СтрокаКомментария, ПозицияСвойства + СтрДлина(НайденныйЭлемент), 1);
		Если апк_СловоСодержитЗначимыеСимволы(СледующийСимвол) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураВозврата.Позиция = ПозицияСвойства;
		СтруктураВозврата.НайденныйЭлемент = НайденныйЭлемент;
		СтруктураВозврата.Успешно = Истина;
		
		Прервать;
		
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция СтрокаСодержитОписаниеСвойствКлючИЗначение(Знач СтрокаКомментария)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ПозицияТекстаКлюч", 0);
	СтруктураВозврата.Вставить("ПозицияТекстаЗначение", 0);
	СтруктураВозврата.Вставить("НайденныйТекстКлюч", "");
	СтруктураВозврата.Вставить("НайденныйТекстЗначение", "");
	СтруктураВозврата.Вставить("Успешно", Ложь);
	
	// Проверяем текст "Ключ" со всеми вариантами склонения в текстовом описании параметра.
	СтруктураПоиска = СтрокаСодержитОписаниеСвойства(СтрокаКомментария, Контекст["МассивТекстКлюч"]);
	Если НЕ СтруктураПоиска.Успешно Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	СтруктураВозврата.ПозицияТекстаКлюч  = СтруктураПоиска.Позиция;
	СтруктураВозврата.НайденныйТекстКлюч = Контекст["ТекстКлюч"];
	
	// Проверяем текст "Значение" со всеми вариантами склонения в текстовом описании параметра.
	СтруктураПоиска = СтрокаСодержитОписаниеСвойства(СтрокаКомментария, Контекст["МассивТекстЗначение"]);
	Если НЕ СтруктураПоиска.Успешно Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	СтруктураВозврата.ПозицияТекстаЗначение  = СтруктураПоиска.Позиция;
	СтруктураВозврата.НайденныйТекстЗначение = Контекст["ТекстЗначение"];;
	СтруктураВозврата.Успешно = Истина;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция СтрокаСодержитНачалоСекции(Знач СтрокаКомментария, МассивТекстНаименованийСекции)
	
	СтрокаКомментарияБуфер = ВРег(СтрокаКомментария);
	СтрокаКомментарияБуфер = СтрЗаменить(СтрокаКомментарияБуфер, " ", "");
	СтрокаКомментарияБуфер = СтрЗаменить(СтрокаКомментарияБуфер, Символы.Таб, "");
	
	// Проверяем текст строки целиком в массиве возможных вариантов наименований секции.
	Если МассивТекстНаименованийСекции.Найти(СтрокаКомментарияБуфер) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Для Каждого НаименованиеСекции Из МассивТекстНаименованийСекции Цикл
		
		// Проверяем текст строки среди возможных вариантов наименований секции с двоеточием.
		Если СтрокаКомментарияБуфер = НаименованиеСекции + ":" Тогда
			Возврат Истина;
		КонецЕсли;
		
		// Если строка начинается с возможного варианта наименования секции с тире, то это начало секции.
		Если СтрНачинаетсяС(СтрокаКомментарияБуфер, НаименованиеСекции + "-") Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция УдалитьПервыйНезначимыйСимволИзСтроки(Знач Строка)
	
	Если ПустаяСтрока(Строка) Тогда
		Возврат Строка;
	КонецЕсли;
	
	Строка = СокрЛ(Строка);
	
	МассивЗначимыхСимволовНачалаСтроки = Контекст["МассивЗначимыхСимволовНачалаСтроки"];
	Если СтрНачинаетсяСПоМассиву(Строка, МассивЗначимыхСимволовНачалаСтроки).Успешно Тогда
		Возврат Строка;
	КонецЕсли;
	
	ПервыйСимвол = Лев(Строка, 1);
	Если НЕ апк_СловоСодержитЗначимыеСимволы(ПервыйСимвол) Тогда
		Строка = Сред(Строка, 2);
		Строка = СокрЛ(Строка);
	КонецЕсли;
	
	Возврат Строка;
	
КонецФункции

Функция УдалитьПоследнийНезначимыйСимволИзСтроки(Знач Строка)
	
	Если ПустаяСтрока(Строка) Тогда
		Возврат Строка;
	КонецЕсли;
	
	Строка = СокрП(Строка);
	
	МассивЗначимыхСимволовОкончанияСтроки = Контекст["МассивЗначимыхСимволовОкончанияСтроки"];
	Если СтрЗаканчиваетсяНаПоМассиву(Строка, МассивЗначимыхСимволовОкончанияСтроки).Успешно Тогда
		Возврат Строка;
	КонецЕсли;
	
	ПоследнийСимвол = Прав(Строка, 1);
	Если НЕ апк_СловоСодержитЗначимыеСимволы(ПоследнийСимвол) Тогда
		Строка = Лев(Строка, СтрДлина(Строка) - 1);
		Строка = СокрП(Строка);
	КонецЕсли;
	
	Возврат Строка;
	
КонецФункции

Функция ИнициализироватьТаблицуОписанияПараметровМетода()
	
	ТаблицаОписанияПараметров = Новый ТаблицаЗначений;
	ТаблицаОписанияПараметров.Колонки.Добавить("ПолноеОписаниеПараметра");
	ТаблицаОписанияПараметров.Колонки.Добавить("ИмяПараметра");
	ТаблицаОписанияПараметров.Колонки.Добавить("УровеньВложенностиПараметра");
	ТаблицаОписанияПараметров.Колонки.Добавить("ПозицияИмениПараметра");
	ТаблицаОписанияПараметров.Колонки.Добавить("ТипПараметра");
	ТаблицаОписанияПараметров.Колонки.Добавить("ТипПараметраМножественный");
	ТаблицаОписанияПараметров.Колонки.Добавить("ПозицияРазделителяПередТипомПараметра");
	ТаблицаОписанияПараметров.Колонки.Добавить("ПозицияТипаПараметра");
	ТаблицаОписанияПараметров.Колонки.Добавить("ТекстовоеОписаниеПараметра");
	ТаблицаОписанияПараметров.Колонки.Добавить("ТекстовоеОписаниеПараметраСодержитГиперссылку");
	ТаблицаОписанияПараметров.Колонки.Добавить("ТекстовоеОписаниеПараметраЯвляетсяГиперссылкой");
	ТаблицаОписанияПараметров.Колонки.Добавить("ПозицияРазделителяПередТекстовымОписаниемПараметра");
	ТаблицаОписанияПараметров.Колонки.Добавить("ПозицияТекстовогоОписанияПараметра");
	ТаблицаОписанияПараметров.Колонки.Добавить("СекцияОписания");
	ТаблицаОписанияПараметров.Колонки.Добавить("ЭтоОписаниеВозвращаемогоЗначения");
	ТаблицаОписанияПараметров.Колонки.Добавить("ЭтоПараметрВерхнегоУровня");
	ТаблицаОписанияПараметров.Колонки.Добавить("ОписаниеПараметраНачинаетсяСТире");
	ТаблицаОписанияПараметров.Колонки.Добавить("ОписаниеПараметраНачинаетсяСоЗвездочки");
	ТаблицаОписанияПараметров.Колонки.Добавить("НомерСтрокиНачалаОписанияПараметра");
	ТаблицаОписанияПараметров.Колонки.Добавить("НомерСтрокиКонцаОписанияПараметра");
	ТаблицаОписанияПараметров.Колонки.Добавить("СостояниеПараметра");
	ТаблицаОписанияПараметров.Колонки.Добавить("ТекстОшибки");
	ТаблицаОписанияПараметров.Колонки.Добавить("НеобходимоПовторноеФорматирование");
	
	Возврат ТаблицаОписанияПараметров;
	
КонецФункции

Функция ПолучитьТаблицуОписанияПараметровМетода(Знач ТекстКомментарияМетода)
	
	ТаблицаОписанияПараметров = ИнициализироватьТаблицуОписанияПараметровМетода();
	
	Если ПустаяСтрока(ТекстКомментарияМетода) Тогда
		Возврат ТаблицаОписанияПараметров;
	КонецЕсли;
	
	МассивТекстПараметры = Контекст["МассивТекстПараметры"];
	МассивТекстВозвращаемоеЗначение = Контекст["МассивТекстВозвращаемоеЗначение"];
	МассивТекстПараметрыВозвращаемоеЗначение = Контекст["МассивТекстПараметрыВозвращаемоеЗначение"];
	МассивТекстОкончанияСекцииОписанияПараметров = Контекст["МассивТекстОкончанияСекцииОписанияПараметров"];
	
	ДокументТекст = Новый ТекстовыйДокумент;
	ДокументТекст.УстановитьТекст(ТекстКомментарияМетода);
	
	КоличествоСтрокКомментария = ДокументТекст.КоличествоСтрок();
	
	ТекстКомментарияМетодаВРег = ТекстКомментарияМетода;
	ТекстКомментарияМетодаВРег = ВРег(ТекстКомментарияМетодаВРег);
	ТекстКомментарияМетодаВРег = СтрЗаменить(ТекстКомментарияМетодаВРег, Символы.Таб, "");
	ТекстКомментарияМетодаВРег = СтрЗаменить(ТекстКомментарияМетодаВРег, " ", "");
	
	ПозицияПоискаСекции = 0;
	ЭтоОписаниеВозвращаемогоЗначения = Ложь;
	Для Каждого НаименованиеСекции Из МассивТекстПараметрыВозвращаемоеЗначение Цикл
		
		ПозицияПоискаСекции = СтрНайти(ТекстКомментарияМетодаВРег, НаименованиеСекции,, ПозицияПоискаСекции + 1);
		Если ПозицияПоискаСекции = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НомерСтрокиНачалаСекции = ПолучитьНомерСтрокиМодуля(ТекстКомментарияМетодаВРег, ПозицияПоискаСекции);
		СтрокаСекции = ДокументТекст.ПолучитьСтроку(НомерСтрокиНачалаСекции);
		
		// Если в строке начала секции количество знаков комментария больше 2-х,
		// то это может быть шаблон для описания другой процедуры, пример ниже.
		Если СтрЧислоВхождений(СтрокаСекции, "// ") > 1 Тогда
			Продолжить;
		КонецЕсли;
		
		Если МассивТекстПараметры.Найти(НаименованиеСекции) <> Неопределено Тогда
			СекцияОписания = "Параметры";
			ЭтоОписаниеВозвращаемогоЗначения = Ложь;
		ИначеЕсли МассивТекстВозвращаемоеЗначение.Найти(НаименованиеСекции) <> Неопределено Тогда
			СекцияОписания = "ВозвращаемоеЗначение";
			ЭтоОписаниеВозвращаемогоЗначения = Истина;
			// Проверяем, что строка действительно является началом секции, т.к. секция "Возвращаемое значение" часто бывает описана неверно.
			Если НЕ СтрокаСодержитНачалоСекции(СтрокаСекции, МассивТекстВозвращаемоеЗначение) Тогда
				Продолжить;
			КонецЕсли;
		Иначе
			Продолжить;
		КонецЕсли;
		
		// Иногда секция "Возвращаемое значение" описана неверно, например:
		// Возвращаемое значение - Строка - шаблон имя профиля безопасности.
		// Тогда переопределяем номер строки начала секции.
		Если СтрНайти(СтрокаСекции, "-") > 0 Тогда
			НомерСтрокиНачалаСекции = НомерСтрокиНачалаСекции - 1;
		КонецЕсли;
		
		// Получаем длину отступа первого параметра.
		ДлинаОтступаПервогоПараметра = ПолучитьДлинуОтступаПервогоПараметра(ДокументТекст, НомерСтрокиНачалаСекции, КоличествоСтрокКомментария);
		
		// Если не удалось получить отступ первого параметра, то пропускаем секцию.
		Если ДлинаОтступаПервогоПараметра = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицыОписанияПараметров = Неопределено;
		МассивСтрокПолногоОписанияПараметра = Новый Массив;
		МассивСтрокТекстовогоОписанияПараметра = Новый Массив;
		ТекущийУровеньВложенности = 0;
		ДлинаОтступаТекущегоПараметра = ДлинаОтступаПервогоПараметра;
		ДлинаОтступаПредыдущегоПараметра = ДлинаОтступаТекущегоПараметра;
		
		Для НомерСтроки = НомерСтрокиНачалаСекции + 1 По КоличествоСтрокКомментария Цикл
			
			СтрокаСекцииИсходная = ДокументТекст.ПолучитьСтроку(НомерСтроки);
			СтрокаСекции = СокрЛ(СтрокаСекцииИсходная);
			СтрокаСекции = СтрЗаменить(СтрокаСекции, Символы.Таб, "  "); // Для сравнения отступа также заменяем таб на 2 пробела.
			
			// Если комментарий закончился, то прерываем.
			Если НЕ СтрНачинаетсяС(СтрокаСекции, "//") Тогда
				Прервать;
			КонецЕсли;
			
			// Если обрабатывается секция "Параметры", и встретилась секция "Возвращаемое значение", то прерываем.
			Если СекцияОписания = "Параметры" Тогда
				Если СтрокаСодержитНачалоСекции(СтрокаСекции, МассивТекстВозвращаемоеЗначение) Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
			СтрокаСекцииБуфер = ВРег(СтрокаСекции);
			СтрокаСекцииБуфер = СтрЗаменить(СтрокаСекцииБуфер, " ", "");
			
			// Если встретились указатели окончания секции описания параметров, например, секция "Пример", то прерываем.
			Если СтрНачинаетсяСПоМассиву(СтрокаСекцииБуфер, МассивТекстОкончанияСекцииОписанияПараметров).Успешно Тогда
				Прервать;
			КонецЕсли;
			
			// Проверяем отступ каждого параметра.
			ОтступТекущегоПараметра = ПолучитьОтступПослеЗнакаКомментария(СтрокаСекции, Ложь);
			ДлинаОтступаТекущегоПараметра = СтрДлина(ОтступТекущегоПараметра);
			
			// Если отступа параметра нет, то параметры могут быть разделены пустой строкой, необходима дополнительная проверка.
			Если ДлинаОтступаТекущегоПараметра = 0 Тогда
				// Добавляем текстовое описание и переходим к следующей строке.
				МассивСтрокПолногоОписанияПараметра.Добавить(СтрокаСекцииИсходная);
				МассивСтрокТекстовогоОписанияПараметра.Добавить(СтрокаСекцииИсходная);
				Продолжить;
			КонецЕсли;
			
			// Если отступ в следующей строке меньше, чем отступ первого параметра, то описание секции закончилось.
			// С учетом замены символа табуляции на 2 пробела делаем допустимой разницу в 1 пробел.
			Если (ДлинаОтступаТекущегоПараметра + 1) < ДлинаОтступаПервогоПараметра Тогда
				Прервать;
			КонецЕсли;
			
			// Если отступ в следующей строке больше, чем отступ первого параметра,
			// то проверяем, содержит ли строка описание параметра.
			Если (ДлинаОтступаТекущегоПараметра > ДлинаОтступаПервогоПараметра) Тогда
				
				// Подготовим структуру параметров описания текущей строки.
				СтруктураДанныхОписанияПараметра = Новый Структура;
				СтруктураДанныхОписанияПараметра.Вставить("СекцияОписания", СекцияОписания);
				СтруктураДанныхОписанияПараметра.Вставить("ДлинаОтступаТекущегоПараметра", ДлинаОтступаТекущегоПараметра);
				СтруктураДанныхОписанияПараметра.Вставить("ДлинаОтступаПредыдущегоПараметра", ДлинаОтступаПредыдущегоПараметра);
				СтруктураДанныхОписанияПараметра.Вставить("СтрокаОписанияПредыдущегоПараметра", СтрокаТаблицыОписанияПараметров);
				
				// Если строка не содержит описание параметра, то добавляем текстовое описание и переходим к следующей строке.
				Если НЕ СтрокаСодержитОписаниеПараметра(СтрокаСекции, СтруктураДанныхОписанияПараметра) Тогда
					МассивСтрокПолногоОписанияПараметра.Добавить(СтрокаСекцииИсходная);
					МассивСтрокТекстовогоОписанияПараметра.Добавить(СтрокаСекцииИсходная);
					Продолжить;
				КонецЕсли;
				
			КонецЕсли;
			
			// Закрываем предыдущий параметр.
			Если СтрокаТаблицыОписанияПараметров <> Неопределено Тогда
				СтрокаТаблицыОписанияПараметров.ПолноеОписаниеПараметра = СтрСоединить(МассивСтрокПолногоОписанияПараметра, Символы.ПС);
				СтрокаТаблицыОписанияПараметров.ТекстовоеОписаниеПараметра = СокрЛ(СтрСоединить(МассивСтрокТекстовогоОписанияПараметра, Символы.ПС));
			КонецЕсли;
			
			МассивСтрокПолногоОписанияПараметра.Очистить();
			МассивСтрокПолногоОписанияПараметра.Добавить(СтрокаСекцииИсходная);
			
			Если СекцияОписания = "ВозвращаемоеЗначение" Тогда
				ЭтоОписаниеВозвращаемогоЗначения = (ДлинаОтступаТекущегоПараметра = ДлинаОтступаПервогоПараметра);
			КонецЕсли;
			
			ПолучатьИмяПараметра = СтрокаСодержитИмяПараметра(СтрокаСекции, ЭтоОписаниеВозвращаемогоЗначения);
			
			// Получаем имя, тип и текстовое описание параметра, а также их позиции в строке секции.
			СтруктураОписанияПараметра = ПолучитьСтруктуруОписанияПараметра(СтрокаСекцииИсходная, ПолучатьИмяПараметра, ТекущийУровеньВложенности);
			
			МассивСтрокТекстовогоОписанияПараметра.Очистить();
			МассивСтрокТекстовогоОписанияПараметра.Добавить(СтруктураОписанияПараметра.ТекстовоеОписаниеПараметра);
			ТекущийУровеньВложенности = СтруктураОписанияПараметра.УровеньВложенностиПараметра;
			
			// Записываем новый параметр.
			СтрокаТаблицыОписанияПараметров = ТаблицаОписанияПараметров.Добавить();
			
			// Заполняем колонки строки таблицы описания параметров.
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыОписанияПараметров, СтруктураОписанияПараметра,, "ТекстовоеОписаниеПараметра");
			СтрокаТаблицыОписанияПараметров.ПолноеОписаниеПараметра = СтрСоединить(МассивСтрокПолногоОписанияПараметра, Символы.ПС);
			СтрокаТаблицыОписанияПараметров.ТекстовоеОписаниеПараметра = СокрЛ(СтрСоединить(МассивСтрокТекстовогоОписанияПараметра, Символы.ПС));
			
			СтрокаТаблицыОписанияПараметров.СекцияОписания = СекцияОписания;
			СтрокаТаблицыОписанияПараметров.ЭтоОписаниеВозвращаемогоЗначения = ЭтоОписаниеВозвращаемогоЗначения;
			СтрокаТаблицыОписанияПараметров.ЭтоПараметрВерхнегоУровня = (ДлинаОтступаТекущегоПараметра <= ДлинаОтступаПервогоПараметра);
			СтрокаТаблицыОписанияПараметров.НомерСтрокиНачалаОписанияПараметра = НомерСтроки;
			
			// Запоминаем длину отступа предыдущего параметра.
			ДлинаОтступаПредыдущегоПараметра = ДлинаОтступаТекущегоПараметра;
			
		КонецЦикла;
		
		// Закрываем последний параметр.
		Если СтрокаТаблицыОписанияПараметров <> Неопределено Тогда
			СтрокаТаблицыОписанияПараметров.ПолноеОписаниеПараметра = СтрСоединить(МассивСтрокПолногоОписанияПараметра, Символы.ПС);
			СтрокаТаблицыОписанияПараметров.ТекстовоеОписаниеПараметра = СокрЛ(СтрСоединить(МассивСтрокТекстовогоОписанияПараметра, Символы.ПС));
		КонецЕсли;
		
		// Определим номера строк конца описания параметра для каждого параметра в таблице.
		Для Каждого СтрокаТаблицыОписанияПараметров Из ТаблицаОписанияПараметров Цикл
			
			// Удалим лишние пустые строки в конце текстового описания параметра.
			ТекстовоеОписаниеПараметра = СтрокаТаблицыОписанияПараметров.ТекстовоеОписаниеПараметра;
			ТекстовоеОписаниеПараметра = ПолучитьТекстОписанияПараметраДоПервойПустойСтроки(ТекстовоеОписаниеПараметра);
			СтрокаТаблицыОписанияПараметров.ТекстовоеОписаниеПараметра = ТекстовоеОписаниеПараметра;
			
			ПолноеОписаниеПараметра = СтрокаТаблицыОписанияПараметров.ПолноеОписаниеПараметра;
			ПолноеОписаниеПараметра = ПолучитьТекстОписанияПараметраДоПервойПустойСтроки(ПолноеОписаниеПараметра);
			СтрокаТаблицыОписанияПараметров.ПолноеОписаниеПараметра = ПолноеОписаниеПараметра;
			
			НомерСтрокиНачалаОписанияПараметра = СтрокаТаблицыОписанияПараметров.НомерСтрокиНачалаОписанияПараметра;
			НомерСтрокиКонцаОписанияПараметра = НомерСтрокиНачалаОписанияПараметра + СтрЧислоСтрок(ПолноеОписаниеПараметра) - 1;
			СтрокаТаблицыОписанияПараметров.НомерСтрокиКонцаОписанияПараметра = НомерСтрокиКонцаОписанияПараметра;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТаблицаОписанияПараметров.ЗаполнитьЗначения(Ложь, "ТекстовоеОписаниеПараметраСодержитГиперссылку");
	ТаблицаОписанияПараметров.ЗаполнитьЗначения(Ложь, "ТекстовоеОписаниеПараметраЯвляетсяГиперссылкой");
	ТаблицаОписанияПараметров.ЗаполнитьЗначения("Исходный", "СостояниеПараметра");
	ТаблицаОписанияПараметров.ЗаполнитьЗначения("", "ТекстОшибки");
	ТаблицаОписанияПараметров.ЗаполнитьЗначения(Ложь, "НеобходимоПовторноеФорматирование");
	
	Возврат ТаблицаОписанияПараметров;
	
КонецФункции

Функция ПолучитьТаблицуПолныхИменФайловОбъектов()
	
	ТаблицаРезультат = Контекст["ТаблицаРезультат"];
	Если ТаблицаРезультат <> Неопределено Тогда
		Возврат ТаблицаРезультат;
	КонецЕсли;
	
	ТаблицаРезультат = Результат.Выгрузить(, "Объект, ПолноеИмяФайла");
	ТаблицаРезультат.Индексы.Добавить("Объект");
	
	Контекст.Вставить("ТаблицаРезультат", ТаблицаРезультат);
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция УдалитьТекстОбщийМодульИзПутиОбъекта(Знач ПутьОбъекта)
	
	Если ПустаяСтрока(ПутьОбъекта) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстОбщийМодуль = Контекст["ТекстОбщийМодуль"];
	
	Если СтрНачинаетсяС(ВРег(ПутьОбъекта), ВРег(ТекстОбщийМодуль) + ".") Тогда
		ПутьОбъекта = Сред(ПутьОбъекта, СтрДлина(ТекстОбщийМодуль + ".") + 1);
	КонецЕсли;
	
	Возврат ПутьОбъекта;
	
КонецФункции

Функция ПолучитьОбъектПереадресацииИзГиперссылки(Знач ТекстГиперссылки, ТаблицаОписанияПараметров)
	
	ТекстОбъектаГиперссылки = СокрЛП(ТекстГиперссылки);
	
	// Уберем точку в конце текста гиперссылки.
	МассивЭлементовПереадресации = СтрРазделить(ТекстОбъектаГиперссылки, ".", Ложь);
	ТекстОбъектаГиперссылки = СтрСоединить(МассивЭлементовПереадресации, ".");
	
	// Ищем текст гиперссылки в накопленной таблице объектов переадресации.
	ТаблицаОбъектовПереадресации = Контекст["ТаблицаОбъектовПереадресации"];
	СтрокаОбъектаПереадресации = ТаблицаОбъектовПереадресации.Найти(ВРег(ТекстОбъектаГиперссылки), "ОбъектПереадресацииВРег");
	Если СтрокаОбъектаПереадресации <> Неопределено Тогда
		// Если нашли, выходим.
		Возврат СтрокаОбъектаПереадресации;
	КонецЕсли;
	
	ТекстОбщийМодуль = Контекст["ТекстОбщийМодуль"];
	
	ТаблицаРезультат = ПолучитьТаблицуПолныхИменФайловОбъектов();
	
	ГиперссылкаУказанаНаМетодТекущегоМодуля = Ложь;
	
	ТипОбъектаКонфигурации = Неопределено;
	ОбъектКонфигурации = Неопределено;
	МетодОбъектаКонфигурации = Неопределено;
	ПараметрМетодаОбъектаКонфигурации = Неопределено;
	
	МассивЭлементовПутиОбъектаПереадресации = Новый Массив;
	МассивФайловОбъектаКонфигурации = Новый Массив;
	
	Для Каждого ЭлементПереадресации Из МассивЭлементовПереадресации Цикл
		
		// Определяем тип объекта конфигурации.
		Если ТипОбъектаКонфигурации = Неопределено Тогда
			
			ТипОбъектаКонфигурации = ПолучитьТипОбъектаПоТаблицеТипов(ЭлементПереадресации, "", "Имя", "");
			// Если тип объекта не определен, то это либо общий модуль, либо текущий объект.
			Если ПустаяСтрока(ТипОбъектаКонфигурации) Тогда
				ТипОбъектаКонфигурации = ТекстОбщийМодуль;
			Иначе
				// Если определили тип объекта, то проверяем следующий элемент переадресации.
				МассивЭлементовПутиОбъектаПереадресации.Добавить(ЭлементПереадресации);
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		// Определяем объект конфигурации.
		Если ОбъектКонфигурации = Неопределено Тогда
			
			ОбъектКонфигурации = ТипОбъектаКонфигурации + "." + ЭлементПереадресации;
			СтрокаТаблицыРезультат = ТаблицаРезультат.Найти(ОбъектКонфигурации, "Объект");
			Если СтрокаТаблицыРезультат = Неопределено Тогда
				// Если не нашли объект конфигурации, то считаем, что переадресация ведет к методу в текущем обрабатываемом модуле.
				ГиперссылкаУказанаНаМетодТекущегоМодуля = Истина;
				
				ТекущийОбрабатываемыйФайл = Контекст["ТекущийОбрабатываемыйФайл"];
				СтрокаТаблицыРезультат = ТаблицаРезультат.Найти(ТекущийОбрабатываемыйФайл, "ПолноеИмяФайла");
				ОбъектКонфигурации = ?(СтрокаТаблицыРезультат = Неопределено, "", СтрокаТаблицыРезультат.Объект);
				МассивЭлементовПутиОбъектаПереадресации.Добавить(ОбъектКонфигурации);
				
				// В массив файлов объекта добавляем только текущий обрабатываемый файл.
				МассивФайловОбъектаКонфигурации.Добавить(ТекущийОбрабатываемыйФайл);
			Иначе
				// Если нашли объект конфигурации, то запоминаем и переходим к следующему элементу.
				МассивЭлементовПутиОбъектаПереадресации.Добавить(ЭлементПереадресации);
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		// Определяем метод объекта конфигурации.
		Если МетодОбъектаКонфигурации = Неопределено Тогда
			МетодОбъектаКонфигурации = ЭлементПереадресации;
			МассивЭлементовПутиОбъектаПереадресации.Добавить(ЭлементПереадресации);
			Продолжить;
		КонецЕсли;
		
		// Определяем параметр метода объекта конфигурации.
		Если ПараметрМетодаОбъектаКонфигурации = Неопределено Тогда
			ПараметрМетодаОбъектаКонфигурации = ЭлементПереадресации;
			МассивЭлементовПутиОбъектаПереадресации.Добавить(ЭлементПереадресации);
		КонецЕсли;
		
		// Определять больше нечего, прерываем.
		Прервать;
		
	КонецЦикла;
	
	// Определяем объект переадресации по тексту гиперссылки.
	ОбъектПереадресации = ТекстОбъектаГиперссылки;
	Если ГиперссылкаУказанаНаМетодТекущегоМодуля Тогда
		
		// Если в гиперссылке содержится только метод, то переопределяем полный путь к объекту переадресации.
		ОбъектПереадресации = СтрСоединить(МассивЭлементовПутиОбъектаПереадресации, ".");
		// Удаляем из наименования объекта конфигурации текст "ОбщийМодуль.".
		ОбъектПереадресации = УдалитьТекстОбщийМодульИзПутиОбъекта(ОбъектПереадресации);
		
		// Т.к. текст объекта гиперссылки изменился, перепроверим еще раз в накопленной таблице объектов переадресации.
		СтрокаОбъектаПереадресации = ТаблицаОбъектовПереадресации.Найти(ВРег(ОбъектПереадресации), "ОбъектПереадресацииВРег");
		Если СтрокаОбъектаПереадресации <> Неопределено Тогда
			// Если нашли, выходим.
			Возврат СтрокаОбъектаПереадресации;
		КонецЕсли;
		
	КонецЕсли;
	
	// Еще возможна ситуация, когда гиперссылка указывает на другой параметр этого же метода, проверяем.
	ТекущийОбрабатываемыйМетод = Контекст["ТекущийОбрабатываемыйМетод"];
	ИмяМетода = ?(ТекущийОбрабатываемыйМетод = Неопределено, "", ТекущийОбрабатываемыйМетод.ИмяМетода);
	
	ОбъектПереадресацииПараметр = УдалитьТекстОбщийМодульИзПутиОбъекта(ОбъектКонфигурации);
	ОбъектПереадресацииПараметр = ОбъектПереадресацииПараметр + "." + ИмяМетода + "." + ТекстОбъектаГиперссылки;
	
	// Перепроверим в накопленной таблице объектов переадресации.
	СтрокаОбъектаПереадресации = ТаблицаОбъектовПереадресации.Найти(ВРег(ОбъектПереадресацииПараметр), "ОбъектПереадресацииВРег");
	Если СтрокаОбъектаПереадресации <> Неопределено Тогда
		// Если нашли, выходим.
		Возврат СтрокаОбъектаПереадресации;
	КонецЕсли;
	
	СтрокаОбъектаПереадресации = ТаблицаОбъектовПереадресации.Добавить();
	СтрокаОбъектаПереадресации.ТипОбъектаПереадресации = "";
	СтрокаОбъектаПереадресации.ОбъектПереадресации = ОбъектПереадресации;
	СтрокаОбъектаПереадресации.ОбъектПереадресацииВРег = ВРег(ОбъектПереадресации);
	СтрокаОбъектаПереадресации.МетодПереадресации = Неопределено;
	СтрокаОбъектаПереадресации.Существует = Ложь;
	СтрокаОбъектаПереадресации.ЗарегистрироватьОшибку = Истина;
	
	// В тексте гиперссылки может быть указан не метод, а другой объект: см. ОпределяемыйТип.УчетныеСистемыИнтеграцииОбластейДанных.
	// Или реквизит: см. Справочники.ВариантыОтчетов.Реквизиты.Отчет
	// Проверяем тип объекта среди типов без модулей (для случая с определяемым типом).
	МассивТиповОбъектовБезМодулей = Контекст["МассивТиповОбъектовБезМодулей"];
	Если МассивТиповОбъектовБезМодулей.Найти(ТипОбъектаКонфигурации) <> Неопределено Тогда
		// Если тип объекта найден, то проверяем наличие объекта.
		Если ТаблицаРезультат.Найти(ТекстОбъектаГиперссылки, "Объект") <> Неопределено Тогда
			СтрокаОбъектаПереадресации.ТипОбъектаПереадресации = ТипОбъектаКонфигурации;
			СтрокаОбъектаПереадресации.ЗарегистрироватьОшибку = Ложь;
			Возврат СтрокаОбъектаПереадресации;
		КонецЕсли;
	КонецЕсли;
	
	// Если количество элементов объекта переадресации больше 2-х, то проверим 3-й элемент (для случая с реквизитом).
	Если МассивЭлементовПереадресации.Количество() > 2 Тогда
		ТретийЭлементПереадресации = МассивЭлементовПереадресации[2];
		ТретийЭлементПереадресации = ПолучитьТипОбъектаПоТаблицеТипов(ТретийЭлементПереадресации, "", "Имя");
		Если МассивТиповОбъектовБезМодулей.Найти(ТретийЭлементПереадресации) <> Неопределено Тогда
			СтрокаОбъектаПереадресации.ТипОбъектаПереадресации = ТретийЭлементПереадресации;
			СтрокаОбъектаПереадресации.ЗарегистрироватьОшибку = Ложь;
			Возврат СтрокаОбъектаПереадресации;
		КонецЕсли;
	КонецЕсли;
	
	// Проверяем, ссылается ли объект переадресации на другой параметр текущего метода.
	ОбъектПереадресацииЯвляетсяДругимПараметромМетода = Истина;
	Для Каждого ЭлементПереадресации Из МассивЭлементовПереадресации Цикл
		
		ЭлементПереадресацииНайденСредиПараметров = Ложь;
		
		ЭлементПереадресации = ПреобразоватьТекстДляСравнения(ЭлементПереадресации);
		Для Каждого СтрокаОписанияПараметра Из ТаблицаОписанияПараметров Цикл
			ИмяПараметра = ПреобразоватьТекстДляСравнения(СтрокаОписанияПараметра.ИмяПараметра);
			Если ЭлементПереадресации = ИмяПараметра Тогда
				ЭлементПереадресацииНайденСредиПараметров = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ЭлементПереадресацииНайденСредиПараметров Тогда
			ОбъектПереадресацииЯвляетсяДругимПараметромМетода = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	// Если нашли, заполняем значения в таблицу и выходим.
	Если ОбъектПереадресацииЯвляетсяДругимПараметромМетода Тогда
		СтрокаОбъектаПереадресации.ТипОбъектаПереадресации = "Параметр";
		СтрокаОбъектаПереадресации.ОбъектПереадресации = ОбъектПереадресацииПараметр;
		СтрокаОбъектаПереадресации.ОбъектПереадресацииВРег = ВРег(ОбъектПереадресацииПараметр);
		СтрокаОбъектаПереадресации.Существует = Истина;
		СтрокаОбъектаПереадресации.ЗарегистрироватьОшибку = Ложь;
		Возврат СтрокаОбъектаПереадресации;
	КонецЕсли;
	
	// Если объект или метод определить не удалось, выходим.
	Если (ОбъектКонфигурации = Неопределено) ИЛИ (МетодОбъектаКонфигурации = Неопределено) Тогда
		Возврат СтрокаОбъектаПереадресации;
	КонецЕсли;
	
	// Если массив файлов объекта конфигурации для проверки переадресации пустой, то получим набор модулей объекта.
	Если МассивФайловОбъектаКонфигурации.Количество() = 0 Тогда
		СтруктураОтбораОбъект = Новый Структура("Объект", ОбъектКонфигурации);
		МассивСтрокТаблицыРезультат = ТаблицаРезультат.НайтиСтроки(СтруктураОтбораОбъект);
		Для Каждого СтрокаТаблицыРезультат Из МассивСтрокТаблицыРезультат Цикл
			// Добавляем только модули - определяем по расширению ".bsl".
			ПолноеИмяФайла = СтрокаТаблицыРезультат.ПолноеИмяФайла;
			Если СтрЗаканчиваетсяНа(ПолноеИмяФайла, ".bsl") Тогда
				МассивФайловОбъектаКонфигурации.Добавить(ПолноеИмяФайла);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Файлов объекта конфигурации не найдено, то выходим.
	Если МассивФайловОбъектаКонфигурации.Количество() = 0 Тогда
		Возврат СтрокаОбъектаПереадресации;
	КонецЕсли;
	
	// Ищем метод в модулях объекта.
	Для Каждого ФайлОбъектаКонфигурации Из МассивФайловОбъектаКонфигурации Цикл
		
		Если НЕ апк_ФайлСуществует(ФайлОбъектаКонфигурации) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументТекст = ПолучитьТекстовыйДокументИзФайла(ПолноеИмяФайла, КодировкаТекста.UTF8);
		Если ДокументТекст = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстМодуля = ДокументТекст.ПолучитьТекст();
		Если ПустаяСтрока(ТекстМодуля) Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаМетодовМодуля = ПолучитьТаблицуПроцедурИФункций(ТекстМодуля);
		Если ТаблицаМетодовМодуля.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Ищем метод объекта конфигурации в таблице методов модуля.
		СтрокаТаблицыМетодовМодуля = ТаблицаМетодовМодуля.Найти(ВРег(МетодОбъектаКонфигурации), "ИмяМетодаВРег");
		Если СтрокаТаблицыМетодовМодуля = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Если нашли метод, то запоминаем его.
		СтрокаОбъектаПереадресации.МетодПереадресации = СтрокаТаблицыМетодовМодуля;
		
		// И проверяем, указан ли параметр.
		Если ПараметрМетодаОбъектаКонфигурации = Неопределено Тогда
			// Если параметр не указан, то записываем в таблицу, что нашли объект из гиперссылки.
			СтрокаОбъектаПереадресации.ТипОбъектаПереадресации = СтрокаТаблицыМетодовМодуля.ТипМетода;
			СтрокаОбъектаПереадресации.Существует = Истина;
			СтрокаОбъектаПереадресации.ЗарегистрироватьОшибку = Ложь;
			Продолжить;
		КонецЕсли;
		
		// Если параметр указан, то проверяем его существование.
		ПараметрыМетода = СтрокаТаблицыМетодовМодуля.МассивПараметров;
		Для Каждого ПараметрМетода Из ПараметрыМетода Цикл
			ПараметрМетода = ПолучитьИмяПараметра(ПараметрМетода);
			Если СтрСравнить(ПараметрМетода, ПараметрМетодаОбъектаКонфигурации) = 0 Тогда
				// Если нашли параметр, то записываем в таблицу.
				СтрокаОбъектаПереадресации.ТипОбъектаПереадресации = "Параметр";
				СтрокаОбъектаПереадресации.Существует = Истина;
				СтрокаОбъектаПереадресации.ЗарегистрироватьОшибку = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат СтрокаОбъектаПереадресации;
	
КонецФункции

// Возвращает "Ложь", если в КаталогВыгрузкиРезультат найден файл "Configuration.mdo"
// Возвращает "Истина", если в КаталогВыгрузкиРезультат найден файл "Configuration.xml"
// По умолчанию возвращает "Истина".
//
Функция ЭтоВыгрузкаXMLФайлов()
	
	Если ЭтоВыгрузкаXMLФайлов <> Неопределено Тогда
		Возврат ЭтоВыгрузкаXMLФайлов;
	КонецЕсли;
	
	КаталогВыгрузкиРезультат = ОтредактироватьПутьККаталогу(КаталогВыгрузкиРезультат);
	
	ИмяФайлаКонфигурацииДляВыгрузкиXML = КаталогВыгрузкиРезультат + "Configuration.xml";
	ИмяФайлаКонфигурацииДляПроектаEDT = КаталогВыгрузкиРезультат + "src" + РазделительПути + "Configuration" + РазделительПути + "Configuration.mdo";
	ИмяФайлаКонфигурацииДляПроектаEDT_SRC = КаталогВыгрузкиРезультат + "Configuration" + РазделительПути + "Configuration.mdo";
	
	Если апк_ФайлСуществует(ИмяФайлаКонфигурацииДляВыгрузкиXML) Тогда
		// Возвращаем "Истину", если КаталогВыгрузкиРезультат содержит файл "Configuration.xml".
		ЭтоВыгрузкаXMLФайлов = Истина;
	ИначеЕсли апк_ФайлСуществует(ИмяФайлаКонфигурацииДляПроектаEDT) Тогда
		// Возвращаем "Ложь" в случае наличия файла "Configuration.mdo" в каталоге проекта.
		ЭтоВыгрузкаXMLФайлов = Ложь;
	ИначеЕсли апк_ФайлСуществует(ИмяФайлаКонфигурацииДляПроектаEDT_SRC) Тогда
		// Возвращаем "Ложь" в случае наличия файла "Configuration.mdo" в каталоге "src" в каталоге проекта.
		ЭтоВыгрузкаXMLФайлов = Ложь;
	Иначе
		
		// Ищем в КаталогВыгрузкиРезультат файл "Configuration.*".
		МассивФайлов = НайтиФайлы(КаталогВыгрузкиРезультат, "Configuration.*", Истина);
		Если МассивФайлов.Количество() = 0 Тогда
			// По умолчанию возвращаем "Истина".
			ЭтоВыгрузкаXMLФайлов = Истина;
		Иначе
			// Проверяем первый найденный файл "Configuration.*".
			РасширениеФайлаКонфигурации = МассивФайлов[0].Расширение;
			Если СтрСравнить(РасширениеФайлаКонфигурации, ".mdo") = 0 Тогда
				ЭтоВыгрузкаXMLФайлов = Ложь;
			ИначеЕсли СтрСравнить(РасширениеФайлаКонфигурации, ".xml") = 0 Тогда
				ЭтоВыгрузкаXMLФайлов = Истина;
			Иначе
				// По умолчанию возвращаем "Истина".
				ЭтоВыгрузкаXMLФайлов = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// По умолчанию возвращаем "Истина".
	Если ЭтоВыгрузкаXMLФайлов = Неопределено Тогда
		ЭтоВыгрузкаXMLФайлов = Истина;
	КонецЕсли;
	
	Возврат ЭтоВыгрузкаXMLФайлов;
	
КонецФункции

// Возвращает путь к файлу конфигурации в зависимости от значения флага "ЭтоВыгрузкаXMLФайлов".
//
Функция ПолучитьФайлКонфигурации()
	
	Если ЭтоВыгрузкаXMLФайлов = Неопределено Тогда
		ЭтоВыгрузкаXMLФайлов = ЭтоВыгрузкаXMLФайлов();
	КонецЕсли;
	
	Если ЭтоВыгрузкаXMLФайлов Тогда
		ФайлКонфигурации = КаталогВыгрузкиРезультат + "Configuration.xml";
	Иначе
		ФайлКонфигурации = КаталогВыгрузкиРезультат + СтрШаблон("src%1Configuration%1Configuration.mdo", РазделительПути);
	КонецЕсли;
	
	Возврат ФайлКонфигурации;
	
КонецФункции

Процедура ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, КлючПунктаСтандарта)
	
	СтрокаФайлаРезультата = Результат.Найти(ПолноеИмяФайла, "ПолноеИмяФайла");
	Если СтрокаФайлаРезультата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСтандартов = Контекст["ТаблицаСтандартов"];
	
	СтрокаМакета = ТаблицаСтандартов.Найти(КлючПунктаСтандарта, "Ключ");
	Если СтрокаМакета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеСтандарта = "";
	СтрокаРодителя = ТаблицаСтандартов.Найти(СтрокаМакета.КлючРодителя, "Ключ");
	Если СтрокаРодителя <> Неопределено Тогда
		НаименованиеСтандарта = СтрокаРодителя.Наименование;
	КонецЕсли;
	
	НоваяСтрока = ТаблицаИзмененныхОбъектовИСтандартов.Добавить();
	НоваяСтрока.КлючПунктаСтандарта         = КлючПунктаСтандарта;
	НоваяСтрока.КлючСтандарта               = СтрокаМакета.КлючРодителя;
	НоваяСтрока.НаименованиеПунктаСтандарта = СтрокаМакета.Наименование;
	НоваяСтрока.НаименованиеСтандарта       = НаименованиеСтандарта;
	НоваяСтрока.СсылкаСтандарта             = СтрокаМакета.Гиперссылка;
	НоваяСтрока.ПолноеИмяФайла              = ПолноеИмяФайла;
	НоваяСтрока.ПутьОбъекта                 = СтрокаФайлаРезультата.Объект;
	
КонецПроцедуры

// Возвращает структуру, содержащую информацию о результатах поиска.
//
// Параметры:
//   Строка                 - Строка            - строка, в которой будет осуществляться поиск.
//   МассивПоиска           - Массив            - массив подстрок, по которым осуществляется поиск.
//   НаправлениеДляПоиска   - НаправлениеПоиска - указывает направление поиска аналогично параметру метода СтрНайти().
//   НачальнаяПозицияПоиска - Число             - указывает позицию в строке, с которой начинается поиск.
//
// Возвращаемое значение:
//   Структура - структура с ключами:
//     НайденныйЭлемент - Элемент массива, который удалось найти.
//     Позиция - Число, позиция найденного элемента.
//     Успешно - Булево, Истина если, удалось найти хоть один элемент.
//
Функция СтрНайтиПоМассиву(Строка, МассивПоиска, НаправлениеДляПоиска = Неопределено,
	НачальнаяПозицияПоиска = Неопределено, ВернутьПервыйНайденныйЭлемент = Ложь)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("НайденныйЭлемент", "");
	СтруктураВозврата.Вставить("Позиция", 0);
	СтруктураВозврата.Вставить("Успешно", Ложь);
	
	Если НаправлениеДляПоиска = Неопределено Тогда
		НаправлениеДляПоиска = НаправлениеПоиска.СНачала;
	КонецЕсли;
	
	ПоискСНачала = (НаправлениеДляПоиска = НаправлениеПоиска.СНачала);
	
	Если НачальнаяПозицияПоиска = Неопределено Тогда
		НачальнаяПозицияПоиска = ?(ПоискСНачала, 1, СтрДлина(Строка));
	КонецЕсли;
	
	ВременнаяПозицияПоиска = 0;
	Для Каждого ТекстПоиска Из МассивПоиска Цикл
		
		ТекущаяПозицияПоиска = СтрНайти(Строка, ТекстПоиска, НаправлениеДляПоиска, НачальнаяПозицияПоиска);
		Если ТекущаяПозицияПоиска = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если (ВременнаяПозицияПоиска = 0)
			ИЛИ ?(ПоискСНачала, ТекущаяПозицияПоиска < ВременнаяПозицияПоиска, ТекущаяПозицияПоиска > ВременнаяПозицияПоиска) Тогда
			
			СтруктураВозврата.НайденныйЭлемент = ТекстПоиска;
			СтруктураВозврата.Позиция = ТекущаяПозицияПоиска;
			СтруктураВозврата.Успешно = Истина;
			
			Если ВернутьПервыйНайденныйЭлемент Тогда
				Прервать;
			КонецЕсли;
			
			ВременнаяПозицияПоиска = ТекущаяПозицияПоиска;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Возвращает структуру, содержащую информацию о результатах поиска.
//
// Параметры:
//   Строка - Строка, по которой будет осуществляться поиск.
//   МассивПоиска - Массив, по элементам которого осуществляется поиск.
//
// Возвращаемое значение:
//   Структура, состоящая из ключей:
//     НайденныйЭлемент - Элемент массива, который удалось найти.
//     Успешно - Булево, Истина если, удалось найти хоть один элемент.
//
Функция СтрНачинаетсяСПоМассиву(Строка, МассивПоиска)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("НайденныйЭлемент", "");
	СтруктураВозврата.Вставить("Успешно", Ложь);
	
	Для Каждого ТекстПоиска Из МассивПоиска Цикл
		Успешно = СтрНачинаетсяС(Строка, ТекстПоиска);
		Если Успешно Тогда
			СтруктураВозврата.НайденныйЭлемент = ТекстПоиска;
			СтруктураВозврата.Успешно = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Возвращает структуру, содержащую информацию о результатах поиска.
//
// Параметры:
//   Строка - Строка, по которой будет осуществляться поиск.
//   МассивПоиска - Массив, по элементам которого осуществляется поиск.
//
// Возвращаемое значение:
//   Структура, состоящая из ключей:
//     НайденныйЭлемент - Элемент массива, который удалось найти.
//     Успешно - Булево, Истина если, удалось найти хоть один элемент.
//
Функция СтрЗаканчиваетсяНаПоМассиву(Строка, МассивПоиска)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("НайденныйЭлемент", "");
	СтруктураВозврата.Вставить("Успешно", Ложь);
	
	Для Каждого ТекстПоиска Из МассивПоиска Цикл
		Успешно = СтрЗаканчиваетсяНа(Строка, ТекстПоиска);
		Если Успешно Тогда
			СтруктураВозврата.НайденныйЭлемент = ТекстПоиска;
			СтруктураВозврата.Успешно = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Вычисляет хеш-сумму для строкового значения по указанному типу хеш-функции.
//
// Параметры:
//   Строка         - Строка     - строка, хеш-сумму которой необходимо рассчитать.
//   ТипХешФункции  - ХешФункция - тип хеш-функции.
//   УдалитьПробелы - Булево     - флаг удаления пробелов из результирующей хеш-суммы.
//
// Возвращаемое значение:
//   Строка - контрольная хеш-сумма.
//
Функция ПолучитьХешСуммуИзСтроки(Строка, ТипХешФункции, УдалитьПробелы = Истина)
	
	ХешированиеДанных = Новый ХешированиеДанных(ТипХешФункции);
	ХешированиеДанных.Добавить(Строка(Строка));
	
	ХешСуммаИзСтроки = Строка(ХешированиеДанных.ХешСумма);
	
	Если УдалитьПробелы Тогда
		ХешСуммаИзСтроки = СтрЗаменить(ХешСуммаИзСтроки, " ", "");
	КонецЕсли;
	
	Возврат ХешСуммаИзСтроки;
	
КонецФункции

// Дополняет массив МассивПриемник значениями из массива МассивИсточник.
//
// Параметры:
//  МассивПриемник - Массив - массив, в который необходимо добавить значения.
//  МассивИсточник - Массив - массив значений для заполнения,
//  ТолькоУникальныеЗначения - Булево - необязательный, если истина,
//    то в массив будут включены только те значения, которых в нем еще нет, причем единожды.
//
Процедура ДополнитьМассив(МассивПриемник, МассивИсточник, ТолькоУникальныеЗначения = Ложь)
	
	Для Каждого Значение Из МассивИсточник Цикл
		Если (НЕ ТолькоУникальныеЗначения) ИЛИ (МассивПриемник.Найти(Значение) = Неопределено) Тогда
			МассивПриемник.Добавить(Значение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция МассивВВерхнемРегистре(МассивИсточник)
	
	МассивИсточникВРег = Новый Массив;
	Для Каждого ЭлементМассива Из МассивИсточник Цикл
		МассивИсточникВРег.Добавить(ВРег(ЭлементМассива));
	КонецЦикла;
	
	Возврат МассивИсточникВРег;
	
КонецФункции

// Возвращает преобразованный текст для сравнения.
// Убирает лишние символы и текст для удаления из переданного текста.
//
// Параметры:
//   Текст            - Строка - исходный текст.
//   ТекстДляУдаления - Строка - текст, который будет удален из исходного текста.
//
// Возвращаемое значение:
//   Строка - преобразованный текст.
//
Функция ПреобразоватьТекстДляСравнения(Знач Текст, ТекстДляУдаления = "")
	
	СоответствиеПреобразоватьТекстДляСравнения = Контекст["ПреобразоватьТекстДляСравнения"];
	
	КлючСоответствия = СтрШаблон("%1_%2", Текст, ТекстДляУдаления);
	ЗначениеСоответствия = СоответствиеПреобразоватьТекстДляСравнения[КлючСоответствия];
	Если ЗначениеСоответствия <> Неопределено Тогда
		Возврат ЗначениеСоответствия;
	КонецЕсли;
	
	СтрокаСимволов = " ,.:;""'!?%$#№@`~|&^\/-_*()<>{}[]" + Символы.Таб + Символы.ПС;
	
	ПреобразованныйТекст = ВРег(Текст);
	
	КоличествоСимволов = СтрДлина(СтрокаСимволов);
	Для НомерСимвола = 1 По КоличествоСимволов Цикл
		Символ = Сред(СтрокаСимволов, НомерСимвола, 1);
		ПреобразованныйТекст = СтрЗаменить(ПреобразованныйТекст, Символ, "");
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(ТекстДляУдаления) Тогда
		ПреобразованныйТекст = СтрЗаменить(ПреобразованныйТекст, ВРег(ТекстДляУдаления), "");
	КонецЕсли;
	
	СоответствиеПреобразоватьТекстДляСравнения.Вставить(КлючСоответствия, ПреобразованныйТекст);
	
	Возврат ПреобразованныйТекст;
	
КонецФункции

Функция ПреобразоватьМассивДляСравнения(Знач МассивТекст, ТекстДляУдаления = "")
	
	НомерЭлемента = -1;
	Для Каждого ЭлементМассива Из МассивТекст Цикл
		НомерЭлемента = НомерЭлемента + 1;
		МассивТекст[НомерЭлемента] = ПреобразоватьТекстДляСравнения(ЭлементМассива, ТекстДляУдаления);
	КонецЦикла;
	
	Возврат МассивТекст;
	
КонецФункции

Функция ПолучитьПервоеСловоИзСтроки(Знач Строка, ВключатьТочку = Ложь)
	
	СоответствиеПолучитьПервоеСловоИзСтроки = Контекст["ПолучитьПервоеСловоИзСтроки"];
	
	КлючСоответствия = СтрШаблон("%1_%2", Строка, ВключатьТочку);
	ЗначениеСоответствия = СоответствиеПолучитьПервоеСловоИзСтроки[КлючСоответствия];
	Если ЗначениеСоответствия <> Неопределено Тогда
		Возврат ЗначениеСоответствия;
	КонецЕсли;
	
	Если ПустаяСтрока(Строка) Тогда
		Возврат "";
	КонецЕсли;
	
	Строка = СокрЛП(Строка);
	
	ПервоеСлово = "";
	ДлинаСтроки = СтрДлина(Строка);
	Для НомерСимвола = 1 По ДлинаСтроки Цикл
		
		Символ = Сред(Строка, НомерСимвола, 1);
		ДобавитьТочку = ВключатьТочку И (Символ = ".");
		Если апк_СловоСодержитЗначимыеСимволы(Символ) ИЛИ ДобавитьТочку Тогда
			ПервоеСлово = ПервоеСлово + Символ;
		Иначе
			Если НЕ ПустаяСтрока(ПервоеСлово) Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	СоответствиеПолучитьПервоеСловоИзСтроки.Вставить(КлючСоответствия, ПервоеСлово);
	
	Возврат ПервоеСлово;
	
КонецФункции

// Получает имя параметра метода.
// Например: для текста "Знач Параметр = Неопределено" будет возвращено значение "Параметр".
//
// Параметры:
//   ПараметрМетода - текст параметра метода.
//
// Возвращаемое значение:
//   Строка.
//
Функция ПолучитьИмяПараметра(Знач ПараметрМетода)
	
	МассивТекстЗнач = Контекст["МассивТекстЗнач"];
	
	ПараметрМетода = СокрЛ(ПараметрМетода);
	ПараметрМетода = СтрЗаменить(ПараметрМетода, Символы.ПС, " ");
	ПараметрМетода = СтрЗаменить(ПараметрМетода, Символы.Таб, " ");
	
	СтруктураРезультата = СтрНачинаетсяСПоМассиву(ВРег(ПараметрМетода), МассивТекстЗнач);
	Если СтруктураРезультата.Успешно Тогда
		ПараметрМетода = Сред(ПараметрМетода, СтрДлина(СтруктураРезультата.НайденныйЭлемент) + 1);
	КонецЕсли;
	
	ПозицияРавно = СтрНайти(ПараметрМетода, "=");
	Если ПозицияРавно > 0 Тогда
		ПараметрМетода = Лев(ПараметрМетода, ПозицияРавно - 1);
	КонецЕсли;
	
	Возврат СокрЛП(ПараметрМетода);
	
КонецФункции

Функция ПолучитьТаблицуШаблоновНезначащихОписанийПараметров()
	
	ТаблицаШаблоновНезначащихОписаний = Новый ТаблицаЗначений;
	ТаблицаШаблоновНезначащихОписаний.Колонки.Добавить("ТекстШаблона");
	ТаблицаШаблоновНезначащихОписаний.Колонки.Добавить("Положение");
	
	ШаблонНезначащегоОписания = ТаблицаШаблоновНезначащихОписаний.Добавить();
	ШаблонНезначащегоОписания.ТекстШаблона = ВРег("содержащая передаваемые параметры:");
	ШаблонНезначащегоОписания.Положение = "Конец";
	
	ШаблонНезначащегоОписания = ТаблицаШаблоновНезначащихОписаний.Добавить();
	ШаблонНезначащегоОписания.ТекстШаблона = ВРег("ТаблицаЗначений с колонками:");
	ШаблонНезначащегоОписания.Положение = "Равно";
	
	ШаблонНезначащегоОписания = ТаблицаШаблоновНезначащихОписаний.Добавить();
	ШаблонНезначащегоОписания.ТекстШаблона = ВРег("таблица значений с колонками:");
	ШаблонНезначащегоОписания.Положение = "Равно";
	
	ШаблонНезначащегоОписания = ТаблицаШаблоновНезначащихОписаний.Добавить();
	ШаблонНезначащегоОписания.ТекстШаблона = ВРег("таблица с колонками:");
	ШаблонНезначащегоОписания.Положение = "Равно";
	
	ШаблонНезначащегоОписания = ТаблицаШаблоновНезначащихОписаний.Добавить();
	ШаблонНезначащегоОписания.ТекстШаблона = ВРег("A table with the following columns:");
	ШаблонНезначащегоОписания.Положение = "Равно";
	
	ШаблонНезначащегоОписания = ТаблицаШаблоновНезначащихОписаний.Добавить();
	ШаблонНезначащегоОписания.ТекстШаблона = ВРег("Columns are:");
	ШаблонНезначащегоОписания.Положение = "Равно";
	
	ШаблонНезначащегоОписания = ТаблицаШаблоновНезначащихОписаний.Добавить();
	ШаблонНезначащегоОписания.ТекстШаблона = ВРег("a table with the following fields");
	ШаблонНезначащегоОписания.Положение = "Равно";
	
	ШаблонНезначащегоОписания = ТаблицаШаблоновНезначащихОписаний.Добавить();
	ШаблонНезначащегоОписания.ТекстШаблона = ВРег("Contains the following columns:");
	ШаблонНезначащегоОписания.Положение = "Равно";
	
	Возврат ТаблицаШаблоновНезначащихОписаний;
	
КонецФункции

Функция ИнициализироватьТаблицуОбъектовПереадресации()
	
	ТаблицаОбъектовПереадресации = Новый ТаблицаЗначений;
	ТаблицаОбъектовПереадресации.Колонки.Добавить("ТипОбъектаПереадресации");
	ТаблицаОбъектовПереадресации.Колонки.Добавить("ОбъектПереадресации");
	ТаблицаОбъектовПереадресации.Колонки.Добавить("ОбъектПереадресацииВРег");
	ТаблицаОбъектовПереадресации.Колонки.Добавить("МетодПереадресации");
	ТаблицаОбъектовПереадресации.Колонки.Добавить("Существует");
	ТаблицаОбъектовПереадресации.Колонки.Добавить("ЗарегистрироватьОшибку");
	
	МассивТекстСистемныеМетодыПереадресации = Новый Массив;
	МассивТекстСистемныеМетодыПереадресации.Добавить("СведенияОВнешнейОбработке");
	МассивТекстСистемныеМетодыПереадресации.Добавить("ТекущаяУниверсальнаяДатаВМиллисекундах");
	МассивТекстСистемныеМетодыПереадресации.Добавить("ОбъектМетаданныхОтчет.ПолноеИмя");
	
	Для Каждого ТекстСистемногоМетода Из МассивТекстСистемныеМетодыПереадресации Цикл
		
		СтрокаТаблицыОбъектовПереадресации = ТаблицаОбъектовПереадресации.Добавить();
		СтрокаТаблицыОбъектовПереадресации.ТипОбъектаПереадресации = "Функция";
		СтрокаТаблицыОбъектовПереадресации.ОбъектПереадресации = ТекстСистемногоМетода;
		СтрокаТаблицыОбъектовПереадресации.ОбъектПереадресацииВРег = ВРег(ТекстСистемногоМетода);
		СтрокаТаблицыОбъектовПереадресации.Существует = Ложь;
		СтрокаТаблицыОбъектовПереадресации.ЗарегистрироватьОшибку = Ложь;
		
	КонецЦикла;
	
	ТаблицаОбъектовПереадресации.ЗаполнитьЗначения(Неопределено, "МетодПереадресации");
	
	Возврат ТаблицаОбъектовПереадресации;
	
КонецФункции

// АПК:1297-выкл - не локализуется

Функция ИнициализироватьТаблицуТиповПараметров()
	
	ТаблицаТиповПараметров = ПолучитьТаблицуИзМакета("ТипыПараметров");
	ТаблицаТиповПараметров.Колонки.Добавить("ТипПараметраДляЗаменыВРег");
	
	МассивСтрокДляУдаления = Новый Массив;
	
	Для Каждого СтрокаТипаПараметра Из ТаблицаТиповПараметров Цикл
		Если ПустаяСтрока(СтрокаТипаПараметра.ТипПараметраДляПоиска) Тогда
			МассивСтрокДляУдаления.Добавить(СтрокаТипаПараметра);
			Продолжить;
		КонецЕсли;
		
		СтрокаТипаПараметра.ТипПараметраДляПоиска        = ВРег(СтрокаТипаПараметра.ТипПараметраДляПоиска);
		СтрокаТипаПараметра.ТипПараметраДляЗаменыВРег    = ВРег(СтрокаТипаПараметра.ТипПараметраДляЗамены);
		СтрокаТипаПараметра.ИспользоватьДляВыделенияТипа = Булево(СтрокаТипаПараметра.ИспользоватьДляВыделенияТипа);
		СтрокаТипаПараметра.ЗаменятьПриПолученииОписания = Булево(СтрокаТипаПараметра.ЗаменятьПриПолученииОписания);
		СтрокаТипаПараметра.ЗаменятьПриФорматировании    = Булево(СтрокаТипаПараметра.ЗаменятьПриФорматировании);
		СтрокаТипаПараметра.СоставнойТипПараметра        = Булево(СтрокаТипаПараметра.СоставнойТипПараметра);
	КонецЦикла;
	
	// Сортировка очень важна для последовательной замены типов при получении описания параметров.
	ТаблицаТиповПараметров.Сортировать("ТипПараметраДляПоиска Убыв");
	
	ТаблицаТиповПараметров.Индексы.Добавить("ТипПараметраДляПоиска");
	
	Возврат ТаблицаТиповПараметров;
	
КонецФункции

Функция ИнициализироватьТаблицуКонструкцийОбъектовПослеГиперссылокСм()
	
	ТаблицаКонструкцийОбъектовПослеГиперссылокСм = Новый ТаблицаЗначений;
	ТаблицаКонструкцийОбъектовПослеГиперссылокСм.Колонки.Добавить("ТекстКонструкции");
	ТаблицаКонструкцийОбъектовПослеГиперссылокСм.Колонки.Добавить("ПоложениеДобавленияОбъекта");
	ТаблицаКонструкцийОбъектовПослеГиперссылокСм.Колонки.Добавить("ДобавляемыйТипОбъекта");
	
	СтрокаКонструкцииОбъектаГиперссылки = ТаблицаКонструкцийОбъектовПослеГиперссылокСм.Добавить();
	СтрокаКонструкцииОбъектаГиперссылки.ТекстКонструкции = ВРег("общего модуля");
	СтрокаКонструкцииОбъектаГиперссылки.ПоложениеДобавленияОбъекта = "Начало";
	СтрокаКонструкцииОбъектаГиперссылки.ДобавляемыйТипОбъекта = "";
	
	СтрокаКонструкцииОбъектаГиперссылки = ТаблицаКонструкцийОбъектовПослеГиперссылокСм.Добавить();
	СтрокаКонструкцииОбъектаГиперссылки.ТекстКонструкции = ВРег("common module");
	СтрокаКонструкцииОбъектаГиперссылки.ПоложениеДобавленияОбъекта = "Конец";
	СтрокаКонструкцииОбъектаГиперссылки.ДобавляемыйТипОбъекта = "";
	
	СтрокаКонструкцииОбъектаГиперссылки = ТаблицаКонструкцийОбъектовПослеГиперссылокСм.Добавить();
	СтрокаКонструкцииОбъектаГиперссылки.ТекстКонструкции = ВРег(", параметр ");
	СтрокаКонструкцииОбъектаГиперссылки.ПоложениеДобавленияОбъекта = "Конец";
	СтрокаКонструкцииОбъектаГиперссылки.ДобавляемыйТипОбъекта = "";
	
	СтрокаКонструкцииОбъектаГиперссылки = ТаблицаКонструкцийОбъектовПослеГиперссылокСм.Добавить();
	СтрокаКонструкцииОбъектаГиперссылки.ТекстКонструкции = ВРег("parameter");
	СтрокаКонструкцииОбъектаГиперссылки.ПоложениеДобавленияОбъекта = "Начало";
	СтрокаКонструкцииОбъектаГиперссылки.ДобавляемыйТипОбъекта = "";
	
	СтрокаКонструкцииОбъектаГиперссылки = ТаблицаКонструкцийОбъектовПослеГиперссылокСм.Добавить();
	СтрокаКонструкцииОбъектаГиперссылки.ТекстКонструкции = ВРег("в модуле менеджера регистра");
	СтрокаКонструкцииОбъектаГиперссылки.ПоложениеДобавленияОбъекта = "Начало";
	СтрокаКонструкцииОбъектаГиперссылки.ДобавляемыйТипОбъекта = "РегистрСведений";
	
	Возврат ТаблицаКонструкцийОбъектовПослеГиперссылокСм;
	
КонецФункции

Процедура ДобавитьПозициюОписанияПараметра(ТаблицаПозицийОписанияПараметра, НаименованиеПозиции, Позиция = 0,
	ЗаменятьТабыДоПозиции = Ложь)
	
	СтрокаПозицииОписанияПараметра = ТаблицаПозицийОписанияПараметра.Добавить();
	СтрокаПозицииОписанияПараметра.НаименованиеПозиции = НаименованиеПозиции;
	СтрокаПозицииОписанияПараметра.Позиция = Позиция;
	СтрокаПозицииОписанияПараметра.ЗаменятьТабыДоПозиции = ЗаменятьТабыДоПозиции;
	
КонецПроцедуры

Функция ИнициализироватьТаблицуПозицийОписанияПараметра(ЗаменятьДоПозицииТипаПараметра = Ложь)
	
	ТаблицаПозицийОписанияПараметра = Новый ТаблицаЗначений;
	ТаблицаПозицийОписанияПараметра.Колонки.Добавить("НаименованиеПозиции");
	ТаблицаПозицийОписанияПараметра.Колонки.Добавить("Позиция");
	ТаблицаПозицийОписанияПараметра.Колонки.Добавить("ЗаменятьТабыДоПозиции");
	
	ДобавитьПозициюОписанияПараметра(ТаблицаПозицийОписанияПараметра, "ПозицияИмениПараметра",, Истина);
	ДобавитьПозициюОписанияПараметра(ТаблицаПозицийОписанияПараметра, "ПозицияРазделителяПередТипомПараметра");
	ДобавитьПозициюОписанияПараметра(ТаблицаПозицийОписанияПараметра, "ПозицияТипаПараметра");
	ДобавитьПозициюОписанияПараметра(ТаблицаПозицийОписанияПараметра, "ПозицияРазделителяПередТекстовымОписаниемПараметра");
	ДобавитьПозициюОписанияПараметра(ТаблицаПозицийОписанияПараметра, "ПозицияТекстовогоОписанияПараметра");
	
	Возврат ТаблицаПозицийОписанияПараметра;
	
КонецФункции

Процедура ЗаполнитьКонтекст()
	
	ТаблицаКлючевыхСлов = ПолучитьТаблицуЭталоновКлючевыхСлов();
	ВыражениеПоискаКлючевыхСлов = ПолучитьВыражениеПоискаКлючевыхСлов(ТаблицаКлючевыхСлов);
	
	Контекст.Вставить("ТекущийОбрабатываемыйФайл", "");
	Контекст.Вставить("ТекущийОбрабатываемыйМетод");
	Контекст.Вставить("ТаблицаКлючевыхСлов", ТаблицаКлючевыхСлов);
	Контекст.Вставить("ВыражениеПоискаКлючевыхСлов", ВыражениеПоискаКлючевыхСлов);
	Контекст.Вставить("МассивКлючевыхСловЗапроса", ПолучитьМассивКлючевыхСловЗапроса());
	Контекст.Вставить("ТаблицаКлючевыхСловЗапроса", ПолучитьТаблицуЭталоновКлючевыхСловЗапроса());
	Контекст.Вставить("МассивИсключенийСловЗапроса", ПолучитьМассивИсключенийСловЗапроса());
	Контекст.Вставить("МассивСлужебныхТегов", ПолучитьМассивСлужебныхТегов());
	Контекст.Вставить("ТаблицаСтандартов", ПолучитьТаблицуСтандартовИзМакета());
	Контекст.Вставить("ТаблицаПустыхТегов", ПолучитьТаблицуПустыхТегов());
	Контекст.Вставить("ПолучитьТаблицуПроцедурИФункций", Новый Соответствие);
	Контекст.Вставить("ПолучитьПервоеСловоИзСтроки", Новый Соответствие);
	Контекст.Вставить("ПреобразоватьТекстДляСравнения", Новый Соответствие);
	Контекст.Вставить("СтрокаСодержитИмяПараметра", Новый Соответствие);
	Контекст.Вставить("ТаблицаТиповОбъектовДляДереваКонфигурации");
	Контекст.Вставить("ТаблицаОбъектовИПодсистем");
	
	МассивТиповОбъектовБезМодулей = Новый Массив;
	МассивТиповОбъектовБезМодулей.Добавить("ОпределяемыйТип");
	МассивТиповОбъектовБезМодулей.Добавить("ОбщийРеквизит");
	МассивТиповОбъектовБезМодулей.Добавить("Реквизит");
	МассивТиповОбъектовБезМодулей.Добавить("WSСсылка");
	МассивТиповОбъектовБезМодулей.Добавить("Графа");
	МассивТиповОбъектовБезМодулей.Добавить("Значение");
	МассивТиповОбъектовБезМодулей.Добавить("Измерение");
	МассивТиповОбъектовБезМодулей.Добавить("Интерфейс");
	МассивТиповОбъектовБезМодулей.Добавить("Картинка");
	МассивТиповОбъектовБезМодулей.Добавить("Макет");
	МассивТиповОбъектовБезМодулей.Добавить("ОбщийМакет");
	МассивТиповОбъектовБезМодулей.Добавить("ПакетXDTO");
	МассивТиповОбъектовБезМодулей.Добавить("ПараметрСеанса");
	МассивТиповОбъектовБезМодулей.Добавить("ПодпискаНаСобытия");
	МассивТиповОбъектовБезМодулей.Добавить("Подсистема");
	МассивТиповОбъектовБезМодулей.Добавить("РегламентноеЗадание");
	МассивТиповОбъектовБезМодулей.Добавить("СтандартныйРеквизит");
	МассивТиповОбъектовБезМодулей.Добавить("Ресурс");
	МассивТиповОбъектовБезМодулей.Добавить("Роль");
	МассивТиповОбъектовБезМодулей.Добавить("Стиль");
	МассивТиповОбъектовБезМодулей.Добавить("ТабличнаяЧасть");
	МассивТиповОбъектовБезМодулей.Добавить("СтандартнаяТабличнаяЧасть");
	МассивТиповОбъектовБезМодулей.Добавить("ЭлементСтиля");
	МассивТиповОбъектовБезМодулей.Добавить("Язык");
	МассивТиповОбъектовБезМодулей.Добавить("ФункциональнаяОпция");
	МассивТиповОбъектовБезМодулей.Добавить("ГруппаКоманд");
	МассивТиповОбъектовБезМодулей.Добавить("ПараметрФункциональнойОпции");
	МассивТиповОбъектовБезМодулей.Добавить("Предопределенный");
	МассивТиповОбъектовБезМодулей.Добавить("ПредопределенныйЭлемент");
	МассивТиповОбъектовБезМодулей.Добавить("Операция");
	МассивТиповОбъектовБезМодулей.Добавить("Параметр");
	МассивТиповОбъектовБезМодулей.Добавить("ШаблонURL");
	МассивТиповОбъектовБезМодулей.Добавить("МетодШаблонаURL");
	Контекст.Вставить("МассивТиповОбъектовБезМодулей", МассивТиповОбъектовБезМодулей);
	
	МассивТиповОбъектовСодержащихДанные = Новый Массив;
	МассивТиповОбъектовСодержащихДанные.Добавить(ВРег("BusinessProcess"));
	МассивТиповОбъектовСодержащихДанные.Добавить(ВРег("Document"));
	МассивТиповОбъектовСодержащихДанные.Добавить(ВРег("Task"));
	МассивТиповОбъектовСодержащихДанные.Добавить(ВРег("Constant"));
	МассивТиповОбъектовСодержащихДанные.Добавить(ВРег("ChartOfCalculationTypes"));
	МассивТиповОбъектовСодержащихДанные.Добавить(ВРег("ChartOfCharacteristicTypes"));
	МассивТиповОбъектовСодержащихДанные.Добавить(ВРег("ExchangePlan"));
	МассивТиповОбъектовСодержащихДанные.Добавить(ВРег("ChartOfAccounts"));
	МассивТиповОбъектовСодержащихДанные.Добавить(ВРег("AccountingRegister"));
	МассивТиповОбъектовСодержащихДанные.Добавить(ВРег("AccumulationRegister"));
	МассивТиповОбъектовСодержащихДанные.Добавить(ВРег("CalculationRegister"));
	МассивТиповОбъектовСодержащихДанные.Добавить(ВРег("InformationRegister"));
	МассивТиповОбъектовСодержащихДанные.Добавить(ВРег("Catalog"));
	Контекст.Вставить("МассивТиповОбъектовСодержащихДанные", МассивТиповОбъектовСодержащихДанные);
	
	МассивТекстПроцедураФункция = Новый Массив;
	МассивТекстПроцедураФункция.Добавить(ВРег("Процедура"));
	МассивТекстПроцедураФункция.Добавить(ВРег("Функция"));
	МассивТекстПроцедураФункция.Добавить(ВРег("Procedure"));
	МассивТекстПроцедураФункция.Добавить(ВРег("Function"));
	Контекст.Вставить("МассивТекстПроцедураФункция", МассивТекстПроцедураФункция);
	
	МассивТекстКонецПроцедурыФункции = Новый Массив;
	МассивТекстКонецПроцедурыФункции.Добавить(ВРег("КонецПроцедуры"));
	МассивТекстКонецПроцедурыФункции.Добавить(ВРег("КонецФункции"));
	МассивТекстКонецПроцедурыФункции.Добавить(ВРег("EndProcedure"));
	МассивТекстКонецПроцедурыФункции.Добавить(ВРег("EndFunction"));
	Контекст.Вставить("МассивТекстКонецПроцедурыФункции", МассивТекстКонецПроцедурыФункции);
	
	МассивТекстОбласть = Новый Массив;
	МассивТекстОбласть.Добавить(ВРег("#Область"));
	МассивТекстОбласть.Добавить(ВРег("#Region"));
	Контекст.Вставить("МассивТекстОбласть", МассивТекстОбласть);
	
	МассивТекстКонецОбласти = Новый Массив;
	МассивТекстКонецОбласти.Добавить(ВРег("#КонецОбласти"));
	МассивТекстКонецОбласти.Добавить(ВРег("#EndRegion"));
	Контекст.Вставить("МассивТекстКонецОбласти", МассивТекстКонецОбласти);
	
	МассивТекстЭкспорт = Новый Массив;
	МассивТекстЭкспорт.Добавить(ВРег("Экспорт"));
	МассивТекстЭкспорт.Добавить(ВРег("Export"));
	Контекст.Вставить("МассивТекстЭкспорт", МассивТекстЭкспорт);
	
	МассивТекстЕсли = Новый Массив;
	МассивТекстЕсли.Добавить(ВРег("#Если"));
	МассивТекстЕсли.Добавить(ВРег("#If"));
	Контекст.Вставить("МассивТекстЕсли", МассивТекстЕсли);
	
	МассивТекстИначе = Новый Массив;
	МассивТекстИначе.Добавить(ВРег("#Иначе"));
	МассивТекстИначе.Добавить(ВРег("#Else"));
	Контекст.Вставить("МассивТекстИначе", МассивТекстИначе);
	
	МассивТекстКонецЕсли = Новый Массив;
	МассивТекстКонецЕсли.Добавить(ВРег("#КонецЕсли"));
	МассивТекстКонецЕсли.Добавить(ВРег("#EndIf"));
	Контекст.Вставить("МассивТекстКонецЕсли", МассивТекстКонецЕсли);
	
	МассивТекстОбъектСТочкой = Новый Массив;
	МассивТекстОбъектСТочкой.Добавить("Объект.");
	МассивТекстОбъектСТочкой.Добавить("Object.");
	Контекст.Вставить("МассивТекстОбъектСТочкой", МассивТекстОбъектСТочкой);
	
	ТекстОбласть = ВРег(НСтр("ru='#Область '; en='#Region '", КодОсновногоЯзыка));
	Контекст.Вставить("ТекстОбласть", ТекстОбласть);
	
	ТекстКонецОбласти = НСтр("ru='#КонецОбласти '; en='#EndRegion '", КодОсновногоЯзыка);
	Контекст.Вставить("ТекстКонецОбласти", ТекстКонецОбласти);
	
	ОбластьОписаниеПеременных = НСтр("ru='#Область ОписаниеПеременных'; en='#Region Variables'", КодОсновногоЯзыка);
	Контекст.Вставить("ОбластьОписаниеПеременных", ОбластьОписаниеПеременных);
	
	ОбластьИнициализация = НСтр("ru='#Область Инициализация'; en='#Region Initialization'", КодОсновногоЯзыка);
	Контекст.Вставить("ОбластьИнициализация", ОбластьИнициализация);
	
	ТекстПерем = ВРег(НСтр("ru='Перем '; en='Var '", КодОсновногоЯзыка));
	Контекст.Вставить("ТекстПерем", ТекстПерем);
	
	ТекстВозврат   = ВРег(НСтр("ru='Возврат'; en='Return'", КодОсновногоЯзыка));
	Контекст.Вставить("ТекстВозврат", ТекстВозврат);
	
	ТекстКонецЕсли = ВРег(НСтр("ru='КонецЕсли'; en='EndIf'", КодОсновногоЯзыка));
	Контекст.Вставить("ТекстКонецЕсли", ТекстКонецЕсли);
	
	ТекстАвтоТест  = ВРег(НСтр("ru='АвтоТест'; en='AutoTest'", КодОсновногоЯзыка));
	Контекст.Вставить("ТекстАвтоТест", ТекстАвтоТест);
	
	ТекстГруппа = НСтр("ru='Группа'; en='Group'", КодОсновногоЯзыка);
	Контекст.Вставить("ТекстГруппа", ТекстГруппа);
	
	ТекстВозвращаемоеЗначение = ВРег("//ВозвращаемоеЗначение");
	Контекст.Вставить("ТекстВозвращаемоеЗначение", ТекстВозвращаемоеЗначение);
	
	ТекстReturns = ВРег("//Returns");
	
	МассивТекстВозвращаемоеЗначение = Новый Массив;
	МассивТекстВозвращаемоеЗначение.Добавить(ТекстВозвращаемоеЗначение);
	МассивТекстВозвращаемоеЗначение.Добавить(ТекстReturns);
	Контекст.Вставить("МассивТекстВозвращаемоеЗначение", МассивТекстВозвращаемоеЗначение);
	
	ТекстПараметры = ВРег("//Параметры:");
	ТекстParameters = ВРег("//Parameters:");
	
	МассивТекстПараметры = Новый Массив;
	МассивТекстПараметры.Добавить(ТекстПараметры);
	МассивТекстПараметры.Добавить(ТекстParameters);
	Контекст.Вставить("МассивТекстПараметры", МассивТекстПараметры);
	
	МассивТекстПараметрыВозвращаемоеЗначение = Новый Массив;
	ДополнитьМассив(МассивТекстПараметрыВозвращаемоеЗначение, МассивТекстПараметры);
	ДополнитьМассив(МассивТекстПараметрыВозвращаемоеЗначение, МассивТекстВозвращаемоеЗначение);
	Контекст.Вставить("МассивТекстПараметрыВозвращаемоеЗначение", МассивТекстПараметрыВозвращаемоеЗначение);
	
	МассивТекстОкончанияСекцииОписанияПараметров = Новый Массив;
	МассивТекстОкончанияСекцииОписанияПараметров.Добавить(ВРег("//Пример:"));   // секция "Пример:"
	МассивТекстОкончанияСекцииОписанияПараметров.Добавить(ВРег("//Пример("));   // секция "Пример (1):"
	МассивТекстОкончанияСекцииОписанияПараметров.Добавить(ВРег("//ПримерРеализации:"));
	МассивТекстОкончанияСекцииОписанияПараметров.Добавить(ВРег("//@"));         // аннотации-комментарии "@skip-warning"
	МассивТекстОкончанияСекцииОписанияПараметров.Добавить(ВРег("//&На"));       // директива компиляции "&НаКлиенте"
	МассивТекстОкончанияСекцииОписанияПараметров.Добавить(ВРег("//Example:"));   // секция "Пример:"
	МассивТекстОкончанияСекцииОписанияПараметров.Добавить(ВРег("//&At"));       // директива компиляции "&НаКлиенте"
	Контекст.Вставить("МассивТекстОкончанияСекцииОписанияПараметров", МассивТекстОкончанияСекцииОписанияПараметров);
	
	МассивСлужебныхКомментариев = Новый Массив;
	МассивСлужебныхКомментариев.Добавить("//@");
	МассивСлужебныхКомментариев.Добавить("//АПК:");
	МассивСлужебныхКомментариев.Добавить("//ACC:");
	Контекст.Вставить("МассивСлужебныхКомментариев", МассивСлужебныхКомментариев);
	
	МассивТекстСм = Новый Массив;
	МассивТекстСм.Добавить(ВРег("См. "));
	МассивТекстСм.Добавить(ВРег("see "));
	МассивТекстСм.Добавить(ВРег("См."));
	МассивТекстСм.Добавить(ВРег("См "));
	МассивТекстСм.Добавить(ВРег("see"));
	Контекст.Вставить("МассивТекстСм", МассивТекстСм);
	
	МассивТекстМассив = Новый Массив;
	МассивТекстМассив.Добавить(ВРег("Массив"));
	МассивТекстМассив.Добавить(ВРег("Array"));
	Контекст.Вставить("МассивТекстМассив", МассивТекстМассив);
	
	МассивТекстФиксированныйМассив = Новый Массив;
	МассивТекстФиксированныйМассив.Добавить(ВРег("ФиксированныйМассив"));
	МассивТекстФиксированныйМассив.Добавить(ВРег("FixedArray"));
	Контекст.Вставить("МассивТекстФиксированныйМассив", МассивТекстФиксированныйМассив);
	
	МассивТекстМассивИз = Новый Массив;
	МассивТекстМассивИз.Добавить(ВРег("Массив из "));
	МассивТекстМассивИз.Добавить(ВРег("Array of "));
	Контекст.Вставить("МассивТекстМассивИз", МассивТекстМассивИз);
	
	МассивТекстФиксированныйМассивИз = Новый Массив;
	МассивТекстФиксированныйМассивИз.Добавить(ВРег("ФиксированныйМассив из "));
	МассивТекстФиксированныйМассивИз.Добавить(ВРег("FixedArray of "));
	Контекст.Вставить("МассивТекстФиксированныйМассивИз", МассивТекстФиксированныйМассивИз);
	
	ТекстМассивИзСм = НСтр("ru='Массив из см. '; en='Array of See '", КодОсновногоЯзыка);
	Контекст.Вставить("ТекстМассивИзСм", ТекстМассивИзСм);
	
	МассивТекстМассивИзСм = Новый Массив;
	МассивТекстМассивИзСм.Добавить(ВРег(ТекстМассивИзСм));
	Контекст.Вставить("МассивТекстМассивИзСм", МассивТекстМассивИзСм);
	
	ТекстФиксированныйМассивИзСм = НСтр("ru='ФиксированныйМассив из см. '; en='FixedArray of See '", КодОсновногоЯзыка);
	Контекст.Вставить("ТекстФиксированныйМассивИзСм", ТекстФиксированныйМассивИзСм);
	
	МассивТекстФиксированныйМассивИзСм = Новый Массив;
	МассивТекстФиксированныйМассивИзСм.Добавить(ВРег(ТекстФиксированныйМассивИзСм));
	МассивТекстФиксированныйМассивИзСм.Добавить(ВРег("FixedArray of See "));
	Контекст.Вставить("МассивТекстФиксированныйМассивИзСм", МассивТекстФиксированныйМассивИзСм);
	
	МассивТекстМассивИзСтрокаТаблицыЗначений = Новый Массив;
	МассивТекстМассивИзСтрокаТаблицыЗначений.Добавить("Массив из СтрокаТаблицыЗначений");
	МассивТекстМассивИзСтрокаТаблицыЗначений.Добавить("Массив из СтрокаДереваЗначений");
	МассивТекстМассивИзСтрокаТаблицыЗначений.Добавить("ФиксированныйМассив из СтрокаТаблицыЗначений");
	МассивТекстМассивИзСтрокаТаблицыЗначений.Добавить("ФиксированныйМассив из СтрокаДереваЗначений");
	Контекст.Вставить("МассивТекстМассивИзСтрокаТаблицыЗначений", МассивТекстМассивИзСтрокаТаблицыЗначений);
	Контекст.Вставить("МассивТекстМассивИзСтрокаТаблицыЗначенийВРег", МассивВВерхнемРегистре(МассивТекстМассивИзСтрокаТаблицыЗначений));
	
	СписокТекстСоответствие = Новый СписокЗначений;
	СписокТекстСоответствие.Добавить(ВРег("Соответствие"), "Соответствие из КлючИЗначение");
	СписокТекстСоответствие.Добавить(ВРег("ФиксированноеСоответствие"), "ФиксированноеСоответствие из КлючИЗначение");
	СписокТекстСоответствие.Добавить(ВРег("Map"), "Map of KeyAndValue");
	СписокТекстСоответствие.Добавить(ВРег("FixedMap"), "FixedMap of KeyAndValue");
	Контекст.Вставить("СписокТекстСоответствие", СписокТекстСоответствие);
	
	ТекстКлюч = НСтр("ru='Ключ'; en='Key'", КодОсновногоЯзыка);
	Контекст.Вставить("ТекстКлюч", ТекстКлюч);
	
	МассивТекстКлюч = Новый Массив;
	МассивТекстКлюч.Добавить(ВРег("Ключа"));
	МассивТекстКлюч.Добавить(ВРег("Ключу"));
	МассивТекстКлюч.Добавить(ВРег("Ключом"));
	МассивТекстКлюч.Добавить(ВРег("Ключе"));
	МассивТекстКлюч.Добавить(ВРег(ТекстКлюч));
	Контекст.Вставить("МассивТекстКлюч", МассивТекстКлюч);
	
	ТекстЗначение = НСтр("ru='Значение'; en='Value'", КодОсновногоЯзыка);
	Контекст.Вставить("ТекстЗначение", ТекстЗначение);
	
	МассивТекстЗначение = Новый Массив;
	МассивТекстЗначение.Добавить(ВРег("Значения"));
	МассивТекстЗначение.Добавить(ВРег("Значению"));
	МассивТекстЗначение.Добавить(ВРег("Значением"));
	МассивТекстЗначение.Добавить(ВРег("Значении"));
	МассивТекстЗначение.Добавить(ВРег(ТекстЗначение));
	Контекст.Вставить("МассивТекстЗначение", МассивТекстЗначение);
	
	МассивТекстОбязательныйНеобязательный = Новый Массив;
	МассивТекстОбязательныйНеобязательный.Добавить(ВРег("(необязательный)"));
	МассивТекстОбязательныйНеобязательный.Добавить(ВРег("необязательный параметр"));
	МассивТекстОбязательныйНеобязательный.Добавить(ВРег("необязательный"));
	МассивТекстОбязательныйНеобязательный.Добавить(ВРег("(обязательный)"));
	МассивТекстОбязательныйНеобязательный.Добавить(ВРег("обязательный параметр"));
	МассивТекстОбязательныйНеобязательный.Добавить(ВРег("обязательный"));
	МассивТекстОбязательныйНеобязательный.Добавить(ВРег("(optional)"));
	МассивТекстОбязательныйНеобязательный.Добавить(ВРег("optional parameter"));
	МассивТекстОбязательныйНеобязательный.Добавить(ВРег("(optional parameter)"));
	МассивТекстОбязательныйНеобязательный.Добавить(ВРег("optional:"));
	МассивТекстОбязательныйНеобязательный.Добавить(ВРег("(mandatory)"));
	МассивТекстОбязательныйНеобязательный.Добавить(ВРег("(required)"));
	Контекст.Вставить("МассивТекстОбязательныйНеобязательный", МассивТекстОбязательныйНеобязательный);
	
	МассивТекстИсключенийОбязательный = Новый Массив;
	МассивТекстИсключенийОбязательный.Добавить(ВРег("Параметр обязательный"));
	МассивТекстИсключенийОбязательный.Добавить(ВРег("optional if"));
	МассивТекстИсключенийОбязательный.Добавить(ВРег("optional, except"));
	МассивТекстИсключенийОбязательный.Добавить(ВРег("is optional"));
	МассивТекстИсключенийОбязательный.Добавить(ВРег("an optional"));
	МассивТекстИсключенийОбязательный.Добавить(ВРег("of optional"));
	МассивТекстИсключенийОбязательный.Добавить(ВРег("is mandatory"));
	Контекст.Вставить("МассивТекстИсключенийОбязательный", МассивТекстИсключенийОбязательный);
	
	МассивТекстГиперссылокСм = Новый Массив;
	МассивТекстГиперссылокСм.Добавить(ВРег(ТекстМассивИзСм));
	МассивТекстГиперссылокСм.Добавить(ВРег("см. комментарий к функции "));
	МассивТекстГиперссылокСм.Добавить(ВРег("см. описание возвращаемого значения функции "));
	МассивТекстГиперссылокСм.Добавить(ВРег("см. возвращаемое значение функции "));
	МассивТекстГиперссылокСм.Добавить(ВРег("см. возвращаемое значение "));
	МассивТекстГиперссылокСм.Добавить(ВРег("см. значение "));
	//МассивТекстГиперссылокСм.Добавить(ВРег("см. подробнее ")); // пока не включаем слово "подробнее", т.к. приводит к ложным удалениям. // АПК:246
	//МассивТекстГиперссылокСм.Добавить(ВРег("см.подробнее "));  // АПК:246
	МассивТекстГиперссылокСм.Добавить(ВРег("см. процедуру "));
	МассивТекстГиперссылокСм.Добавить(ВРег("см. функцию "));
	МассивТекстГиперссылокСм.Добавить(ВРег("см. описание функции "));
	МассивТекстГиперссылокСм.Добавить(ВРег("см. описание "));
	МассивТекстГиперссылокСм.Добавить(ВРег("см. метод "));
	МассивТекстГиперссылокСм.Добавить(ВРег("см. модуль "));
	МассивТекстГиперссылокСм.Добавить(ВРег("см. объект "));
	МассивТекстГиперссылокСм.Добавить(ВРег("см. тип "));
	МассивТекстГиперссылокСм.Добавить(ВРег("см. в "));
	МассивТекстГиперссылокСм.Добавить(ВРег("см. ")); // нужна длина найденного текста гиперссылки, поэтому вариант "см. " с точкой - последний.
	МассивТекстГиперссылокСм.Добавить(ВРег("см функцию "));
	МассивТекстГиперссылокСм.Добавить(ВРег("см "));
	МассивТекстГиперссылокСм.Добавить(ВРег("see "));
	МассивТекстГиперссылокСм.Добавить(ВРег("see details in "));
	МассивТекстГиперссылокСм.Добавить(ВРег("see also "));
	МассивТекстГиперссылокСм.Добавить(ВРег("see also:"));
	МассивТекстГиперссылокСм.Добавить(ВРег("see also the "));
	МассивТекстГиперссылокСм.Добавить(ВРег("see the procedure details in the "));
	МассивТекстГиперссылокСм.Добавить(ВРег("see details of the same procedure in the "));
	ДополнитьМассив(МассивТекстГиперссылокСм, МассивТекстФиксированныйМассивИзСм);
	Контекст.Вставить("МассивТекстГиперссылокСм", МассивТекстГиперссылокСм);
	
	МассивТекстИсключенийГиперссылокСм = Новый Массив;
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("Допустимые значения - см. "));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("описание полей см. "));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("Описание колонок см. "));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("Описание колонок таблицы см. "));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("подробнее см. функцию "));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег(", подробнее см. "));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("содержит значения типа см. "));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("иначе см. "));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("в синтакс-помощнике"));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("состав см. "));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("Состав свойств см. "));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("установлено свойство"));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("описание параметра"));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("см. возвращаемое значение."));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("см. комментарий к процедуре "));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("см. описание к функции глобального контекста "));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("см. описание поля "));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("см. Синтакс-помощник"));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("см. параметр "));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("см. пример "));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("see the "));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("see above"));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("in Syntax Assistant"));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("For valid values, see "));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("See column details in "));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("See column content in "));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("See details in "));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("Otherwise, see "));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("For content, see "));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("See comment to the "));
	МассивТекстИсключенийГиперссылокСм.Добавить(ВРег("See description in the "));
	Контекст.Вставить("МассивТекстИсключенийГиперссылокСм", МассивТекстИсключенийГиперссылокСм);
	
	// Инициализируем список значений для исключения параметров при установке гиперссылки "см." в текстовое описание:
	// Значение - тип параметра,
	// Представление - конструкция в текстовом описании.
	// Если параметр указанного в значении типа содержит текст из представления, то гиперссылка "см." установлена не будет.
	СписокТекстИсключенийТиповИОписанийПараметровДляУстановкиГиперссылкиСм = Новый СписокЗначений;
	СписокТекстИсключенийТиповИОписанийПараметровДляУстановкиГиперссылкиСм.Добавить(ВРег("Булево"), ВРег("если Истина"));
	СписокТекстИсключенийТиповИОписанийПараметровДляУстановкиГиперссылкиСм.Добавить(ВРег("Boolean"), ВРег("if True"));
	Контекст.Вставить("СписокТекстИсключенийТиповИОписанийПараметровДляУстановкиГиперссылкиСм", СписокТекстИсключенийТиповИОписанийПараметровДляУстановкиГиперссылкиСм);
	
	// В массиве перечисляем типы параметров, которые не надо удалять при установке гиперссылки "см.".
	МассивСохраняемыхТиповПараметровПриУстановкеГиперссылкиСм = Новый Массив;
	МассивСохраняемыхТиповПараметровПриУстановкеГиперссылкиСм.Добавить(ВРег("СтрокаТаблицыЗначений"));
	МассивСохраняемыхТиповПараметровПриУстановкеГиперссылкиСм.Добавить(ВРег("СтрокаДереваЗначений"));
	МассивСохраняемыхТиповПараметровПриУстановкеГиперссылкиСм.Добавить(ВРег("ValueTableRow"));
	МассивСохраняемыхТиповПараметровПриУстановкеГиперссылкиСм.Добавить(ВРег("ValueTreeRow"));
	Контекст.Вставить("МассивСохраняемыхТиповПараметровПриУстановкеГиперссылкиСм", МассивСохраняемыхТиповПараметровПриУстановкеГиперссылкиСм);
	
	// В массиве перечисляем типы параметров, которые не надо удалять при установке гиперссылки "см.".
	МассивТиповПараметровДляКоторыхДопустимРазделительДвоеточие = Новый Массив;
	МассивТиповПараметровДляКоторыхДопустимРазделительДвоеточие.Добавить(ВРег("СтрокаТаблицыЗначений:"));
	МассивТиповПараметровДляКоторыхДопустимРазделительДвоеточие.Добавить(ВРег("СтрокаДереваЗначений:"));
	МассивТиповПараметровДляКоторыхДопустимРазделительДвоеточие.Добавить(ВРег("ValueTableRow:"));
	МассивТиповПараметровДляКоторыхДопустимРазделительДвоеточие.Добавить(ВРег("ValueTreeRow:"));
	Контекст.Вставить("МассивТиповПараметровДляКоторыхДопустимРазделительДвоеточие", МассивТиповПараметровДляКоторыхДопустимРазделительДвоеточие);
	
	ТекстОбщийМодуль = НСтр("ru='ОбщийМодуль'; en='CommonModule'", КодОсновногоЯзыка);
	Контекст.Вставить("ТекстОбщийМодуль", ТекстОбщийМодуль);
	
	МассивТекстОбщийМодуль = Новый Массив;
	МассивТекстОбщийМодуль.Добавить(ВРег("ОбщийМодуль"));
	МассивТекстОбщийМодуль.Добавить(ВРег("CommonModule"));
	Контекст.Вставить("МассивТекстОбщийМодуль", МассивТекстОбщийМодуль);
	
	ТаблицаКонструкцийОбъектовПослеГиперссылокСм = ИнициализироватьТаблицуКонструкцийОбъектовПослеГиперссылокСм();
	Контекст.Вставить("ТаблицаКонструкцийОбъектовПослеГиперссылокСм", ТаблицаКонструкцийОбъектовПослеГиперссылокСм);
	
	// Сформируем таблицу всех возможных типов параметров.
	ТаблицаТиповПараметров = ИнициализироватьТаблицуТиповПараметров();
	Контекст.Вставить("ТаблицаТиповПараметров", ТаблицаТиповПараметров);
	
	СтруктураОтбораИспользоватьДляВыделенияТипа = Новый Структура;
	СтруктураОтбораИспользоватьДляВыделенияТипа.Вставить("ИспользоватьДляВыделенияТипа", Истина);
	ТаблицаТиповПараметровДляВыделенияТипа = ТаблицаТиповПараметров.Скопировать(СтруктураОтбораИспользоватьДляВыделенияТипа, "ТипПараметраДляПоиска");
	МассивТиповПараметровДляВыделенияТипа = ТаблицаТиповПараметровДляВыделенияТипа.ВыгрузитьКолонку("ТипПараметраДляПоиска");
	Контекст.Вставить("МассивТиповПараметровДляВыделенияТипа", МассивТиповПараметровДляВыделенияТипа);
	
	СтруктураОтбораСоставнойТипПараметра = Новый Структура;
	СтруктураОтбораСоставнойТипПараметра.Вставить("СоставнойТипПараметра", Истина);
	ТаблицаСоставныхТиповПараметров = ТаблицаТиповПараметров.Скопировать(СтруктураОтбораСоставнойТипПараметра, "ТипПараметраДляПоиска");
	МассивСоставныхТиповПараметров = ТаблицаСоставныхТиповПараметров.ВыгрузитьКолонку("ТипПараметраДляПоиска");
	Контекст.Вставить("МассивСоставныхТиповПараметров", ПреобразоватьМассивДляСравнения(МассивСоставныхТиповПараметров));
	
	// Сформируем таблицу типов параметров,
	// с помощью которой будем заменять типы параметров с пробелом при получении описания параметра.
	СтруктураОтбораЗаменятьПриПолученииОписания = Новый Структура;
	СтруктураОтбораЗаменятьПриПолученииОписания.Вставить("ЗаменятьПриПолученииОписания", Истина);
	ТаблицаТиповПараметровДляПолученияОписания = ТаблицаТиповПараметров.Скопировать(СтруктураОтбораЗаменятьПриПолученииОписания);
	Контекст.Вставить("ТаблицаТиповПараметровДляПолученияОписания", ТаблицаТиповПараметровДляПолученияОписания);
	
	// Сформируем таблицу типов параметров, с помощью которой будем исправлять неправильное написание типов параметров.
	СтруктураОтбораЗаменятьПриФорматировании = Новый Структура;
	СтруктураОтбораЗаменятьПриФорматировании.Вставить("ЗаменятьПриФорматировании", Истина);
	ТаблицаТиповПараметровДляФорматирования = ТаблицаТиповПараметров.Скопировать(СтруктураОтбораЗаменятьПриФорматировании);
	Контекст.Вставить("ТаблицаТиповПараметровДляФорматирования", ТаблицаТиповПараметровДляФорматирования);
	
	СтруктураОтбораЗаменятьПриФорматировании.Вставить("ПоложениеПриЗамене", "Равно");
	ТаблицаТиповПараметровДляФорматированияПоложениеРавно = ТаблицаТиповПараметровДляФорматирования.Скопировать(СтруктураОтбораЗаменятьПриФорматировании);
	ТаблицаТиповПараметровДляФорматированияПоложениеРавно.Индексы.Добавить("ТипПараметраДляПоиска");
	Контекст.Вставить("ТаблицаТиповПараметровДляФорматированияПоложениеРавно", ТаблицаТиповПараметровДляФорматированияПоложениеРавно);
	
	СтруктураОтбораЗаменятьПриФорматировании.Вставить("ПоложениеПриЗамене", "Начало");
	ТаблицаТиповПараметровДляФорматированияПоложениеНачало = ТаблицаТиповПараметровДляФорматирования.Скопировать(СтруктураОтбораЗаменятьПриФорматировании);
	Контекст.Вставить("ТаблицаТиповПараметровДляФорматированияПоложениеНачало", ТаблицаТиповПараметровДляФорматированияПоложениеНачало);
	
	СтруктураОтбораЗаменятьПриФорматировании.Вставить("ПоложениеПриЗамене", "Конец");
	ТаблицаТиповПараметровДляФорматированияПоложениеКонец = ТаблицаТиповПараметровДляФорматирования.Скопировать(СтруктураОтбораЗаменятьПриФорматировании);
	Контекст.Вставить("ТаблицаТиповПараметровДляФорматированияПоложениеКонец", ТаблицаТиповПараметровДляФорматированияПоложениеКонец);
	
	// Сформируем массив типов для проверки, содержащий элементы, которые могут быть как именем параметра, так и его типом.
	МассивТиповПараметровДляПроверки = Новый Массив;
	МассивТиповПараметровДляПроверки.Добавить(ВРег("Ссылка"));
	МассивТиповПараметровДляПроверки.Добавить(ВРег("Таблица"));
	МассивТиповПараметровДляПроверки.Добавить(ВРег("Ref"));
	МассивТиповПараметровДляПроверки.Добавить(ВРег("Table"));
	Контекст.Вставить("МассивТиповПараметровДляПроверки", МассивТиповПараметровДляПроверки);
	
	МассивИсключенийИменПараметров = Новый Массив;
	МассивИсключенийИменПараметров.Добавить(ВРег("Если Истина"));
	МассивИсключенийИменПараметров.Добавить(ВРег("Если Ложь"));
	МассивИсключенийИменПараметров.Добавить(ВРег("Значение по умолчанию"));
	МассивИсключенийИменПараметров.Добавить(ВРег("If True"));
	МассивИсключенийИменПараметров.Добавить(ВРег("If Falce"));
	МассивИсключенийИменПараметров.Добавить(ВРег("Default value"));
	Контекст.Вставить("МассивИсключенийИменПараметров", МассивИсключенийИменПараметров);
	
	МассивИсключенийТиповПараметров = Новый Массив;
	МассивИсключенийТиповПараметров.Добавить(ВРег("Ключ"));
	МассивИсключенийТиповПараметров.Добавить(ВРег("которое"));
	МассивИсключенийТиповПараметров.Добавить(ВРег("где"));
	МассивИсключенийТиповПараметров.Добавить(ВРег("где:"));
	МассивИсключенийТиповПараметров.Добавить(ВРег("поля:"));
	МассивИсключенийТиповПараметров.Добавить(ВРег("колонки:"));
	МассивИсключенийТиповПараметров.Добавить(ВРег("например"));
	МассивИсключенийТиповПараметров.Добавить(ВРег("Истина"));
	МассивИсключенийТиповПараметров.Добавить(ВРег("Ложь"));
	МассивИсключенийТиповПараметров.Добавить(ВРег("новый"));
	МассивИсключенийТиповПараметров.Добавить(ВРег("возвращаемое."));
	МассивИсключенийТиповПараметров.Добавить(ВРег("Группы"));
	МассивИсключенийТиповПараметров.Добавить(ВРег("Пользователи"));
	МассивИсключенийТиповПараметров.Добавить(ВРег("См."));
	МассивИсключенийТиповПараметров.Добавить(ВРег("ссылка на "));
	МассивИсключенийТиповПараметров.Добавить(ВРег("ссылка измененного "));
	МассивИсключенийТиповПараметров.Добавить(ВРег("Users"));
	МассивИсключенийТиповПараметров.Добавить(ВРег("Groups"));
	
	Контекст.Вставить("МассивИсключенийТиповПараметров", МассивИсключенийТиповПараметров);
	
	МассивИсключенийТиповПараметровДляВыравнивания = Новый Массив;
	МассивИсключенийТиповПараметровДляВыравнивания.Добавить(ВРег("Массив из типов"));
	МассивИсключенийТиповПараметровДляВыравнивания.Добавить(ВРег("ОМД"));
	Контекст.Вставить("МассивИсключенийТиповПараметровДляВыравнивания", МассивИсключенийТиповПараметровДляВыравнивания);
	
	МассивСимволовДляВыделенияТипаПараметра = Новый Массив;
	МассивСимволовДляВыделенияТипаПараметра.Добавить(",");
	МассивСимволовДляВыделенияТипаПараметра.Добавить(". ");
	МассивСимволовДляВыделенияТипаПараметра.Добавить(ВРег("с колонками"));
	МассивСимволовДляВыделенияТипаПараметра.Добавить(ВРег("with speakers"));
	МассивСимволовДляВыделенияТипаПараметра.Добавить(ВРег("со свойствами"));
	МассивСимволовДляВыделенияТипаПараметра.Добавить(ВРег("with properties"));
	МассивСимволовДляВыделенияТипаПараметра.Добавить(ВРег("with the following properties"));
	МассивСимволовДляВыделенияТипаПараметра.Добавить(ВРег("с полями"));
	МассивСимволовДляВыделенияТипаПараметра.Добавить(ВРег("with fields"));
	МассивСимволовДляВыделенияТипаПараметра.Добавить(ВРег("with the following fields"));
	МассивСимволовДляВыделенияТипаПараметра.Добавить(ВРег("с ключами"));
	МассивСимволовДляВыделенияТипаПараметра.Добавить(ВРег("with keys"));
	МассивСимволовДляВыделенияТипаПараметра.Добавить(ВРег("Признак"));
	МассивСимволовДляВыделенияТипаПараметра.Добавить(ВРег("flag"));
	МассивСимволовДляВыделенияТипаПараметра.Добавить(ВРег("псевдоним"));
	МассивСимволовДляВыделенияТипаПараметра.Добавить(ВРег("alias"));
	МассивСимволовДляВыделенияТипаПараметра.Добавить(ВРег("с описанием"));
	МассивСимволовДляВыделенияТипаПараметра.Добавить(ВРег("with description"));
	МассивСимволовДляВыделенияТипаПараметра.Добавить(ВРег("с данными"));
	МассивСимволовДляВыделенияТипаПараметра.Добавить(ВРег("с правилами"));
	МассивСимволовДляВыделенияТипаПараметра.Добавить(ВРег("with rules"));
	
	Контекст.Вставить("МассивСимволовДляВыделенияТипаПараметра", МассивСимволовДляВыделенияТипаПараметра);
	
	СписокЗаменПриПереносеСвойствКлючИЗначение = Новый СписокЗначений;
	СписокЗаменПриПереносеСвойствКлючИЗначение.Добавить(ВРег("содержит"), "");
	СписокЗаменПриПереносеСвойствКлючИЗначение.Добавить(ВРег("является"), "");
	СписокЗаменПриПереносеСвойствКлючИЗначение.Добавить(ВРег("указать"), "");
	СписокЗаменПриПереносеСвойствКлючИЗначение.Добавить(ВРег("указывается"), "");
	СписокЗаменПриПереносеСвойствКлючИЗначение.Добавить(ВРег("выступает"), "");
	СписокЗаменПриПереносеСвойствКлючИЗначение.Добавить(ВРег("установить в"), "");
	СписокЗаменПриПереносеСвойствКлючИЗначение.Добавить(ВРег("в качестве"), "");
	СписокЗаменПриПереносеСвойствКлючИЗначение.Добавить(ВРег("как"), "");
	СписокЗаменПриПереносеСвойствКлючИЗначение.Добавить(ВРег("пустую строку"), "пустая строка");
	СписокЗаменПриПереносеСвойствКлючИЗначение.Добавить(ВРег("строковое описание"), "Строка - описание");
	СписокЗаменПриПереносеСвойствКлючИЗначение.Добавить(ВРег("is the"), "");
	СписокЗаменПриПереносеСвойствКлючИЗначение.Добавить(ВРег("is"), "");
	СписокЗаменПриПереносеСвойствКлючИЗначение.Добавить(ВРег(" "), "");
	Контекст.Вставить("СписокЗаменПриПереносеСвойствКлючИЗначение", СписокЗаменПриПереносеСвойствКлючИЗначение);
	
	МассивИсключенийСловДляУстановкиПервогоСимволаТекстовогоОписанияПараметраВНижнийРегистр = Новый Массив;
	МассивИсключенийСловДляУстановкиПервогоСимволаТекстовогоОписанияПараметраВНижнийРегистр.Добавить(ВРег("Массив из"));
	МассивИсключенийСловДляУстановкиПервогоСимволаТекстовогоОписанияПараметраВНижнийРегистр.Добавить(ВРег("Истина"));
	МассивИсключенийСловДляУстановкиПервогоСимволаТекстовогоОписанияПараметраВНижнийРегистр.Добавить(ВРег("Ложь"));
	МассивИсключенийСловДляУстановкиПервогоСимволаТекстовогоОписанияПараметраВНижнийРегистр.Добавить(ВРег("Ключ:"));
	МассивИсключенийСловДляУстановкиПервогоСимволаТекстовогоОписанияПараметраВНижнийРегистр.Добавить(ВРег("Ключ - "));
	МассивИсключенийСловДляУстановкиПервогоСимволаТекстовогоОписанияПараметраВНижнийРегистр.Добавить(ВРег("Ключ ("));
	МассивИсключенийСловДляУстановкиПервогоСимволаТекстовогоОписанияПараметраВНижнийРегистр.Добавить(ВРег("Ключи = "));
	МассивИсключенийСловДляУстановкиПервогоСимволаТекстовогоОписанияПараметраВНижнийРегистр.Добавить(ВРег("Значения = "));
	МассивИсключенийСловДляУстановкиПервогоСимволаТекстовогоОписанияПараметраВНижнийРегистр.Добавить(ВРег("Неопределено"));
	МассивИсключенийСловДляУстановкиПервогоСимволаТекстовогоОписанияПараметраВНижнийРегистр.Добавить(ВРег("Отложенно,"));
	МассивИсключенийСловДляУстановкиПервогоСимволаТекстовогоОписанияПараметраВНижнийРегистр.Добавить(ВРег("Массив - "));
	МассивИсключенийСловДляУстановкиПервогоСимволаТекстовогоОписанияПараметраВНижнийРегистр.Добавить(ВРег("Колонки, Прямоугольник"));
	МассивИсключенийСловДляУстановкиПервогоСимволаТекстовогоОписанияПараметраВНижнийРегистр.Добавить(ВРег("Array of"));
	МассивИсключенийСловДляУстановкиПервогоСимволаТекстовогоОписанияПараметраВНижнийРегистр.Добавить(ВРег("True"));
	МассивИсключенийСловДляУстановкиПервогоСимволаТекстовогоОписанияПараметраВНижнийРегистр.Добавить(ВРег("False"));
	МассивИсключенийСловДляУстановкиПервогоСимволаТекстовогоОписанияПараметраВНижнийРегистр.Добавить(ВРег("Key"));
	МассивИсключенийСловДляУстановкиПервогоСимволаТекстовогоОписанияПараметраВНижнийРегистр.Добавить(ВРег("Key - "));
	МассивИсключенийСловДляУстановкиПервогоСимволаТекстовогоОписанияПараметраВНижнийРегистр.Добавить(ВРег("Undefined"));
	МассивИсключенийСловДляУстановкиПервогоСимволаТекстовогоОписанияПараметраВНижнийРегистр.Добавить(ВРег("Deferred,"));
	МассивИсключенийСловДляУстановкиПервогоСимволаТекстовогоОписанияПараметраВНижнийРегистр.Добавить(ВРег("Array - "));
	МассивИсключенийСловДляУстановкиПервогоСимволаТекстовогоОписанияПараметраВНижнийРегистр.Добавить(ВРег("Columns, Rectangle"));
	
	Контекст.Вставить("МассивИсключенийСловДляУстановкиПервогоСимволаТекстовогоОписанияПараметраВНижнийРегистр",
		МассивИсключенийСловДляУстановкиПервогоСимволаТекстовогоОписанияПараметраВНижнийРегистр);
	
	ТаблицаШаблоновНезначащихОписаний = ПолучитьТаблицуШаблоновНезначащихОписанийПараметров();
	Контекст.Вставить("ТаблицаШаблоновНезначащихОписаний", ТаблицаШаблоновНезначащихОписаний);
	
	МассивНезначащихОписаний = Новый Массив;
	МассивНезначащихОписаний.Добавить("где");
	МассивНезначащихОписаний.Добавить("where");
	МассивНезначащихОписаний.Добавить("поля");
	МассивНезначащихОписаний.Добавить("со свойствами");
	МассивНезначащихОписаний.Добавить("with the following properties");
	МассивНезначащихОписаний.Добавить("с полями");
	МассивНезначащихОписаний.Добавить("with the following fields");
	МассивНезначащихОписаний.Добавить("с колонками");
	МассивНезначащихОписаний.Добавить("table of values with columns");
	МассивНезначащихОписаний.Добавить("с ключами");
	МассивНезначащихОписаний.Добавить("структура с полями");
	МассивНезначащихОписаний.Добавить("a structure with the following properties");
	МассивНезначащихОписаний.Добавить("structure with fields");
	МассивНезначащихОписаний.Добавить("структура с ключами");
	МассивНезначащихОписаний.Добавить("a structure with the following keys");
	МассивНезначащихОписаний.Добавить("описание данных");
	МассивНезначащихОписаний.Добавить("описание");
	МассивНезначащихОписаний.Добавить("description");
	МассивНезначащихОписаний.Добавить("описание результата. Содержит поля.");
	МассивНезначащихОписаний.Добавить("содержит следующие колонки");
	МассивНезначащихОписаний.Добавить("содержит следующие параметры");
	МассивНезначащихОписаний.Добавить("with the following parameters");
	МассивНезначащихОписаний.Добавить("содержащая следующие свойства");
	МассивНезначащихОписаний.Добавить("with the following properties");
	МассивНезначащихОписаний.Добавить("соответствие, где:");
	МассивНезначащихОписаний.Добавить("в качестве:");
	МассивНезначащихОписаний.Добавить("таблица с колонками");
	МассивНезначащихОписаний.Добавить("table with the following columns");
	МассивНезначащихОписаний.Добавить("with the following values");
	Контекст.Вставить("МассивНезначащихОписаний", ПреобразоватьМассивДляСравнения(МассивНезначащихОписаний));
	
	МассивОписанийБезДобавленияДвоеточия = Новый Массив;
	МассивОписанийБезДобавленияДвоеточия.Добавить(ВРег("Структура - ключ - "));
	МассивОписанийБезДобавленияДвоеточия.Добавить(ВРег("Structure - Key - "));
	МассивОписанийБезДобавленияДвоеточия.Добавить(ВРег("Соответствие - Ключ:"));
	МассивОписанийБезДобавленияДвоеточия.Добавить(ВРег("где Ключ -"));
	МассивОписанийБезДобавленияДвоеточия.Добавить(ВРег("ОпределяемыйТип.Организация"));
	МассивОписанийБезДобавленияДвоеточия.Добавить(ВРег("И 1 -"));
	МассивОписанийБезДобавленияДвоеточия.Добавить(ВРег("<обязательные>"));
	Контекст.Вставить("МассивОписанийБезДобавленияДвоеточия", МассивОписанийБезДобавленияДвоеточия);
	
	МассивТекстЗнач = Новый Массив;
	МассивТекстЗнач.Добавить(ВРег("Знач "));
	МассивТекстЗнач.Добавить(ВРег("Val "));
	Контекст.Вставить("МассивТекстЗнач", МассивТекстЗнач);
	
	МассивТекстИстинаЛожь = Новый Массив;
	МассивТекстИстинаЛожь.Добавить(ВРег("Истина"));
	МассивТекстИстинаЛожь.Добавить(ВРег("Ложь"));
	МассивТекстИстинаЛожь.Добавить(ВРег("True"));
	МассивТекстИстинаЛожь.Добавить(ВРег("False"));
	Контекст.Вставить("МассивТекстИстинаЛожь", МассивТекстИстинаЛожь);
	
	МассивТекстКлючЗначение = Новый Массив;
	МассивТекстКлючЗначение.Добавить(ВРег("Ключ"));
	МассивТекстКлючЗначение.Добавить(ВРег("Значение"));
	МассивТекстКлючЗначение.Добавить(ВРег("Key"));
	МассивТекстКлючЗначение.Добавить(ВРег("Value"));
	Контекст.Вставить("МассивТекстКлючЗначение", МассивТекстКлючЗначение);
	
	МассивЛишнихСимволов = Новый Массив;
	МассивЛишнихСимволов.Добавить(",-");
	МассивЛишнихСимволов.Добавить("-,");
	МассивЛишнихСимволов.Добавить("--");
	МассивЛишнихСимволов.Добавить("-—");
	Контекст.Вставить("МассивЛишнихСимволов", МассивЛишнихСимволов);
	
	МассивЗначимыхСимволовНачалаСтроки = Новый Массив;
	МассивЗначимыхСимволовНачалаСтроки.Добавить("(");
	МассивЗначимыхСимволовНачалаСтроки.Добавить("<");
	МассивЗначимыхСимволовНачалаСтроки.Добавить("[");
	МассивЗначимыхСимволовНачалаСтроки.Добавить("{");
	МассивЗначимыхСимволовНачалаСтроки.Добавить("""");
	МассивЗначимыхСимволовНачалаСтроки.Добавить("//");
	Контекст.Вставить("МассивЗначимыхСимволовНачалаСтроки", МассивЗначимыхСимволовНачалаСтроки);
	
	МассивЗначимыхСимволовОкончанияСтроки = Новый Массив;
	МассивЗначимыхСимволовОкончанияСтроки.Добавить("...");
	МассивЗначимыхСимволовОкончанияСтроки.Добавить(")");
	МассивЗначимыхСимволовОкончанияСтроки.Добавить(">");
	МассивЗначимыхСимволовОкончанияСтроки.Добавить("]");
	МассивЗначимыхСимволовОкончанияСтроки.Добавить("}");
	МассивЗначимыхСимволовОкончанияСтроки.Добавить("""");
	МассивЗначимыхСимволовОкончанияСтроки.Добавить("//");
	Контекст.Вставить("МассивЗначимыхСимволовОкончанияСтроки", МассивЗначимыхСимволовОкончанияСтроки);
	
	Контекст.Вставить("ТаблицаПозицийОписанияПараметра", ИнициализироватьТаблицуПозицийОписанияПараметра());
	
	ТаблицаОбъектовПереадресации = ИнициализироватьТаблицуОбъектовПереадресации();
	Контекст.Вставить("ТаблицаОбъектовПереадресации", ТаблицаОбъектовПереадресации);
	
	Контекст.Вставить("ТаблицаРезультат");
	
	Контекст.Вставить("ТекстСимволыНачалаПреамбулы", "///////////////");
	Контекст.Вставить("КоличествоСимволовДляПереносаКомментария", 120);
	
	МассивТекстУдалить = Новый Массив;
	МассивТекстУдалить.Добавить(ВРег("Удалить"));
	МассивТекстУдалить.Добавить(ВРег("Obsolete"));
	Контекст.Вставить("МассивТекстУдалить", МассивТекстУдалить);
	
	Контекст.Вставить("ЗаменаСимволаБольшеДляXML", "&gt;");
	Контекст.Вставить("ЗаменаСимволаКавычкаДляXML", "&quot;");
	Контекст.Вставить("ТегКорневогоЭлементаФайлаXMLФормыПроектаEDT", "<form:Form");
	
	СоответствиеИменСтандартныхТабличныхЧастей = Новый Соответствие;
	СоответствиеИменСтандартныхТабличныхЧастей.Вставить("ExtDimensionTypes",          "ВидыСубконто");
	СоответствиеИменСтандартныхТабличныхЧастей.Вставить("LeadingCalculationTypes",    "ВедущиеВидыРасчета");
	СоответствиеИменСтандартныхТабличныхЧастей.Вставить("DisplacingCalculationTypes", "ВытесняющиеВидыРасчета");
	СоответствиеИменСтандартныхТабличныхЧастей.Вставить("BaseCalculationTypes",       "БазовыеВидыРасчета");
	Контекст.Вставить("СоответствиеИменСтандартныхТабличныхЧастей", СоответствиеИменСтандартныхТабличныхЧастей);
	
	МассивВыраженийПоискаТабличныхЧастейXML = Новый Массив;
	МассивВыраженийПоискаТабличныхЧастейXML.Добавить("//xmlns:TabularSection/xmlns:Properties");
	МассивВыраженийПоискаТабличныхЧастейXML.Добавить("//xr:StandardTabularSection");
	Контекст.Вставить("МассивВыраженийПоискаТабличныхЧастейXML", МассивВыраженийПоискаТабличныхЧастейXML);
	
	МассивВыраженийПоискаТабличныхЧастейEDT = Новый Массив;
	МассивВыраженийПоискаТабличныхЧастейEDT.Добавить("//tabularSections");
	МассивВыраженийПоискаТабличныхЧастейEDT.Добавить("//standardTabularSections");
	Контекст.Вставить("МассивВыраженийПоискаТабличныхЧастейEDT", МассивВыраженийПоискаТабличныхЧастейEDT);
	
	ТаблицаТеговПоискаКавычекEDT = Новый ТаблицаЗначений;
	ТаблицаТеговПоискаКавычекEDT.Колонки.Добавить("НачалоТега");
	ТаблицаТеговПоискаКавычекEDT.Колонки.Добавить("КонецТега");
	
	НовыйТег = ТаблицаТеговПоискаКавычекEDT.Добавить();
	НовыйТег.НачалоТега = "<value>";
	НовыйТег.КонецТега = "</value>";
	
	НовыйТег = ТаблицаТеговПоискаКавычекEDT.Добавить();
	НовыйТег.НачалоТега = "<queryText>";
	НовыйТег.КонецТега = "</queryText>";
	
	НовыйТег = ТаблицаТеговПоискаКавычекEDT.Добавить();
	НовыйТег.НачалоТега = "<vendor>";
	НовыйТег.КонецТега = "</vendor>";
	
	Контекст.Вставить("ТаблицаТеговПоискаКавычекEDT", ТаблицаТеговПоискаКавычекEDT);
	
	ТаблицаЯзыковКонфигурации = ПолучитьЯзыкиКонфигурации();
	Контекст.Вставить("ТаблицаЯзыковКонфигурации", ТаблицаЯзыковКонфигурации);
	
	КодОсновногоЯзыкаКонфигурации = ПолучитьКодОсновногоЯзыкаКонфигурации();
	Контекст.Вставить("КодОсновногоЯзыкаКонфигурации", КодОсновногоЯзыкаКонфигурации);
	
	МассивТире = Новый Массив;
	МассивТире.Добавить("-");
	МассивТире.Добавить("—");
	Контекст.Вставить("МассивТире", МассивТире);
	
	МассивИсключенийИменОбласти = Новый Массив;
	МассивИсключенийИменОбласти.Добавить(ВРег("Экспорт"));
	МассивИсключенийИменОбласти.Добавить(ВРег("Export"));
	Контекст.Вставить("МассивИсключенийИменОбласти", МассивИсключенийИменОбласти);
	
	ТаблицаЗамеровВремениВыполнения = Новый ТаблицаЗначений;
	ТаблицаЗамеровВремениВыполнения.Колонки.Добавить("Стандарт");
	ТаблицаЗамеровВремениВыполнения.Колонки.Добавить("ВремяПриведенияКСтандарту");
	Контекст.Вставить("ТаблицаЗамеровВремениВыполнения", ТаблицаЗамеровВремениВыполнения);
	
КонецПроцедуры

// АПК:1297-вкл

Функция ЭтоУникальныйИдентификатор(Знач Строка)
	
	Попытка
		УникальныйИдентификатор = Новый УникальныйИдентификатор(Строка);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Процедура СокрТекстДокумента(ДокументТекст, Слева = Истина, Справа = Истина)
	
	ТекстМодуля = ДокументТекст.ПолучитьТекст();
	
	Если Слева Тогда
		ТекстМодуля = СокрЛ(ТекстМодуля);
	КонецЕсли;
	
	Если Справа Тогда
		ТекстМодуля = СокрП(ТекстМодуля);
	КонецЕсли;
	
	ДокументТекст.УстановитьТекст(ТекстМодуля);
	
КонецПроцедуры

Функция ПолучитьКодОсновногоЯзыкаКонфигурации()
	
	КодОсновногоЯзыкаКонфигурации = КодОсновногоЯзыка;
	
	ПутьКФайлуКонфигурации = ?(ЭтоВыгрузкаXMLФайлов, КаталогВыгрузкиРезультат + "Configuration.xml",
		КаталогВыгрузкиРезультат + СтрШаблон("src%1Configuration%1Configuration.mdo", РазделительПути));
	
	Если НЕ апк_ФайлСуществует(ПутьКФайлуКонфигурации) Тогда
		Возврат КодОсновногоЯзыкаКонфигурации;
	КонецЕсли;
	
	ВыражениеПоискаОсновногоЯзыка = ?(ЭтоВыгрузкаXMLФайлов, "//xmlns:DefaultLanguage", "//defaultLanguage");
	ДокументDOM = ДокументDOM(ПутьКФайлуКонфигурации);
	
	РезультатXPath = ВычислитьВыражениеXPath(ВыражениеПоискаОсновногоЯзыка, ДокументDOM);
	
	ЭлементDOMОсновнойЯзык = РезультатXPath.ПолучитьСледующий();
	Если ЭлементDOMОсновнойЯзык = Неопределено Тогда
		Возврат КодОсновногоЯзыкаКонфигурации;
	КонецЕсли;
	
	ОсновнойЯзыкКонфигурации = ЭлементDOMОсновнойЯзык.ТекстовоеСодержимое;
	ОсновнойЯзыкКонфигурации = СтрЗаменить(ОсновнойЯзыкКонфигурации, "Language.", "");
	
	ТаблицаЯзыковКонфигурации = Контекст["ТаблицаЯзыковКонфигурации"];
	Если ТаблицаЯзыковКонфигурации.Количество() = 0 Тогда
		Возврат КодОсновногоЯзыкаКонфигурации;
	КонецЕсли;
	
	НайденнаяСтрока = ТаблицаЯзыковКонфигурации.Найти(ОсновнойЯзыкКонфигурации, "Наименование");
	Если НайденнаяСтрока = Неопределено Тогда
		Возврат КодОсновногоЯзыкаКонфигурации;
	КонецЕсли;
	
	КодЯзыка = НайденнаяСтрока.КодЯзыка;
	// Для языков, отличных от русского и английского, возвращаем значение "en".
	КодЯзыка = ?(КодЯзыка <> "ru" И КодЯзыка <> "en", "en", КодЯзыка);
	
	Возврат КодЯзыка;
	
КонецФункции

Процедура ЗаполнитьВремяПриведенияКСтандарту(Стандарт, ВремяНачалаЗамера)
	
	ТаблицаЗамеровВремениВыполнения = Контекст["ТаблицаЗамеровВремениВыполнения"];
	
	НоваяСтрока = ТаблицаЗамеровВремениВыполнения.Добавить();
	НоваяСтрока.Стандарт = Стандарт;
	НоваяСтрока.ВремяПриведенияКСтандарту = ((ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачалаЗамера) / 1000);
	
	Контекст.Вставить("ТаблицаЗамеровВремениВыполнения", ТаблицаЗамеровВремениВыполнения);
	
КонецПроцедуры

#КонецОбласти

#Область РегистрацияОшибокСППР

Функция ПолучитьТекстовыйДокументИзФайла(ПолноеИмяФайла, КодировкаФайла = "")
	
	// Если в файле есть ошибки, то не пытаемся читать его повторно.
	Если ФайлСодержитОшибки(ПолноеИмяФайла) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДокументТекст = Новый ТекстовыйДокумент;
	
	Попытка
		Если ПустаяСтрока(КодировкаФайла) Тогда
			ДокументТекст.Прочитать(ПолноеИмяФайла);
		Иначе
			ДокументТекст.Прочитать(ПолноеИмяФайла, КодировкаФайла);
		КонецЕсли;
	Исключение
		ЗаписатьОшибкуЧтенияФайлаВТаблицуРезультат(ПолноеИмяФайла, ИнформацияОбОшибке());
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ДокументТекст;
	
КонецФункции

Функция ФайлСодержитОшибки(ПолноеИмяФайла)
	
	СтрокаТаблицы = Результат.Найти(ПолноеИмяФайла, "ПолноеИмяФайла");
	Если СтрокаТаблицы = Неопределено Тогда
		СтрокаТаблицы = Результат.Добавить();
		СтрокаТаблицы.ПолноеИмяФайла = ПолноеИмяФайла;
	КонецЕсли;
	
	Если НЕ апк_ФайлСуществует(ПолноеИмяФайла) Тогда
		СтрокаТаблицы.СодержитОшибки = Истина;
		СтрокаТаблицы.ОписаниеОшибки = СтрШаблон(НСтр("ru='Файл не существует по пути: %1'; en='Файл не существует по пути: %1'",
			КодОсновногоЯзыка), ПолноеИмяФайла);
	КонецЕсли;
	
	Если СтрокаТаблицы.СодержитОшибки Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура ЗаписатьОшибкуЧтенияФайлаВТаблицуРезультат(ПолноеИмяФайла, ИнформацияОбОшибке)
	
	ОписаниеОшибки = ?(ТипЗнч(ИнформацияОбОшибке) = Тип("Строка"), ИнформацияОбОшибке,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	
	СтрокаТаблицы = Результат.Найти(ПолноеИмяФайла, "ПолноеИмяФайла");
	Если СтрокаТаблицы = Неопределено Тогда
		СтрокаТаблицы = Результат.Добавить();
		СтрокаТаблицы.ПолноеИмяФайла = ПолноеИмяФайла;
	КонецЕсли;
	
	СтрокаТаблицы.СодержитОшибки = Истина;
	СтрокаТаблицы.ОписаниеОшибки = ОписаниеОшибки;
	
	СформироватьXMLФайлОшибки(СтрокаТаблицы.Объект, ОписаниеОшибки, ПолноеИмяФайла);
	
КонецПроцедуры

Процедура СформироватьXMLФайлОшибки(Объект, ИнформацияОбОшибке = "", ПолноеИмяФайла = "", Комментарий = "") Экспорт
	
	Если НЕ апк_ФайлСуществует(КаталогФайловОшибокСППР) Тогда
		Возврат;
	КонецЕсли;
	
	ПорядокВоспроизведения = СтрШаблон(НСтр("ru='Для воспроизведения:
		|запустить обработку АвтоформатированиеКодаИЛокализация.epf в пакетном режиме.
		|В качестве параметра запуска указать путь к файлу настроек: ""%1"".';
		|en='Для воспроизведения:
		|запустить обработку АвтоформатированиеКодаИЛокализация.epf в пакетном режиме.
		|В качестве параметра запуска указать путь к файлу настроек: ""%1"".'", КодОсновногоЯзыка),
		ПутьКФайлуНастроекАвтоформатирования);
	
	
	ИдентификаторОшибки = Строка(Новый УникальныйИдентификатор());
	ТипОшибки = НСтр("ru='Ошибка при выполнении обработки АвтоформатированиеКодаИЛокализация';
		|en='Ошибка при выполнении обработки АвтоформатированиеКодаИЛокализация'", КодОсновногоЯзыка);
	
	
	Ошибка = СоздатьОписаниеОшибки();
	Ошибка.ТипОшибки              = ТипОшибки;
	Ошибка.ИсходнаяИнформация     = ПолноеИмяФайла;
	Ошибка.ПорядокВоспроизведения = ПорядокВоспроизведения;
	Ошибка.УточнениеРасположения  = ИнформацияОбОшибке;
	Ошибка.Комментарий            = Комментарий;
	Ошибка.ОбъектМетаданных       = Объект;
	Ошибка.ДатаОбнаружения        = ТекущаяДатаСеанса();
	Ошибка.КодСценария            = ИдентификаторОшибки;
	
	ОбщиеИмяФайлов = Формат(ТекущаяДатаСеанса(), "ДФ=yyyyMMddHHmmss") + "_" + ИдентификаторОшибки;
	ИмяФайлаОшибки = ОтредактироватьПутьККаталогу(КаталогФайловОшибокСППР) + ОбщиеИмяФайлов + ".xml";
	
	ФайлОшибки = Новый ЗаписьТекста(ИмяФайлаОшибки, КодировкаТекста.UTF8);
	ФайлОшибки.Записать(ТекстОшибкиXML(Ошибка));
	ФайлОшибки.Закрыть();
	
КонецПроцедуры

Функция СоздатьОписаниеОшибки()

	Ошибка = Новый Структура;
	
	Ошибка.Вставить("ВерсияФормата",            "1.4");
	Ошибка.Вставить("УИ",                       Строка(Новый УникальныйИдентификатор));
	Ошибка.Вставить("ТипОшибки",                "");
	Ошибка.Вставить("ИсходнаяИнформация",       "");
	Ошибка.Вставить("ПорядокВоспроизведения",   "");
	Ошибка.Вставить("ОжидаемоеПоведение",       "");
	Ошибка.Вставить("Ответственный",            "");
	Ошибка.Вставить("Комментарий",              "");
	Ошибка.Вставить("ДостоверностьОбнаружения", "Низкая"); // "Высокая" либо "Низкая".
	Ошибка.Вставить("АдресРепозитория",         "");
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Ошибка.Вставить("ВерсияПлатформы",                    СистемнаяИнформация.ВерсияПриложения);
	Ошибка.Вставить("КлиентОперативнаяПамять",            СистемнаяИнформация.ОперативнаяПамять);
	Ошибка.Вставить("КлиентВерсияОС",                     СистемнаяИнформация.ВерсияОС);
	Ошибка.Вставить("КлиентПроцессор",                    СистемнаяИнформация.Процессор);
	Ошибка.Вставить("КлиентТипПлатформы",                 Строка(СистемнаяИнформация.ТипПлатформы));
	Ошибка.Вставить("КлиентИнформацияПрограммыПросмотра", СистемнаяИнформация.ИнформацияПрограммыПросмотра);
	Ошибка.Вставить("КлиентТекущаяДата",                  ТекущаяДатаСеанса());
	
	Ошибка.Вставить("ДатаОбнаружения",       ТекущаяДатаСеанса());
	Ошибка.Вставить("ОбъектыМетаданных",     Новый Массив); // Возможность добавить массив объектов метаданных.
	Ошибка.Вставить("ОбъектМетаданных",      ""); // Регистрация по одному объекту метаданных.
	Ошибка.Вставить("УточнениеРасположения", "");
	Ошибка.Вставить("КодСценария",           "");
	Ошибка.Вставить("ИмяСценария",           "");
	Ошибка.Вставить("ИменаФайлов",           Новый Массив);
	
	Ошибка.Вставить("ВерсияКонфигурации", "");
	Ошибка.Вставить("ИмяКонфигурации",    "");
	
	Возврат Ошибка;
	
КонецФункции

Процедура ДополнитьОписаниеОшибкиНаСервере(Ошибка)
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Ошибка.Вставить("ВерсияПлатформы",                    СистемнаяИнформация.ВерсияПриложения);
	Ошибка.Вставить("СерверОперативнаяПамять",            СистемнаяИнформация.ОперативнаяПамять);
	Ошибка.Вставить("СерверВерсияОС",                     СистемнаяИнформация.ВерсияОС);
	Ошибка.Вставить("СерверПроцессор",                    СистемнаяИнформация.Процессор);
	Ошибка.Вставить("СерверТипПлатформы",                 Строка(СистемнаяИнформация.ТипПлатформы));
	Ошибка.Вставить("СерверИнформацияПрограммыПросмотра", СистемнаяИнформация.ИнформацияПрограммыПросмотра);
	
	СтруктураСведенийОКонфигурации = ПолучитьИмяИВерсиюКонфигурации();
	
	Ошибка.Вставить("ВерсияКонфигурации", СтруктураСведенийОКонфигурации.Версия);
	Если НЕ Ошибка.Свойство("ИмяКонфигурации") ИЛИ ПустаяСтрока(Ошибка.ИмяКонфигурации) Тогда
		Ошибка.Вставить("ИмяКонфигурации", СтруктураСведенийОКонфигурации.Имя);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ошибка.ДатаОбнаружения) Тогда
		Ошибка.ДатаОбнаружения = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьИмяИВерсиюКонфигурации()
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Имя",    "");
	СтруктураРезультат.Вставить("Версия", "");
	
	Если ПустаяСтрока(КаталогВыгрузкиРезультат) Тогда
		Возврат СтруктураРезультат;

	КонецЕсли;
	
	ФайлКонфигурации = ПолучитьФайлКонфигурации();

	
	ДокументDOM = ДокументDOM(ФайлКонфигурации);
	Если ДокументDOM = Неопределено Тогда
		Возврат СтруктураРезультат;
	КонецЕсли;
	
	ВыражениеПоиска  = ?(ЭтоВыгрузкаXMLФайлов, "//xmlns:Version", "//version");
	СтруктураРезультат.Версия = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath(ВыражениеПоиска, ДокументDOM);
	
	ВыражениеПоиска = ?(ЭтоВыгрузкаXMLФайлов, "//xmlns:Name", "//name");
	СтруктураРезультат.Имя = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath(ВыражениеПоиска, ДокументDOM);
	
	Возврат СтруктураРезультат;
	
КонецФункции

Функция ТекстОшибкиXML(Ошибка)
	
	ДополнитьОписаниеОшибкиНаСервере(Ошибка);
	
	СтруктураОбъектаМетаданных = Новый Структура;
	СтруктураОбъектаМетаданных.Вставить("ОбъектМетаданных", Ошибка.ОбъектМетаданных);
	СтруктураОбъектаМетаданных.Вставить("УточнениеРасположения", Ошибка.УточнениеРасположения);
	
	Если ТипЗнч(Ошибка.УточнениеРасположения) = Тип("Массив") Тогда
		
		Для Каждого УточнениеРасположения Из Ошибка.УточнениеРасположения Цикл
			СтруктураОбъектаМетаданных.УточнениеРасположения = УточнениеРасположения;
			Ошибка.ОбъектыМетаданных.Добавить(СтруктураОбъектаМетаданных);
		КонецЦикла;
		
	Иначе
		
		Если ЗначениеЗаполнено(Ошибка.ОбъектМетаданных) ИЛИ ЗначениеЗаполнено(Ошибка.УточнениеРасположения) Тогда
			Ошибка.ОбъектыМетаданных.Добавить(СтруктураОбъектаМетаданных);
		КонецЕсли;
		
	КонецЕсли;
	
	Ошибка.Удалить("ОбъектМетаданных");
	Ошибка.Удалить("УточнениеРасположения");
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Ошибка);
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

#КонецОбласти

#Область РаботаСФайламиИКаталогами

Функция ПолучитьЛогВыгрузкиФайловКонфигурации(ФайлЛога)
	
	// Проверяем лог запуска конфигуратора.
	Текст = ПолучитьТекстФайла(ФайлЛога);
	
	апк_ФайлУдалить(ФайлЛога);
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Функция ПолучитьКаталогФайла(ПутьКФайлу)
	
	Файл = Новый Файл(ПутьКФайлу);
	Возврат Файл.Путь;
	
КонецФункции

// Получает путь к информационной базе в следующем формате:
// - для серверных баз <Путь к серверу>\<Путь к базе>
// - для файловых баз путь к каталогу где расположена информационная база с "\" в конце.
// Параметры:
//  ПутьКБазе - Строка, путь к базе, который необходимо преобразовать к формату
// Возвращаемое значение:
//  Тип Строка.
Функция ПолучитьПутьКБазе(Знач ПутьКБазе)
	
	Если НЕ ЗначениеЗаполнено(ПутьКБазе) Тогда
		Возврат "";
	КонецЕсли;
	
	ПутьКБазе = СокрЛП(ПутьКБазе);
	
	// Если на вход подается строка соединения с файловой базой, то получаем каталог из строки соединения.
	Если СтрНайти(ПутьКБазе, "File=") > 0 Тогда
		СтрокаПодключения = НСтр(ПутьКБазе, "File");
		// Добавляем слэш в конце.
		Возврат ОтредактироватьПутьККаталогу(СтрокаПодключения);
	КонецЕсли;
	
	// Если на вход подается строка соединения с серверной базой, то формируем путь к базе из строки соединения.
	Если СтрНайти(ПутьКБазе, "Srvr=") > 0 Тогда
		Сервер = НСтр(ПутьКБазе, "Srvr");
		ИмяБазы = НСтр(ПутьКБазе, "Ref");
		Возврат Сервер + РазделительПути + ИмяБазы;
	КонецЕсли;
	
	// Проверяем, указан путь к серверной базе или к файловой.
	Если (СтрНайти(ПутьКБазе, ":\") = 0 И СтрНайти(ПутьКБазе, "$\") = 0 И СтрНайти(ПутьКБазе, "\\") = 0) Тогда
		// Если в пути к серверной базе указан слэш в конце, то убираем его.
		Возврат ?(Лев(ПутьКБазе, 1) = "\", Прав(ПутьКБазе, СтрДлина(ПутьКБазе) - 1), ПутьКБазе)
	КонецЕсли;
	
	// Убираем имя файла из конца пути к базе.
	КаталогБазы = ?(СтрНайти(ВРег(ПутьКБазе), "1CV8.1CD") = 0, ПутьКБазе, ПолучитьКаталогФайла(ПутьКБазе));
	// Добавляем слэш в конце каталога файловой базы.
	Возврат ОтредактироватьПутьККаталогу(КаталогБазы);
	
КонецФункции

// Выполняет проверку того, является ли указанная база файловой.
// Параметры:
//	ПутьКБазе - Строка, путь к базе
// Возвращаемое значение:
//	Булево, Истина если база файловая, Ложь если серверная.
Функция ЭтоФайловаяБаза(Знач ПутьКБазе)
	
	Если Не ЗначениеЗаполнено(ПутьКБазе) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПутьКБазе = ПолучитьПутьКБазе(ПутьКБазе);
	
	Возврат СтрНайти(ПутьКБазе, ":\") ИЛИ СтрНайти(ПутьКБазе, "$\") ИЛИ СтрНайти(ПутьКБазе, "\\");
	
КонецФункции

Функция ПолучитьСтрокуПодключенияКБазе(ПутьКБазе)
	
	Возврат ?(ЭтоФайловаяБаза(ПутьКБазе), " /F", " /S") + ЗаключитьСтрокуВКавычки(ПолучитьПутьКБазе(ПутьКБазе));
	
КонецФункции

Функция апк_ФайлСуществует(ИмяФайла)
	
	Файл = Новый Файл(ИмяФайла);
	Возврат Файл.Существует();
	
КонецФункции

// Удаляет в попытке указанный файл или каталог.
// Действует аналогично методу УдалитьФайлы().
//
Процедура апк_ФайлУдалить(ИмяФайла, Маска = "")
	
	Если НЕ апк_ФайлСуществует(ИмяФайла) Тогда
		Возврат;
	КонецЕсли;
		
	Попытка
		УдалитьФайлы(ИмяФайла, Маска);
	Исключение
		// АПК:280 - обработка исключения не требуется.
	КонецПопытки;
	
КонецПроцедуры

Процедура апк_КаталогКопировать(Источник, Приемник)
	
	НайденныеФайлы = НайтиФайлы(Источник, "*");
	
	Для Каждого Файл Из НайденныеФайлы Цикл
		ИмяФайлаИсточника = Файл.ПолноеИмя;
		ИмяФайлаПриемника = СтрЗаменить(ИмяФайлаИсточника, Источник, Приемник);
		
		Если Файл.ЭтоКаталог() Тогда
			СоздатьКаталог(ИмяФайлаПриемника);
			апк_КаталогКопировать(ИмяФайлаИсточника, ИмяФайлаПриемника);
		Иначе
			КопироватьФайл(ИмяФайлаИсточника, ИмяФайлаПриемника);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СкопироватьКаталогВыгрузки(Источник, Приемник) Экспорт
	
	Попытка
		апк_КаталогКопировать(Источник, Приемник);
	Исключение
		// АПК:280 - обработка исключения не требуется.
	КонецПопытки;
	
КонецПроцедуры

Процедура СкопироватьФайлЛога(ФайлЛога)
	
	ФайлЛогаКопия = апк_ПолучитьИмяВременногоФайла("txt");
	КопироватьФайл(ФайлЛога, ФайлЛогаКопия);
	
КонецПроцедуры

Процедура ОчиститьКаталогиВыгрузки(Маска = "*")
	
	// В режиме отладки каталоги выгрузки и загрузки не очищаем.
	Если РежимОтладки Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		УдалитьФайлы(КаталогВыгрузки, Маска);
		УдалитьФайлы(КаталогВыгрузкиРезультат, Маска);
	Исключение
		// АПК:280 - обработка исключения не требуется.
	КонецПопытки;
	
КонецПроцедуры

Функция ЗаключитьСтрокуВКавычки(Строка)
	
	Возврат """" + Строка + """";
	
КонецФункции

Функция ОтредактироватьПутьККаталогу(Каталог)
	
	Если НЕ СтрЗаканчиваетсяНа(Каталог, РазделительПути) Тогда
		Каталог = Каталог + РазделительПути;
	КонецЕсли;
	
	Возврат Каталог;
	
КонецФункции

// Получает текст переданного файла.
//
Функция ПолучитьТекстФайла(ПолноеИмяФайла, КодировкаФайла = "", УдалитьФайл = Истина)
	
	// Получаем текст.
	ДокументТекст = ПолучитьТекстовыйДокументИзФайла(ПолноеИмяФайла, КодировкаФайла);
	Текст = ?(ДокументТекст = Неопределено, "", ДокументТекст.ПолучитьТекст());
	
	Если УдалитьФайл Тогда
		апк_ФайлУдалить(ПолноеИмяФайла);
	КонецЕсли;
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Процедура ЗаписатьТекстовыйФайл(ПолноеИмяФайла, ТекстДляЗаписи, ПараметрыЗаписи = Неопределено)
	
	Поток = Новый ФайловыйПоток(ПолноеИмяФайла, РежимОткрытияФайла.Создать);
	
	Если ПараметрыЗаписи = Неопределено Тогда
		ЗаписьТекста = Новый ЗаписьТекста(Поток);
	Иначе
		ЗаписьТекста = Новый ЗаписьТекста(Поток, ПараметрыЗаписи.Кодировка, ПараметрыЗаписи.РазделительСтрок,,
			ПараметрыЗаписи.ДобавлятьBOM);
	КонецЕсли;
	
	ЗаписьТекста.Записать(ТекстДляЗаписи);
	ЗаписьТекста.Закрыть();
	
	Поток.Закрыть();
	
КонецПроцедуры

// Получает путь к временному файлу в родительском каталоге выгрузки.
//
Функция апк_ПолучитьИмяВременногоФайла(Расширение = "")
	
	КаталогВыгрузкиРодитель = ПолучитьКаталогФайла(КаталогВыгрузки);
	
	ИмяФайла = ПолучитьИмяВременногоФайла(Расширение);
	Файл = Новый Файл(ИмяФайла);
	
	Возврат КаталогВыгрузкиРодитель + Файл.Имя;
	
КонецФункции

Функция ОпределитьBOMФайла(ПолноеИмяФайла)
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
	Возврат КодировкаИзДвоичныхДанных(ДвоичныеДанные);
	
КонецФункции

// Возвращает кодировку, полученную из двоичных данных файла, если
// файл содержит сигнатуру BOM в начале.
//
// Параметры:
//   ДвоичныеДанные - ДвоичныеДанные - двоичные данные файла.
//
// Возвращаемое значение:
//   Строка - кодировка файла. Если файл не содержит сигнатуру BOM, 
//            возвращает пустую строку.
//
Функция КодировкаИзДвоичныхДанных(ДвоичныеДанные)
	
	ЧтениеДанных        = Новый ЧтениеДанных(ДвоичныеДанные);
	БуферДвоичныхДанных = ЧтениеДанных.ПрочитатьВБуферДвоичныхДанных(5);
	
	Возврат КодировкаBOM(БуферДвоичныхДанных);
	
КонецФункции

Функция КодировкаBOM(БуферДвоичныхДанных)
	
	ПрочитанныеБайты = Новый Массив(5);
	Для Индекс = 0 По 4 Цикл
		Если Индекс < БуферДвоичныхДанных.Размер Тогда
			ПрочитанныеБайты[Индекс] = БуферДвоичныхДанных[Индекс];
		Иначе
			ПрочитанныеБайты[Индекс] = ЧислоИзШестнадцатеричнойСтроки("0xA5");
		КонецЕсли;
	КонецЦикла;
	
	Если ПрочитанныеБайты[0] = ЧислоИзШестнадцатеричнойСтроки("0xFE")
	   И ПрочитанныеБайты[1] = ЧислоИзШестнадцатеричнойСтроки("0xFF") Тогда
		Кодировка = "UTF-16BE";
	ИначеЕсли ПрочитанныеБайты[0] = ЧислоИзШестнадцатеричнойСтроки("0xFF")
			И ПрочитанныеБайты[1] = ЧислоИзШестнадцатеричнойСтроки("0xFE") Тогда
		Если ПрочитанныеБайты[2] = ЧислоИзШестнадцатеричнойСтроки("0x00")
		   И ПрочитанныеБайты[3] = ЧислоИзШестнадцатеричнойСтроки("0x00") Тогда
			Кодировка = "UTF-32LE";
		Иначе
			Кодировка = "UTF-16LE";
		КонецЕсли;
	ИначеЕсли ПрочитанныеБайты[0] = ЧислоИзШестнадцатеричнойСтроки("0xEF")
			И ПрочитанныеБайты[1] = ЧислоИзШестнадцатеричнойСтроки("0xBB")
			И ПрочитанныеБайты[2] = ЧислоИзШестнадцатеричнойСтроки("0xBF") Тогда
		Кодировка = "UTF-8";
	ИначеЕсли ПрочитанныеБайты[0] = ЧислоИзШестнадцатеричнойСтроки("0x00")
			И ПрочитанныеБайты[1] = ЧислоИзШестнадцатеричнойСтроки("0x00")
			И ПрочитанныеБайты[2] = ЧислоИзШестнадцатеричнойСтроки("0xFE")
			И ПрочитанныеБайты[3] = ЧислоИзШестнадцатеричнойСтроки("0xFF") Тогда
		Кодировка = "UTF-32BE";
	ИначеЕсли ПрочитанныеБайты[0] = ЧислоИзШестнадцатеричнойСтроки("0x0E")
			И ПрочитанныеБайты[1] = ЧислоИзШестнадцатеричнойСтроки("0xFE")
			И ПрочитанныеБайты[2] = ЧислоИзШестнадцатеричнойСтроки("0xFF") Тогда
		Кодировка = "SCSU";
	ИначеЕсли ПрочитанныеБайты[0] = ЧислоИзШестнадцатеричнойСтроки("0xFB")
			И ПрочитанныеБайты[1] = ЧислоИзШестнадцатеричнойСтроки("0xEE")
			И ПрочитанныеБайты[2] = ЧислоИзШестнадцатеричнойСтроки("0x28") Тогда
		Кодировка = "BOCU-1";
	ИначеЕсли ПрочитанныеБайты[0] = ЧислоИзШестнадцатеричнойСтроки("0x2B")
		И ПрочитанныеБайты[1] = ЧислоИзШестнадцатеричнойСтроки("0x2F")
		И ПрочитанныеБайты[2] = ЧислоИзШестнадцатеричнойСтроки("0x76")
		И (ПрочитанныеБайты[3] = ЧислоИзШестнадцатеричнойСтроки("0x38")
			Или ПрочитанныеБайты[3] = ЧислоИзШестнадцатеричнойСтроки("0x39")
			Или ПрочитанныеБайты[3] = ЧислоИзШестнадцатеричнойСтроки("0x2B")
			Или ПрочитанныеБайты[3] = ЧислоИзШестнадцатеричнойСтроки("0x2F")) Тогда
		Кодировка = "UTF-7";
	ИначеЕсли ПрочитанныеБайты[0] = ЧислоИзШестнадцатеричнойСтроки("0xDD")
			И ПрочитанныеБайты[1] = ЧислоИзШестнадцатеричнойСтроки("0x73")
			И ПрочитанныеБайты[2] = ЧислоИзШестнадцатеричнойСтроки("0x66")
			И ПрочитанныеБайты[3] = ЧислоИзШестнадцатеричнойСтроки("0x73") Тогда
		Кодировка = "UTF-EBCDIC";
	Иначе
		Кодировка = "";
	КонецЕсли;
	
	Возврат Кодировка;
	
КонецФункции

Функция ОпределитьСимволыОтступа(ПолноеИмяФайла)
	
	ДокументТекст = ПолучитьТекстовыйДокументИзФайла(ПолноеИмяФайла, КодировкаТекста.UTF8);
	
	СимволыОтступа = "";
	Если ДокументТекст <> Неопределено Тогда
		Для Счетчик = 1 По ДокументТекст.КоличествоСтрок() Цикл
			
			СтрокаТекста = ДокументТекст.ПолучитьСтроку(Счетчик);
			СтрокаТекстаСокрЛ = СокрЛ(СтрокаТекста);
			Если СтрокаТекста = СтрокаТекстаСокрЛ Тогда
				Продолжить;
			КонецЕсли;
			
			КоличествоСокращенныхСимволов = СтрДлина(СтрокаТекста) - СтрДлина(СтрокаТекстаСокрЛ);
			Если КоличествоСокращенныхСимволов > 0 Тогда
				СимволыОтступа = Лев(СтрокаТекста, КоличествоСокращенныхСимволов);
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Если СимволыОтступа = "" Тогда
		// Если не удалось определить, устанавливаем по умолчанию.
		СимволыОтступа = ?(ЭтоВыгрузкаXMLФайлов(), Символы.Таб, "  ");
	КонецЕсли;
	
	Возврат СимволыОтступа;
	
КонецФункции

#КонецОбласти

#Область ПолучениеСтруктурыКонфигурации

Процедура ЗагрузитьСтруктуруКонфигурации() Экспорт
	
	Если СтруктураКонфигурации.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоВыгрузкаXMLФайлов() Тогда
		ЗагрузитьСтруктуруКонфигурацииXML();
	Иначе
		ЗагрузитьСтруктуруКонфигурацииEDT();
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТаблицуТиповОбъектовДляДереваКонфигурации()
	
	ТаблицаТиповОбъектовДляДереваКонфигурации = Контекст["ТаблицаТиповОбъектовДляДереваКонфигурации"];
	Если ТаблицаТиповОбъектовДляДереваКонфигурации <> Неопределено Тогда
		Возврат ТаблицаТиповОбъектовДляДереваКонфигурации;
	КонецЕсли;
	
	ТаблицаТиповОбъектовДляДереваКонфигурации = Новый ТаблицаЗначений;
	ТаблицаТиповОбъектовДляДереваКонфигурации.Колонки.Добавить("Родитель");
	ТаблицаТиповОбъектовДляДереваКонфигурации.Колонки.Добавить("ТипОбъектаРус");
	ТаблицаТиповОбъектовДляДереваКонфигурации.Колонки.Добавить("ТипОбъектаАнгл");
	ТаблицаТиповОбъектовДляДереваКонфигурации.Колонки.Добавить("ТипОбъектаРусМнФормы");
	ТаблицаТиповОбъектовДляДереваКонфигурации.Колонки.Добавить("ТипОбъектаАнглМнФормы");
	ТаблицаТиповОбъектовДляДереваКонфигурации.Колонки.Добавить("ТаблицаПодчиненныхТипов");
	
	ТаблицаПодчиненныхТиповШаблон = Новый ТаблицаЗначений;
	ТаблицаПодчиненныхТиповШаблон.Колонки.Добавить("ТипПодчиненногоОбъекта");
	ТаблицаПодчиненныхТиповШаблон.Колонки.Добавить("ТипПодчиненногоОбъектаАнгл");
	ТаблицаПодчиненныхТиповШаблон.Колонки.Добавить("ТипПодчиненногоОбъектаАнглМнФормы");
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "Подсистема";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "ОбщийМодуль";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "ПараметрСеанса";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "Роль";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "ОбщийРеквизит";
	
	// Планы обмена.
	ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТиповШаблон.Скопировать();
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Реквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "СтандартныйРеквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "ТабличнаяЧасть";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Форма";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Команда";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Макет";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "ПланОбмена";
	НовыйТипОбъектов.ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТипов;
	
	// Критерии отбора.
	ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТиповШаблон.Скопировать();
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Форма";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Команда";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "КритерийОтбора";
	НовыйТипОбъектов.ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТипов;
	
	// Подписки на события.
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "ПодпискаНаСобытие";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "РегламентноеЗадание";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "ФункциональнаяОпция";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "ПараметрФункциональныхОпций";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "ОпределяемыйТип";
	
	// Хранилища настроек.
	ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТиповШаблон.Скопировать();
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Форма";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Макет";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "ХранилищеНастроек";
	НовыйТипОбъектов.ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТипов;
	
	// Общие формы.
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "ОбщаяФорма";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "ОбщаяКоманда";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "ГруппаКоманд";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "Интерфейс";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "ОбщийМакет";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "ОбщаяКартинка";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "ПакетXDTO";
	
	// Web-сервисы.
	ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТиповШаблон.Скопировать();
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Операция";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "WebСервис";
	НовыйТипОбъектов.ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТипов;
	
	// HTTP-Сервисы.
	ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТиповШаблон.Скопировать();
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "ШаблонURL";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "HTTPСервис";
	НовыйТипОбъектов.ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТипов;
	
	// WS-Ссылки.
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "WSСсылка";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "ЭлементСтиля";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "Стиль";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "Язык";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "Константа";
	
	// Справочники.
	ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТиповШаблон.Скопировать();
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Реквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "СтандартныйРеквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "ТабличнаяЧасть";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Форма";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Команда";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Макет";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "ПредопределенныйЭлемент";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "Справочник";
	НовыйТипОбъектов.ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТипов;
	
	// Документы.
	ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТиповШаблон.Скопировать();
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Реквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "СтандартныйРеквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "ТабличнаяЧасть";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Форма";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Команда";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Макет";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "Документ";
	НовыйТипОбъектов.ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТипов;
	
	// Журналы документов.
	ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТиповШаблон.Скопировать();
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Графа";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "СтандартныйРеквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Форма";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Команда";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Макет";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "ЖурналДокументов";
	НовыйТипОбъектов.ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТипов;
	
	// Перечисления.
	ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТиповШаблон.Скопировать();
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Значение";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "СтандартныйРеквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Форма";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Команда";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Макет";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "Перечисление";
	НовыйТипОбъектов.ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТипов;
	
	// Отчеты.
	ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТиповШаблон.Скопировать();
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Реквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "ТабличнаяЧасть";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Форма";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Команда";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Макет";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "Отчет";
	НовыйТипОбъектов.ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТипов;
	
	// Обработки.
	ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТиповШаблон.Скопировать();
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Реквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "ТабличнаяЧасть";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Форма";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Команда";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Макет";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "Обработка";
	НовыйТипОбъектов.ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТипов;
	
	// Планы видов характеристик.
	ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТиповШаблон.Скопировать();
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Реквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "СтандартныйРеквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "ТабличнаяЧасть";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Форма";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Команда";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Макет";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "ПредопределенныйЭлемент";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "ПланВидовХарактеристик";
	НовыйТипОбъектов.ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТипов;
	
	// Планы счетов.
	ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТиповШаблон.Скопировать();
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Реквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "СтандартныйРеквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "ТабличнаяЧасть";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "СтандартнаяТабличнаяЧасть";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Форма";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Команда";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Макет";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "ПредопределенныйЭлемент";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "ПланСчетов";
	НовыйТипОбъектов.ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТипов;
	
	// Планы видов расчета.
	ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТиповШаблон.Скопировать();
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Реквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "СтандартныйРеквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "ТабличнаяЧасть";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "СтандартнаяТабличнаяЧасть";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Форма";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Команда";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Макет";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "ПредопределенныйЭлемент";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "ПланВидовРасчета";
	НовыйТипОбъектов.ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТипов;
	
	// Регистры сведений.
	ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТиповШаблон.Скопировать();
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Измерение";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Ресурс";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Реквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "СтандартныйРеквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Форма";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Команда";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Макет";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "РегистрСведений";
	НовыйТипОбъектов.ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТипов;
	
	// Регистры накопления.
	ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТиповШаблон.Скопировать();
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Измерение";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Ресурс";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Реквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "СтандартныйРеквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Форма";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Команда";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Макет";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "РегистрНакопления";
	НовыйТипОбъектов.ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТипов;
	
	// Регистры бухгалтерии.
	ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТиповШаблон.Скопировать();
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Измерение";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Ресурс";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Реквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "СтандартныйРеквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Форма";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Команда";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Макет";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "РегистрБухгалтерии";
	НовыйТипОбъектов.ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТипов;
	
	// Регистры расчета.
	ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТиповШаблон.Скопировать();
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Измерение";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Ресурс";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Реквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "СтандартныйРеквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Форма";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Команда";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Макет";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "РегистрРасчета";
	НовыйТипОбъектов.ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТипов;
	
	// Бизнес-процессы.
	ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТиповШаблон.Скопировать();
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Реквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "СтандартныйРеквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "ТабличнаяЧасть";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Форма";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Команда";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Макет";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "БизнесПроцесс";
	НовыйТипОбъектов.ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТипов;
	
	// Задачи.
	ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТиповШаблон.Скопировать();
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Реквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "СтандартныйРеквизит";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "ТабличнаяЧасть";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Форма";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Команда";
	ТаблицаПодчиненныхТипов.Добавить().ТипПодчиненногоОбъекта = "Макет";
	
	НовыйТипОбъектов = ТаблицаТиповОбъектовДляДереваКонфигурации.Добавить();
	НовыйТипОбъектов.ТипОбъектаРус = "Задача";
	НовыйТипОбъектов.ТаблицаПодчиненныхТипов = ТаблицаПодчиненныхТипов;
	
	ТаблицаТиповОбъектовИнициализировать();
	
	Для Каждого СтрокаТипаОбъектаДляДереваКонфигурации Из ТаблицаТиповОбъектовДляДереваКонфигурации Цикл
		
		ТипОбъектаРус = СтрокаТипаОбъектаДляДереваКонфигурации.ТипОбъектаРус;
		
		СтрокаТипаОбъекта = ТаблицаТиповОбъектов.Найти(ТипОбъектаРус, "Имя");
		Если СтрокаТипаОбъекта = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТипаОбъектаДляДереваКонфигурации.Родитель = СтрокаТипаОбъекта.Группа;
		СтрокаТипаОбъектаДляДереваКонфигурации.ТипОбъектаРусМнФормы = СтрокаТипаОбъекта.ИмяМнФормы;
		СтрокаТипаОбъектаДляДереваКонфигурации.ТипОбъектаАнгл = СтрокаТипаОбъекта.ИмяАнгл;
		СтрокаТипаОбъектаДляДереваКонфигурации.ТипОбъектаАнглМнФормы = СтрокаТипаОбъекта.ИмяАнглМнФормы;
		
		ТаблицаПодчиненныхТипов = СтрокаТипаОбъектаДляДереваКонфигурации.ТаблицаПодчиненныхТипов;
		Если ТаблицаПодчиненныхТипов = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаПодчиненногоТипа Из ТаблицаПодчиненныхТипов Цикл
			
			ТипОбъектаРус = СтрокаПодчиненногоТипа.ТипПодчиненногоОбъекта;
			
			СтрокаПодчиненногоТипаОбъекта = ТаблицаТиповОбъектов.Найти(ТипОбъектаРус, "Имя");
			Если СтрокаПодчиненногоТипаОбъекта = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаПодчиненногоТипа.ТипПодчиненногоОбъектаАнгл = СтрокаПодчиненногоТипаОбъекта.ИмяАнгл;
			СтрокаПодчиненногоТипа.ТипПодчиненногоОбъектаАнглМнФормы = СтрокаПодчиненногоТипаОбъекта.ИмяАнглМнФормы;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Контекст.Вставить("ТаблицаТиповОбъектовДляДереваКонфигурации", ТаблицаТиповОбъектовДляДереваКонфигурации);
	
	Возврат ТаблицаТиповОбъектовДляДереваКонфигурации;
	
КонецФункции

Функция ПолучитьНаименованиеСтандартногоРеквизита(НаименованиеСтандартногоРеквизитаАнгл)
	
	НаименованиеСтандартногоРеквизитаРус = ПолучитьТипОбъектаПоТаблицеТипов(НаименованиеСтандартногоРеквизитаАнгл,, "Имя");
	Возврат НаименованиеСтандартногоРеквизитаРус;
	
КонецФункции

Функция ПолучитьСтрокуДереваПоПравилуПоиска(Знач СтрокаДерева, Знач СтрокаПравилПоиска, Знач КолонкаПоиска = "ИмяНРег",
	РазделительСлов = ".")
	
	Если КолонкаПоиска = "ИмяНРег" Тогда
		СтрокаПравилПоиска = НРег(СтрокаПравилПоиска);
	КонецЕсли;
	
	МассивПравилПоиска = СтрРазделить(СтрокаПравилПоиска, РазделительСлов);
	Для Каждого ПравилоПоиска Из МассивПравилПоиска Цикл
		СтрокаДерева = СтрокаДерева.Строки.Найти(ПравилоПоиска, КолонкаПоиска);
		
		Если СтрокаДерева = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрокаДерева;
	
КонецФункции

Функция ПолучитьЯзыкиКонфигурации()
	
	Возврат ?(ЭтоВыгрузкаXMLФайлов(), ПолучитьЯзыкиКонфигурацииXML(), ПолучитьЯзыкиКонфигурацииEDT());
	
КонецФункции

#Область ПолучениеСтруктурыКонфигурацииXML

Процедура ЗагрузитьСтруктуруКонфигурацииXML()
	
	КаталогВыгрузкиКопия = ОтредактироватьПутьККаталогу(КаталогВыгрузкиРезультат);
	
	ПутьКФайлуКонфигурации = КаталогВыгрузкиКопия + "Configuration.xml";
	Если НЕ апк_ФайлСуществует(ПутьКФайлуКонфигурации) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаТиповОбъектовИнициализировать();
	ТаблицаТиповОбъектовДляДереваКонфигурации = ПолучитьТаблицуТиповОбъектовДляДереваКонфигурации();
	
	ДеревоДанных = XML_РазобратьФайлВыгрузки(ПутьКФайлуКонфигурации);
	
	НаименованиеКонфигурации = ПолучитьНаименованиеКонфигурации(ДеревоДанных);
	
	СтрокаКонфигурации = СтруктураКонфигурации.Добавить();
	СтрокаКонфигурации.ТипОбъекта = "Конфигурация";
	СтрокаКонфигурации.Объект = НаименованиеКонфигурации + " (Конфигурация)";
	СтрокаКонфигурации.ПутьОбъекта = НаименованиеКонфигурации;
	СтрокаКонфигурации.ИД = Новый УникальныйИдентификатор;
	
	СтрокаПоискаОбъекты = "MetaDataObject.Configuration.ChildObjects";
	СтрокаДанныхОбъекты = ПолучитьСтрокуДереваПоПравилуПоиска(ДеревоДанных, СтрокаПоискаОбъекты);
	
	МассивСтандартныхРеквизитовДляПроверкиСуществования = Новый Массив;
	МассивСтандартныхРеквизитовДляПроверкиСуществования.Добавить("Родитель");
	МассивСтандартныхРеквизитовДляПроверкиСуществования.Добавить("Владелец");
	МассивСтандартныхРеквизитовДляПроверкиСуществования.Добавить("ЭтоГруппа");
	МассивСтандартныхРеквизитовДляПроверкиСуществования.Добавить("Код");
	МассивСтандартныхРеквизитовДляПроверкиСуществования.Добавить("Наименование");
	МассивСтандартныхРеквизитовДляПроверкиСуществования.Добавить("Parent");
	МассивСтандартныхРеквизитовДляПроверкиСуществования.Добавить("Owner");
	МассивСтандартныхРеквизитовДляПроверкиСуществования.Добавить("Code");
	МассивСтандартныхРеквизитовДляПроверкиСуществования.Добавить("Description");
	
	СтруктураПараметровДереваКонфигурации = Новый Структура;
	СтруктураПараметровДереваКонфигурации.Вставить("КаталогВыгрузки", КаталогВыгрузкиКопия);
	СтруктураПараметровДереваКонфигурации.Вставить("КаталогОбъектов", КаталогВыгрузкиКопия);
	СтруктураПараметровДереваКонфигурации.Вставить("ИДРодителя", "");
	СтруктураПараметровДереваКонфигурации.Вставить("ПутьРодителя", "");
	СтруктураПараметровДереваКонфигурации.Вставить("СтрокаДанныхОбъекты", СтрокаДанныхОбъекты);
	СтруктураПараметровДереваКонфигурации.Вставить("СтрокаОбщие", "");
	СтруктураПараметровДереваКонфигурации.Вставить("НаименованиеОбъекта", "");
	СтруктураПараметровДереваКонфигурации.Вставить("НаименованиеПодчиненногоОбъекта", "");
	СтруктураПараметровДереваКонфигурации.Вставить("ДобавлятьВеткуМетаданных", Истина);
	СтруктураПараметровДереваКонфигурации.Вставить("ТаблицаТиповОбъектовДляДереваКонфигурации", ТаблицаТиповОбъектовДляДереваКонфигурации);
	СтруктураПараметровДереваКонфигурации.Вставить("Родитель", "");
	СтруктураПараметровДереваКонфигурации.Вставить("ТипОбъектаРус", "");
	СтруктураПараметровДереваКонфигурации.Вставить("ТипОбъектаАнгл", "");
	СтруктураПараметровДереваКонфигурации.Вставить("ТипОбъектаРусМнФормы", "");
	СтруктураПараметровДереваКонфигурации.Вставить("ТипОбъектаАнглМнФормы", "");
	СтруктураПараметровДереваКонфигурации.Вставить("ТипОбъекта", "");
	СтруктураПараметровДереваКонфигурации.Вставить("ТаблицаПодчиненныхТипов", Новый ТаблицаЗначений);
	СтруктураПараметровДереваКонфигурации.Вставить("ТипПодчиненногоОбъекта", "");
	СтруктураПараметровДереваКонфигурации.Вставить("ТипПодчиненногоОбъектаАнгл", "");
	СтруктураПараметровДереваКонфигурации.Вставить("ТипПодчиненногоОбъектаАнглМнФормы", "");
	СтруктураПараметровДереваКонфигурации.Вставить("ДеревоДанных", Новый ДеревоЗначений);
	СтруктураПараметровДереваКонфигурации.Вставить("МассивСтандартныхРеквизитов", МассивСтандартныхРеквизитовДляПроверкиСуществования);
	
	ЗаполнитьСоставОбщихОбъектовКонфигурацииXML(СтруктураПараметровДереваКонфигурации);
	
	// Все объекты заполняем общей процедурой в цикле.
	СтруктураОтбораДереваКонфигурации = Новый Структура;
	СтруктураОтбораДереваКонфигурации.Вставить("Родитель", "");
	МассивТиповОбъектовДереваКонфигурации = ТаблицаТиповОбъектовДляДереваКонфигурации.НайтиСтроки(СтруктураОтбораДереваКонфигурации);
	Для Каждого СтрокаТипаОбъекта Из МассивТиповОбъектовДереваКонфигурации Цикл
		
		СтруктураПараметровДереваКонфигурации.КаталогОбъектов = КаталогВыгрузкиКопия;
		СтруктураПараметровДереваКонфигурации.ИДРодителя = "";
		СтруктураПараметровДереваКонфигурации.ПутьРодителя = "";
		СтруктураПараметровДереваКонфигурации.СтрокаДанныхОбъекты = СтрокаДанныхОбъекты;
		
		ЗаполнитьЗначенияСвойств(СтруктураПараметровДереваКонфигурации, СтрокаТипаОбъекта);
		СтруктураПараметровДереваКонфигурации.ТипОбъекта = СтрокаТипаОбъекта.ТипОбъектаРус;
		
		ЗаполнитьСоставОбъектовПоТипуXML(СтруктураПараметровДереваКонфигурации);
		
	КонецЦикла;
	
	СтруктураПараметровДереваКонфигурации.КаталогОбъектов = КаталогВыгрузкиКопия;
	СтруктураПараметровДереваКонфигурации.СтрокаДанныхОбъекты = СтрокаДанныхОбъекты;
	
	ЗаполнитьСоставПодсистемXML(СтруктураПараметровДереваКонфигурации);
	
КонецПроцедуры

Процедура ЗаполнитьСоставОбщихОбъектовКонфигурацииXML(СтруктураПараметровДереваКонфигурации)
	
	СтрокаДанныхОбъекты = СтруктураПараметровДереваКонфигурации.СтрокаДанныхОбъекты;
	
	ИДОбщие = Новый УникальныйИдентификатор;
	ПутьОбщие = "Общие";
	
	СтрокаОбщие = СтруктураКонфигурации.Добавить();
	СтрокаОбщие.ТипОбъекта = "ВеткаМетаданных";
	СтрокаОбщие.Объект = ПутьОбщие;
	СтрокаОбщие.ПутьОбъекта = ПутьОбщие;
	СтрокаОбщие.ИД = ИДОбщие;
	
	СтруктураПараметровДереваКонфигурации.СтрокаОбщие = СтрокаОбщие;
	
	КаталогОбъектов = СтруктураПараметровДереваКонфигурации.КаталогВыгрузки;
	
	ТаблицаТиповОбъектовДляДереваКонфигурации = СтруктураПараметровДереваКонфигурации.ТаблицаТиповОбъектовДляДереваКонфигурации;
	
	// Остальные объекты заполняем общей процедурой в цикле.
	СтруктураОтбораВеткаОбщие = Новый Структура;
	СтруктураОтбораВеткаОбщие.Вставить("Родитель", ПутьОбщие);
	МассивТиповОбъектовВеткаОбщие = ТаблицаТиповОбъектовДляДереваКонфигурации.НайтиСтроки(СтруктураОтбораВеткаОбщие);
	Для Каждого СтрокаТипаОбъекта Из МассивТиповОбъектовВеткаОбщие Цикл
		
		ТипОбъектаРус = СтрокаТипаОбъекта.ТипОбъектаРус;
		Если ТипОбъектаРус = "Подсистема" Тогда
			// Подсистемы пропускаем, для них есть отдельное заполнение.
			Продолжить;
		КонецЕсли;
		
		СтруктураПараметровДереваКонфигурации.СтрокаДанныхОбъекты = СтрокаДанныхОбъекты;
		СтруктураПараметровДереваКонфигурации.ИДРодителя = ИДОбщие;
		СтруктураПараметровДереваКонфигурации.ПутьРодителя = ПутьОбщие;
		СтруктураПараметровДереваКонфигурации.КаталогОбъектов = КаталогОбъектов;
		
		ЗаполнитьЗначенияСвойств(СтруктураПараметровДереваКонфигурации, СтрокаТипаОбъекта);
		СтруктураПараметровДереваКонфигурации.ТипОбъекта = ТипОбъектаРус;
		
		ЗаполнитьСоставОбъектовПоТипуXML(СтруктураПараметровДереваКонфигурации);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСоставОбъектовПоТипуXML(СтруктураПараметровДереваКонфигурации)
	
	ИДВетки = Новый УникальныйИдентификатор;
	
	СтрокаВеткиОбъектов = СтруктураКонфигурации.Добавить();
	СтрокаВеткиОбъектов.ТипОбъекта = "ВеткаМетаданных";
	СтрокаВеткиОбъектов.Объект = СтруктураПараметровДереваКонфигурации.ТипОбъектаРусМнФормы;
	СтрокаВеткиОбъектов.ПутьОбъекта = СтруктураПараметровДереваКонфигурации.ТипОбъектаРусМнФормы;
	СтрокаВеткиОбъектов.ИД = ИДВетки;
	СтрокаВеткиОбъектов.ИДРодителя = СтруктураПараметровДереваКонфигурации.ИДРодителя;
	
	СтрокаДанныхОбъекты = СтруктураПараметровДереваКонфигурации.СтрокаДанныхОбъекты;
	Если СтрокаДанныхОбъекты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипОбъектаАнгл = СтруктураПараметровДереваКонфигурации.ТипОбъектаАнгл;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Имя", ТипОбъектаАнгл);
	
	МассивСтрокОбъекты = СтрокаДанныхОбъекты.Строки.НайтиСтроки(СтруктураОтбора, Ложь);
	Если МассивСтрокОбъекты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТипОбъектаАнглМнФормы = СтруктураПараметровДереваКонфигурации.ТипОбъектаАнглМнФормы;
	КаталогОбъектов = СтруктураПараметровДереваКонфигурации.КаталогОбъектов + ТипОбъектаАнглМнФормы + РазделительПути;
	СтруктураПараметровДереваКонфигурации.КаталогОбъектов = КаталогОбъектов;
	
	ЭтоФорма = Ложь;
	Если СтруктураПараметровДереваКонфигурации.ТипОбъектаРус = "ОбщаяФорма" Тогда
		ЭтоФорма = Истина;
	КонецЕсли;
	
	ТипОбъекта = СтруктураПараметровДереваКонфигурации.ТипОбъекта;
	ТипОбъектаРусМнФормы = СтруктураПараметровДереваКонфигурации.ТипОбъектаРусМнФормы;
	
	Для Каждого СтрокаДанныхОбъект Из МассивСтрокОбъекты Цикл
		
		СтруктураПараметровДереваКонфигурации.Вставить("СтрокаДанныхОбъект", СтрокаДанныхОбъект);
		
		НаименованиеОбъекта = СтрокаДанныхОбъект.Значение;
		
		ИДОбъекта = Новый УникальныйИдентификатор;
		ПутьОбъекта = ТипОбъекта + "." + НаименованиеОбъекта;
		
		СтрокаДереваОбъект = СтруктураКонфигурации.Добавить();
		СтрокаДереваОбъект.ТипОбъекта = ТипОбъекта;
		СтрокаДереваОбъект.Объект = НаименованиеОбъекта;
		СтрокаДереваОбъект.ПутьОбъекта = ПутьОбъекта;
		СтрокаДереваОбъект.ИД = ИДОбъекта;
		СтрокаДереваОбъект.ИДРодителя = ИДВетки;
		
		СтруктураПараметровДереваКонфигурации.ИДРодителя = ИДОбъекта;
		СтруктураПараметровДереваКонфигурации.ПутьРодителя = ПутьОбъекта;
		
		ТаблицаПодчиненныхТипов = СтруктураПараметровДереваКонфигурации.ТаблицаПодчиненныхТипов;
		Если ТаблицаПодчиненныхТипов = Неопределено Тогда
			СтруктураПараметровДереваКонфигурации.ИДРодителя = ИДВетки;
			СтруктураПараметровДереваКонфигурации.ПутьРодителя = "";
			Продолжить;
		КонецЕсли;
		
		ФайлОбъекта = СтруктураПараметровДереваКонфигурации.КаталогОбъектов + НаименованиеОбъекта + ".xml";
		Если НЕ апк_ФайлСуществует(ФайлОбъекта) Тогда
			СтруктураПараметровДереваКонфигурации.ИДРодителя = ИДВетки;
			СтруктураПараметровДереваКонфигурации.ПутьРодителя = "";
			Продолжить;
		КонецЕсли;
		
		ДеревоДанных = XML_РазобратьФайлВыгрузки(ФайлОбъекта);
		СтруктураПараметровДереваКонфигурации.ДеревоДанных = ДеревоДанных;
		СтруктураПараметровДереваКонфигурации.НаименованиеОбъекта = НаименованиеОбъекта;
		
		Для Каждого СтрокаПодчиненногоТипа Из ТаблицаПодчиненныхТипов Цикл
			
			ЗаполнитьЗначенияСвойств(СтруктураПараметровДереваКонфигурации, СтрокаПодчиненногоТипа);
			
			ЗаполнитьСоставПодчиненныхОбъектов(СтруктураПараметровДереваКонфигурации);
			
		КонецЦикла;
		
		СтруктураПараметровДереваКонфигурации.ИДРодителя = ИДВетки;
		СтруктураПараметровДереваКонфигурации.ПутьРодителя = "";
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСоставПодчиненныхОбъектов(СтруктураПараметровДереваКонфигурации)
	
	СтрокаДанныхОбъект = СтруктураПараметровДереваКонфигурации.СтрокаДанныхОбъект;
	ДеревоДанных = СтруктураПараметровДереваКонфигурации.ДеревоДанных;
	
	ТипОбъекта = СтруктураПараметровДереваКонфигурации.ТипОбъекта;
	ТипОбъектаАнгл = СтруктураПараметровДереваКонфигурации.ТипОбъектаАнгл;
	ТипПодчиненногоОбъекта = СтруктураПараметровДереваКонфигурации.ТипПодчиненногоОбъекта;
	ТипПодчиненногоОбъектаАнгл = СтруктураПараметровДереваКонфигурации.ТипПодчиненногоОбъектаАнгл;
	ТипПодчиненногоОбъектаАнглМнФормы = СтруктураПараметровДереваКонфигурации.ТипПодчиненногоОбъектаАнглМнФормы;
	ИДРодителя = СтруктураПараметровДереваКонфигурации.ИДРодителя;
	ПутьРодителя = СтруктураПараметровДереваКонфигурации.ПутьРодителя;
	
	ЭтоСтандартныйРеквизит = (ТипПодчиненногоОбъекта = "СтандартныйРеквизит");
	ЭтоСтандартнаяТабличнаяЧасть = (ТипПодчиненногоОбъекта = "СтандартнаяТабличнаяЧасть");
	
	Если ЭтоСтандартныйРеквизит ИЛИ ЭтоСтандартнаяТабличнаяЧасть Тогда
		ТипПодчиненногоОбъектаАнгл = "xr:" + ТипПодчиненногоОбъектаАнгл;
		СтрокаПоискаПодчиненныеОбъекты = СтрШаблон("MetaDataObject.%1.Properties.%2", ТипОбъектаАнгл, ТипПодчиненногоОбъектаАнглМнФормы);
	Иначе
		СтрокаПоискаПодчиненныеОбъекты = СтрШаблон("MetaDataObject.%1.ChildObjects", ТипОбъектаАнгл);
	КонецЕсли;
	
	СтрокаДанныхПодчиненныеОбъекты = ПолучитьСтрокуДереваПоПравилуПоиска(ДеревоДанных, СтрокаПоискаПодчиненныеОбъекты);
	Если СтрокаДанныхПодчиненныеОбъекты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДанныхПодчиненныеОбъекты = Новый Структура;
	СтруктураДанныхПодчиненныеОбъекты.Вставить("Имя", ТипПодчиненногоОбъектаАнгл);
	
	МассивДанныхПодчиненныеОбъекты = СтрокаДанныхПодчиненныеОбъекты.Строки.НайтиСтроки(СтруктураДанныхПодчиненныеОбъекты);
	Если МассивДанныхПодчиненныеОбъекты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КаталогОбъектов = СтруктураПараметровДереваКонфигурации.КаталогОбъектов;
	НаименованиеОбъекта = СтруктураПараметровДереваКонфигурации.НаименованиеОбъекта;
	
	ЭтоФорма = (ТипПодчиненногоОбъекта = "Форма");
	ЭтоМакет = (ТипПодчиненногоОбъекта = "Макет");
	ЭтоТабличнаяЧасть = (ТипПодчиненногоОбъекта = "ТабличнаяЧасть");
	ЭтоОперацияWebСервиса = (ТипПодчиненногоОбъекта = "Операция");
	ЭтоШаблонURL = (ТипПодчиненногоОбъекта = "ШаблонURL");
	
	Для Каждого СтрокаДанныхПодчиненногоОбъекта Из МассивДанныхПодчиненныеОбъекты Цикл
		
		Если ЭтоФорма ИЛИ ЭтоМакет Тогда
			СтрокаДанныхПодчиненныйОбъект = СтрокаДанныхПодчиненногоОбъекта;
		ИначеЕсли ЭтоСтандартныйРеквизит ИЛИ ЭтоСтандартнаяТабличнаяЧасть Тогда
			СтрокаДанныхПодчиненныйОбъект = ПолучитьСтрокуДереваПоПравилуПоиска(СтрокаДанныхПодчиненногоОбъекта, "Атрибуты.name");
		Иначе
			СтрокаДанныхПодчиненныйОбъект = ПолучитьСтрокуДереваПоПравилуПоиска(СтрокаДанныхПодчиненногоОбъекта, "Properties.Name");
		КонецЕсли;
		
		Если СтрокаДанныхПодчиненныйОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НаименованиеПодчиненногоОбъекта = СтрокаДанныхПодчиненныйОбъект.Значение;
		
		Если ЭтоСтандартныйРеквизит ИЛИ ЭтоСтандартнаяТабличнаяЧасть Тогда
			
			НаименованиеПодчиненногоОбъекта = ПолучитьНаименованиеСтандартногоРеквизита(НаименованиеПодчиненногоОбъекта);
			
			СтруктураПараметровДереваКонфигурации.НаименованиеПодчиненногоОбъекта = НаименованиеПодчиненногоОбъекта;
			
			// Для стандартных реквизитов необходима дополнительная проверка существования.
			// Т.к. в XML выгружаются либо все стандартные реквизиты, либо ни одного.
			Если НЕ СтандартныйРеквизитСуществует(СтруктураПараметровДереваКонфигурации) Тогда
				// Если стандартный реквизит не существует, то пропускаем.
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		ИДОбъекта = Новый УникальныйИдентификатор;
		ПутьОбъекта = СтрШаблон("%1.%2.%3", ПутьРодителя, ТипПодчиненногоОбъекта, НаименованиеПодчиненногоОбъекта);
		
		СтрокаДереваПодчиненногоОбъекта = СтруктураКонфигурации.Добавить();
		СтрокаДереваПодчиненногоОбъекта.ТипОбъекта = ТипПодчиненногоОбъекта;
		СтрокаДереваПодчиненногоОбъекта.Объект = НаименованиеПодчиненногоОбъекта;
		СтрокаДереваПодчиненногоОбъекта.ПутьОбъекта = ПутьОбъекта;
		СтрокаДереваПодчиненногоОбъекта.ИД = ИДОбъекта;
		СтрокаДереваПодчиненногоОбъекта.ИДРодителя = ИДРодителя;
		
		// Проверяем реквизиты табличной части, операции web-сервиса и шаблоны URL.
		Если ЭтоТабличнаяЧасть ИЛИ ЭтоОперацияWebСервиса ИЛИ ЭтоШаблонURL Тогда
			
			СтрокаДанныхРеквизитыТабличнойЧасти = ПолучитьСтрокуДереваПоПравилуПоиска(СтрокаДанныхПодчиненногоОбъекта, "ChildObjects");
			Если СтрокаДанныхРеквизитыТабличнойЧасти = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ТипПодчиненногоОбъектаПодчиненногоОбъекта = "";
			ИмяПодчиненногоОбъектаПодчиненногоОбъектаАнгл = "";
			Если ЭтоТабличнаяЧасть Тогда
				ТипПодчиненногоОбъектаПодчиненногоОбъекта = "Реквизит";
				ИмяПодчиненногоОбъектаПодчиненногоОбъектаАнгл = "Attribute";
			ИначеЕсли ЭтоОперацияWebСервиса Тогда
				ТипПодчиненногоОбъектаПодчиненногоОбъекта = "Параметр";
				ИмяПодчиненногоОбъектаПодчиненногоОбъектаАнгл = "Parameter";
			ИначеЕсли ЭтоШаблонURL Тогда
				ТипПодчиненногоОбъектаПодчиненногоОбъекта = "МетодШаблонаURL";
				ИмяПодчиненногоОбъектаПодчиненногоОбъектаАнгл = "Method";
			Иначе
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьСоставПодчиненныхОбъектовПодчиненныхОбъектов(СтрокаДанныхРеквизитыТабличнойЧасти,
				ИДОбъекта,
				ПутьОбъекта,
				СтруктураПараметровДереваКонфигурации,
				ТипПодчиненногоОбъектаПодчиненногоОбъекта,
				ИмяПодчиненногоОбъектаПодчиненногоОбъектаАнгл);
			
			// Для табличной части необходимо также заполнить стандартные реквизиты, например, НомерСтроки.
			Если ЭтоТабличнаяЧасть Тогда
				
				СтрокаДанныхСтандартныеРеквизитыТабличнойЧасти = ПолучитьСтрокуДереваПоПравилуПоиска(СтрокаДанныхПодчиненногоОбъекта,
					"Properties.StandardAttributes");
				Если СтрокаДанныхСтандартныеРеквизитыТабличнойЧасти = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ЗаполнитьСоставПодчиненныхОбъектовПодчиненныхОбъектов(СтрокаДанныхСтандартныеРеквизитыТабличнойЧасти,
					ИДОбъекта,
					ПутьОбъекта,
					СтруктураПараметровДереваКонфигурации,
					"СтандартныйРеквизит",
					"xr:StandardAttribute");
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСоставПодчиненныхОбъектовПодчиненныхОбъектов(СтрокаДанных, ИДРодителя, ПутьРодителя,
	СтруктураПараметровДереваКонфигурации, ТипОбъекта, ИмяОбъектаАнгл)
	
	СтруктураДанныхПодчиненныхОбъектов = Новый Структура;
	СтруктураДанныхПодчиненныхОбъектов.Вставить("Имя", ИмяОбъектаАнгл);
	
	МассивДанныхПодчиненныхОбъектов = СтрокаДанных.Строки.НайтиСтроки(СтруктураДанныхПодчиненныхОбъектов);
	Если МассивДанныхПодчиненныхОбъектов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоСтандартныйРеквизит = (ТипОбъекта = "СтандартныйРеквизит");
	СтрокаПоиска = ?(ЭтоСтандартныйРеквизит, "Атрибуты.name", "Properties.Name");
	
	Для Каждого СтрокаДанныхПодчиненногоОбъекта Из МассивДанныхПодчиненныхОбъектов Цикл
		
		СтрокаДанныхИмениПодчиненногоОбъекта = ПолучитьСтрокуДереваПоПравилуПоиска(СтрокаДанныхПодчиненногоОбъекта, СтрокаПоиска);
		Если СтрокаДанныхИмениПодчиненногоОбъекта = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НаименованиеПодчиненногоОбъекта = СтрокаДанныхИмениПодчиненногоОбъекта.Значение;
		
		Если ЭтоСтандартныйРеквизит Тогда
			НаименованиеПодчиненногоОбъекта = ПолучитьНаименованиеСтандартногоРеквизита(НаименованиеПодчиненногоОбъекта);
		КонецЕсли;
		
		СтрокаДереваПодчиненногоОбъекта = СтруктураКонфигурации.Добавить();
		СтрокаДереваПодчиненногоОбъекта.ТипОбъекта = ТипОбъекта;
		СтрокаДереваПодчиненногоОбъекта.Объект = НаименованиеПодчиненногоОбъекта;
		СтрокаДереваПодчиненногоОбъекта.ПутьОбъекта = СтрШаблон("%1.%2.%3",
			ПутьРодителя, ТипОбъекта, НаименованиеПодчиненногоОбъекта);
		СтрокаДереваПодчиненногоОбъекта.ИД = Новый УникальныйИдентификатор;
		СтрокаДереваПодчиненногоОбъекта.ИДРодителя = ИДРодителя;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СтандартныйРеквизитСуществует(СтруктураПараметровДереваКонфигурации)
	
	РеквизитСуществует = Истина;
	
	НаименованиеСтандартногоРеквизита = СтруктураПараметровДереваКонфигурации.НаименованиеПодчиненногоОбъекта;
	
	МассивСтандартныхРеквизитов = СтруктураПараметровДереваКонфигурации.МассивСтандартныхРеквизитов;
	Если МассивСтандартныхРеквизитов.Найти(НаименованиеСтандартногоРеквизита) = Неопределено Тогда
		Возврат РеквизитСуществует;
	КонецЕсли;
	
	ДеревоДанных = СтруктураПараметровДереваКонфигурации.ДеревоДанных;
	ТипОбъекта = СтруктураПараметровДереваКонфигурации.ТипОбъекта;
	ТипОбъектаАнгл = СтруктураПараметровДереваКонфигурации.ТипОбъектаАнгл;
	
	// Проверяем наличие стандартного реквизита.
	Если (НаименованиеСтандартногоРеквизита = "Владелец") ИЛИ (НаименованиеСтандартногоРеквизита = "Owner") Тогда
		
		// Если это владелец, то проверяем наличие свойства "Владельцы".
		СтрокаПоиска = СтрШаблон("MetaDataObject.%1.Properties.Owners", ТипОбъектаАнгл);
		
		СтрокаДереваДанныхВладельцы = ПолучитьСтрокуДереваПоПравилуПоиска(ДеревоДанных, СтрокаПоиска);
		Если СтрокаДереваДанныхВладельцы = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		РеквизитСуществует = (СтрокаДереваДанныхВладельцы.Строки.Количество() > 0);
		
	ИначеЕсли (НаименованиеСтандартногоРеквизита = "Наименование") ИЛИ (НаименованиеСтандартногоРеквизита = "Description") Тогда
		
		// Если это код, то проверяем длину кода.
		СтрокаПоиска = СтрШаблон("MetaDataObject.%1.Properties.DescriptionLength", ТипОбъектаАнгл);
		
		СтрокаДереваДанныхДлинаНаименования = ПолучитьСтрокуДереваПоПравилуПоиска(ДеревоДанных, СтрокаПоиска);
		Если СтрокаДереваДанныхДлинаНаименования = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		СтрокаДереваДанныхДлинаНаименованияЗначение = СтрокаДереваДанныхДлинаНаименования.Значение;
		Если НЕ апк_ЭтоЧисло(СтрокаДереваДанныхДлинаНаименованияЗначение) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		РеквизитСуществует = Число(СтрокаДереваДанныхДлинаНаименованияЗначение) > 0;
		
	ИначеЕсли (НаименованиеСтандартногоРеквизита = "Код") ИЛИ (НаименованиеСтандартногоРеквизита = "Code") Тогда
		
		// Если это код, то проверяем длину кода.
		СтрокаПоиска = СтрШаблон("MetaDataObject.%1.Properties.CodeLength", ТипОбъектаАнгл);
		
		СтрокаДереваДанныхДлинаКода = ПолучитьСтрокуДереваПоПравилуПоиска(ДеревоДанных, СтрокаПоиска);
		Если СтрокаДереваДанныхДлинаКода = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		СтрокаДереваДанныхДлинаКодаЗначение = СтрокаДереваДанныхДлинаКода.Значение;
		Если НЕ апк_ЭтоЧисло(СтрокаДереваДанныхДлинаКодаЗначение) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		РеквизитСуществует = Число(СтрокаДереваДанныхДлинаКодаЗначение) > 0;
		
	ИначеЕсли (НаименованиеСтандартногоРеквизита = "Родитель") ИЛИ (НаименованиеСтандартногоРеквизита = "Parent") Тогда
		
		// Если это родитель, то проверяем свойство "Иерархия".
		СтрокаПоиска = СтрШаблон("MetaDataObject.%1.Properties.Hierarchical", ТипОбъектаАнгл);
		
		СтрокаДереваДанныхИерархия = ПолучитьСтрокуДереваПоПравилуПоиска(ДеревоДанных, СтрокаПоиска);
		Если СтрокаДереваДанныхИерархия = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		СтрокаДереваДанныхИерархияЗначение = СтрокаДереваДанныхИерархия.Значение;
		РеквизитСуществует = апк_ЭтоБулево(СтрокаДереваДанныхИерархияЗначение);
		
	ИначеЕсли (НаименованиеСтандартногоРеквизита = "ЭтоГруппа") ИЛИ (НаименованиеСтандартногоРеквизита = "IsFolder") Тогда
		
		// Если это группа, то проверяем свойство "Иерархия".
		СтрокаПоиска = СтрШаблон("MetaDataObject.%1.Properties.Hierarchical", ТипОбъектаАнгл);
		
		СтрокаДереваДанныхИерархия = ПолучитьСтрокуДереваПоПравилуПоиска(ДеревоДанных, СтрокаПоиска);
		Если СтрокаДереваДанныхИерархия = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		СтрокаДереваДанныхИерархияЗначение = СтрокаДереваДанныхИерархия.Значение;
		СтрокаДереваДанныхИерархияЗначение = апк_ЭтоБулево(СтрокаДереваДанныхИерархияЗначение);
		
		// Если есть иерархия, то проверяем ее значение.
		Если НЕ СтрокаДереваДанныхИерархияЗначение Тогда
			Возврат Ложь;
		КонецЕсли;
		
		// Для планов видов характеристик достаточно, чтобы была иерархия, остальные свойства не проверяем.
		Если ТипОбъекта = "ПланВидовХарактеристик" Тогда
			Возврат РеквизитСуществует;
		КонецЕсли;
		
		СтрокаПоиска = СтрШаблон("MetaDataObject.%1.Properties.HierarchyType", ТипОбъектаАнгл);
		
		СтрокаДереваДанныхТипИерархии = ПолучитьСтрокуДереваПоПравилуПоиска(ДеревоДанных, СтрокаПоиска);
		Если СтрокаДереваДанныхТипИерархии = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		РеквизитСуществует = (СтрокаДереваДанныхТипИерархии.Значение = "HierarchyFoldersAndItems");
		
	КонецЕсли;
	
	Возврат РеквизитСуществует;
	
КонецФункции

Функция ПолучитьНаименованиеКонфигурации(ДеревоДанных)
	
	НаименованиеКонфигурации = "Конфигурация";
	
	СтрокаПоискаНаименование = "MetaDataObject.Configuration.Properties.Name";
	СтрокаДанныхНаименование = ПолучитьСтрокуДереваПоПравилуПоиска(ДеревоДанных, СтрокаПоискаНаименование);
	Если СтрокаДанныхНаименование <> Неопределено Тогда
		НаименованиеКонфигурации = СтрокаДанныхНаименование.Значение;
	КонецЕсли;
	
	Возврат НаименованиеКонфигурации;
	
КонецФункции

Процедура ЗаполнитьСоставПодсистемXML(СтруктураПараметровДереваКонфигурации)
	
	ИДРодителя = СтруктураПараметровДереваКонфигурации.ИДРодителя;
	ПутьРодителя = СтруктураПараметровДереваКонфигурации.ПутьРодителя;
	
	ДобавлятьВеткуМетаданных = СтруктураПараметровДереваКонфигурации.ДобавлятьВеткуМетаданных;
	Если ДобавлятьВеткуМетаданных Тогда
		
		СтруктураПараметровДереваКонфигурации.ТипОбъекта = "Подсистема";
		СтруктураПараметровДереваКонфигурации.ТипОбъектаРус = "Подсистема";
		СтруктураПараметровДереваКонфигурации.ТипОбъектаРусМнФормы = "Подсистемы";
		СтруктураПараметровДереваКонфигурации.ТипОбъектаАнгл = "Subsystem";
		СтруктураПараметровДереваКонфигурации.ТипОбъектаАнглМнФормы = "Subsystems";
		
		ИД = Новый УникальныйИдентификатор;
		ПутьРодителя = СтруктураПараметровДереваКонфигурации.ТипОбъектаРусМнФормы;
		
		СтрокаОбъекта = СтруктураКонфигурации.Вставить(2);
		СтрокаОбъекта.ТипОбъекта = "ВеткаМетаданных";
		СтрокаОбъекта.Объект = СтруктураПараметровДереваКонфигурации.ТипОбъектаРусМнФормы;
		СтрокаОбъекта.ПутьОбъекта = ПутьРодителя;
		СтрокаОбъекта.ИД = ИД;
		СтрокаОбъекта.ИДРодителя = СтруктураПараметровДереваКонфигурации.СтрокаОбщие.ИД;;
		
		ИДРодителя = ИД;
		ПутьРодителя = "";
		
	КонецЕсли;
	
	СтрокаДанныхОбъекты = СтруктураПараметровДереваКонфигурации.СтрокаДанныхОбъекты;
	Если СтрокаДанныхОбъекты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипОбъекта = СтруктураПараметровДереваКонфигурации.ТипОбъекта;
	ТипОбъектаАнгл = СтруктураПараметровДереваКонфигурации.ТипОбъектаАнгл;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Имя", ТипОбъектаАнгл);
	
	МассивСтрокОбъекты = СтрокаДанныхОбъекты.Строки.НайтиСтроки(СтруктураОтбора, Ложь);
	Если МассивСтрокОбъекты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТипОбъектаАнглМнФормы = СтруктураПараметровДереваКонфигурации.ТипОбъектаАнглМнФормы;
	ТипОбъектаРусМнФормы = СтруктураПараметровДереваКонфигурации.ТипОбъектаРусМнФормы;
	
	КаталогОбъектов = СтруктураПараметровДереваКонфигурации.КаталогОбъектов + ТипОбъектаАнглМнФормы + РазделительПути;
	
	Для Каждого СтрокаДанныхОбъект Из МассивСтрокОбъекты Цикл
		
		НаименованиеОбъекта = СтрокаДанныхОбъект.Значение;
		
		ИДОбъекта = Новый УникальныйИдентификатор;
		ПутьОбъекта = СтрШаблон("%1.%2", ПутьРодителя, НаименованиеОбъекта);
		ПутьОбъекта = СтрСоединить(СтрРазделить(ПутьОбъекта, ".", Ложь), ".");
		
		СтрокаДереваОбъект = СтруктураКонфигурации.Добавить();
		СтрокаДереваОбъект.ТипОбъекта = ТипОбъекта;
		СтрокаДереваОбъект.Объект = НаименованиеОбъекта;
		СтрокаДереваОбъект.ПутьОбъекта = ПутьОбъекта;
		СтрокаДереваОбъект.ИД = ИДОбъекта;
		СтрокаДереваОбъект.ИДРодителя = ИДРодителя;
		
		ФайлОбъекта = КаталогОбъектов + НаименованиеОбъекта + ".xml";
		
		ДеревоДанных = XML_РазобратьФайлВыгрузки(ФайлОбъекта);
		ЗаполнитьСоставОбъектовПодсистемы(СтрокаДереваОбъект, ДеревоДанных);
		
		СтрокаПоискаОбъекты = СтрШаблон("MetaDataObject.%1.ChildObjects", ТипОбъектаАнгл);
		СтрокаДанныхОбъекты = ПолучитьСтрокуДереваПоПравилуПоиска(ДеревоДанных, СтрокаПоискаОбъекты);
		Если СтрокаДанныхОбъекты = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДанныхОбъекты.Строки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		КаталогОбъекта = КаталогОбъектов + НаименованиеОбъекта + РазделительПути;
		
		СтруктураПараметровДереваКонфигурации.ИДРодителя = ИДОбъекта;
		СтруктураПараметровДереваКонфигурации.ПутьРодителя = ПутьОбъекта;
		СтруктураПараметровДереваКонфигурации.КаталогОбъектов = КаталогОбъекта;
		СтруктураПараметровДереваКонфигурации.ДобавлятьВеткуМетаданных = Ложь;
		СтруктураПараметровДереваКонфигурации.СтрокаДанныхОбъекты = СтрокаДанныхОбъекты;
		
		ЗаполнитьСоставПодсистемXML(СтруктураПараметровДереваКонфигурации);
		
		СтруктураПараметровДереваКонфигурации.КаталогОбъектов = КаталогОбъектов;
		СтруктураПараметровДереваКонфигурации.СтрокаДанныхОбъекты = СтрокаДанныхОбъекты;
		
	КонецЦикла;
	
	СтрокаОбъектыБезПодсистем = СтруктураКонфигурации.Добавить();
	СтрокаОбъектыБезПодсистем.Объект = НСтр("ru='<Не входящие в подсистемы>'; en='<Не входящие в подсистемы>'",
		КодОсновногоЯзыка);
	
КонецПроцедуры

Процедура ЗаполнитьСоставОбъектовПодсистемы(СтрокаДереваПодсистема, ДеревоДанныхПодсистемы)
	
	СтрокаПоискаСостав = "MetaDataObject.Subsystem.Properties.Content";
	СтрокаДанныхСостав = ПолучитьСтрокуДереваПоПравилуПоиска(ДеревоДанныхПодсистемы, СтрокаПоискаСостав);
	Если СтрокаДанныхСостав = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаДанныхСостав.Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаДанныхОбъекта Из СтрокаДанныхСостав.Строки Цикл
		
		ПутьОбъектаАнгл = СтрокаДанныхОбъекта.Значение;
		МассивПутиАнгл = СтрРазделить(ПутьОбъектаАнгл, ".");
		Если МассивПутиАнгл.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		МассивПутиАнгл[0] = ПолучитьТипОбъектаПоТаблицеТипов(МассивПутиАнгл[0]);
		
		ПутьОбъекта = СтрСоединить(МассивПутиАнгл, ".");
		СтрокаСтруктурыКонфигурации = СтруктураКонфигурации.Найти(ПутьОбъекта, "ПутьОбъекта");
		Если СтрокаСтруктурыКонфигурации = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы = СоставПодсистем.Добавить();
		СтрокаТаблицы.ИДПодсистемы = СтрокаДереваПодсистема.ИД;
		СтрокаТаблицы.ИДОбъекта = СтрокаСтруктурыКонфигурации.ИД;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьЯзыкиКонфигурацииXML()
	
	ТаблицаЯзыковКонфигурации = Новый ТаблицаЗначений;
	ТаблицаЯзыковКонфигурации.Колонки.Добавить("Наименование");
	ТаблицаЯзыковКонфигурации.Колонки.Добавить("Синоним");
	ТаблицаЯзыковКонфигурации.Колонки.Добавить("КодЯзыка");
	
	ВыражениеПоискаКодаЯзыка = "//xmlns:LanguageCode";
	
	// Ищем файлы языков в каталоге языков.
	КаталогЯзыков = КаталогВыгрузкиРезультат + СтрШаблон("%1Languages%1", РазделительПути);
	МаскаФайлов   = "*.xml";
	ФайлыЯзыков   = НайтиФайлы(КаталогЯзыков, МаскаФайлов, Ложь);
	
	Для Каждого ФайлЯзыка Из ФайлыЯзыков Цикл
		
		ДокументDOM = ДокументDOM(ФайлЯзыка.ПолноеИмя);
		Если ДокументDOM = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Ищем код языка.
		РезультатXPath = ВычислитьВыражениеXPath(ВыражениеПоискаКодаЯзыка, ДокументDOM);
		
		ЭлементDOMКодЯзыка = РезультатXPath.ПолучитьСледующий();
		Если ЭлементDOMКодЯзыка = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйЯзык = ТаблицаЯзыковКонфигурации.Добавить();
		НовыйЯзык.КодЯзыка = ЭлементDOMКодЯзыка.ТекстовоеСодержимое;
		
		ЭлементDOMЯзык = ЭлементDOMКодЯзыка.РодительскийУзел;
		Если ЭлементDOMЯзык = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйЯзык.Наименование = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath("xmlns:Name", ДокументDOM, ЭлементDOMЯзык);
		НовыйЯзык.Синоним = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath("xmlns:Synonym/v8:item/v8:content", ДокументDOM, ЭлементDOMЯзык);
		
	КонецЦикла;
	
	Возврат ТаблицаЯзыковКонфигурации;
	
КонецФункции

#КонецОбласти

#Область ПолучениеСтруктурыКонфигурацииEDT

Процедура ЗагрузитьСтруктуруКонфигурацииEDT()
	
	КаталогВыгрузкиКопия = ОтредактироватьПутьККаталогу(КаталогВыгрузкиРезультат) + "src" + РазделительПути;
	
	ПутьКФайлуКонфигурации = КаталогВыгрузкиКопия + СтрШаблон("Configuration%1Configuration.mdo", РазделительПути);
	Если НЕ апк_ФайлСуществует(ПутьКФайлуКонфигурации) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаТиповОбъектовИнициализировать();
	ТаблицаТиповОбъектовДляДереваКонфигурации = ПолучитьТаблицуТиповОбъектовДляДереваКонфигурации();
	
	ДеревоДанных = XML_РазобратьФайлВыгрузки(ПутьКФайлуКонфигурации);
	
	НаименованиеКонфигурации = ПолучитьНаименованиеКонфигурацииEDT(ДеревоДанных);
	
	СтрокаКонфигурации = СтруктураКонфигурации.Добавить();
	СтрокаКонфигурации.ТипОбъекта = "Конфигурация";
	СтрокаКонфигурации.Объект = НаименованиеКонфигурации + " (Конфигурация)";
	СтрокаКонфигурации.ПутьОбъекта = НаименованиеКонфигурации;
	СтрокаКонфигурации.ИД = Новый УникальныйИдентификатор;
	
	СтрокаПоискаОбъекты = "mdclass:Configuration";
	СтрокаДанныхОбъекты = ПолучитьСтрокуДереваПоПравилуПоиска(ДеревоДанных, СтрокаПоискаОбъекты);
	
	МассивСтандартныхРеквизитовДляПроверкиСуществования = Новый Массив;
	МассивСтандартныхРеквизитовДляПроверкиСуществования.Добавить("Родитель");
	МассивСтандартныхРеквизитовДляПроверкиСуществования.Добавить("Владелец");
	МассивСтандартныхРеквизитовДляПроверкиСуществования.Добавить("ЭтоГруппа");
	МассивСтандартныхРеквизитовДляПроверкиСуществования.Добавить("Код");
	МассивСтандартныхРеквизитовДляПроверкиСуществования.Добавить("Наименование");
	МассивСтандартныхРеквизитовДляПроверкиСуществования.Добавить("Parent");
	МассивСтандартныхРеквизитовДляПроверкиСуществования.Добавить("Owner");
	МассивСтандартныхРеквизитовДляПроверкиСуществования.Добавить("Code");
	МассивСтандартныхРеквизитовДляПроверкиСуществования.Добавить("Description");
	
	СтруктураПараметровДереваКонфигурации = Новый Структура;
	СтруктураПараметровДереваКонфигурации.Вставить("КаталогВыгрузки", КаталогВыгрузкиКопия);
	СтруктураПараметровДереваКонфигурации.Вставить("КаталогОбъектов", КаталогВыгрузкиКопия);
	СтруктураПараметровДереваКонфигурации.Вставить("ИДРодителя", "");
	СтруктураПараметровДереваКонфигурации.Вставить("ПутьРодителя", "");
	СтруктураПараметровДереваКонфигурации.Вставить("СтрокаДанныхОбъекты", СтрокаДанныхОбъекты);
	СтруктураПараметровДереваКонфигурации.Вставить("СтрокаОбщие", "");
	СтруктураПараметровДереваКонфигурации.Вставить("НаименованиеОбъекта", "");
	СтруктураПараметровДереваКонфигурации.Вставить("НаименованиеПодчиненногоОбъекта", "");
	СтруктураПараметровДереваКонфигурации.Вставить("ДобавлятьВеткуМетаданных", Истина);
	СтруктураПараметровДереваКонфигурации.Вставить("ТаблицаТиповОбъектовДляДереваКонфигурации", ТаблицаТиповОбъектовДляДереваКонфигурации);
	СтруктураПараметровДереваКонфигурации.Вставить("Родитель", "");
	СтруктураПараметровДереваКонфигурации.Вставить("ТипОбъектаРус", "");
	СтруктураПараметровДереваКонфигурации.Вставить("ТипОбъектаАнгл", "");
	СтруктураПараметровДереваКонфигурации.Вставить("ТипОбъектаРусМнФормы", "");
	СтруктураПараметровДереваКонфигурации.Вставить("ТипОбъектаАнглМнФормы", "");
	СтруктураПараметровДереваКонфигурации.Вставить("ТипОбъекта", "");
	СтруктураПараметровДереваКонфигурации.Вставить("ТаблицаПодчиненныхТипов", Новый ТаблицаЗначений);
	СтруктураПараметровДереваКонфигурации.Вставить("ТипПодчиненногоОбъекта", "");
	СтруктураПараметровДереваКонфигурации.Вставить("ТипПодчиненногоОбъектаАнгл", "");
	СтруктураПараметровДереваКонфигурации.Вставить("ТипПодчиненногоОбъектаАнглМнФормы", "");
	СтруктураПараметровДереваКонфигурации.Вставить("ДеревоДанных", Новый ДеревоЗначений);
	СтруктураПараметровДереваКонфигурации.Вставить("МассивСтандартныхРеквизитов", МассивСтандартныхРеквизитовДляПроверкиСуществования);
	
	ЗаполнитьСоставОбщихОбъектовКонфигурацииEDT(СтруктураПараметровДереваКонфигурации);
	
	// Все объекты заполняем общей процедурой в цикле.
	СтруктураОтбораДереваКонфигурации = Новый Структура;
	СтруктураОтбораДереваКонфигурации.Вставить("Родитель", "");
	МассивТиповОбъектовДереваКонфигурации = ТаблицаТиповОбъектовДляДереваКонфигурации.НайтиСтроки(СтруктураОтбораДереваКонфигурации);
	Для Каждого СтрокаТипаОбъекта Из МассивТиповОбъектовДереваКонфигурации Цикл
		
		СтруктураПараметровДереваКонфигурации.КаталогОбъектов = КаталогВыгрузкиКопия;
		СтруктураПараметровДереваКонфигурации.ИДРодителя = "";
		СтруктураПараметровДереваКонфигурации.ПутьРодителя = "";
		СтруктураПараметровДереваКонфигурации.СтрокаДанныхОбъекты = СтрокаДанныхОбъекты;
		
		ЗаполнитьЗначенияСвойств(СтруктураПараметровДереваКонфигурации, СтрокаТипаОбъекта);
		СтруктураПараметровДереваКонфигурации.ТипОбъекта = СтрокаТипаОбъекта.ТипОбъектаРус;
		
		ЗаполнитьСоставОбъектовПоТипуEDT(СтруктураПараметровДереваКонфигурации);
		
	КонецЦикла;
	
	СтруктураПараметровДереваКонфигурации.КаталогОбъектов = КаталогВыгрузкиКопия;
	СтруктураПараметровДереваКонфигурации.СтрокаДанныхОбъекты = СтрокаДанныхОбъекты;
	
	ЗаполнитьСоставПодсистемEDT(СтруктураПараметровДереваКонфигурации);
	
КонецПроцедуры

Процедура ЗаполнитьСоставОбщихОбъектовКонфигурацииEDT(СтруктураПараметровДереваКонфигурации)
	
	СтрокаДанныхОбъекты = СтруктураПараметровДереваКонфигурации.СтрокаДанныхОбъекты;
	
	ИДОбщие = Новый УникальныйИдентификатор;
	ПутьОбщие = "Общие";
	
	СтрокаОбщие = СтруктураКонфигурации.Добавить();
	СтрокаОбщие.ТипОбъекта = "ВеткаМетаданных";
	СтрокаОбщие.Объект = ПутьОбщие;
	СтрокаОбщие.ПутьОбъекта = ПутьОбщие;
	СтрокаОбщие.ИД = ИДОбщие;
	
	СтруктураПараметровДереваКонфигурации.СтрокаОбщие = СтрокаОбщие;
	
	КаталогОбъектов = СтруктураПараметровДереваКонфигурации.КаталогВыгрузки;
	
	ТаблицаТиповОбъектовДляДереваКонфигурации = СтруктураПараметровДереваКонфигурации.ТаблицаТиповОбъектовДляДереваКонфигурации;
	
	// Остальные объекты заполняем общей процедурой в цикле.
	СтруктураОтбораВеткаОбщие = Новый Структура;
	СтруктураОтбораВеткаОбщие.Вставить("Родитель", ПутьОбщие);
	МассивТиповОбъектовВеткаОбщие = ТаблицаТиповОбъектовДляДереваКонфигурации.НайтиСтроки(СтруктураОтбораВеткаОбщие);
	Для Каждого СтрокаТипаОбъекта Из МассивТиповОбъектовВеткаОбщие Цикл
		
		ТипОбъектаРус = СтрокаТипаОбъекта.ТипОбъектаРус;
		Если ТипОбъектаРус = "Подсистема" Тогда
			// Подсистемы пропускаем, для них есть отдельное заполнение.
			Продолжить;
		КонецЕсли;
		
		СтруктураПараметровДереваКонфигурации.СтрокаДанныхОбъекты = СтрокаДанныхОбъекты;
		СтруктураПараметровДереваКонфигурации.ИДРодителя = ИДОбщие;
		СтруктураПараметровДереваКонфигурации.ПутьРодителя = ПутьОбщие;
		СтруктураПараметровДереваКонфигурации.КаталогОбъектов = КаталогОбъектов;
		
		ЗаполнитьЗначенияСвойств(СтруктураПараметровДереваКонфигурации, СтрокаТипаОбъекта);
		СтруктураПараметровДереваКонфигурации.ТипОбъекта = ТипОбъектаРус;
		
		ЗаполнитьСоставОбъектовПоТипуEDT(СтруктураПараметровДереваКонфигурации);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСоставОбъектовПоТипуEDT(СтруктураПараметровДереваКонфигурации)
	
	ИДВетки = Новый УникальныйИдентификатор;
	
	СтрокаВеткиОбъектов = СтруктураКонфигурации.Добавить();
	СтрокаВеткиОбъектов.ТипОбъекта = "ВеткаМетаданных";
	СтрокаВеткиОбъектов.Объект = СтруктураПараметровДереваКонфигурации.ТипОбъектаРусМнФормы;
	СтрокаВеткиОбъектов.ПутьОбъекта = СтруктураПараметровДереваКонфигурации.ТипОбъектаРусМнФормы;
	СтрокаВеткиОбъектов.ИД = ИДВетки;
	СтрокаВеткиОбъектов.ИДРодителя = СтруктураПараметровДереваКонфигурации.ИДРодителя;
	
	СтрокаДанныхОбъекты = СтруктураПараметровДереваКонфигурации.СтрокаДанныхОбъекты;
	Если СтрокаДанныхОбъекты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипОбъектаАнглМнФормы = СтруктураПараметровДереваКонфигурации.ТипОбъектаАнглМнФормы;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяНРег", НРег(ТипОбъектаАнглМнФормы));
	
	МассивСтрокОбъекты = СтрокаДанныхОбъекты.Строки.НайтиСтроки(СтруктураОтбора, Ложь);
	Если МассивСтрокОбъекты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КаталогОбъектов = СтруктураПараметровДереваКонфигурации.КаталогОбъектов + ТипОбъектаАнглМнФормы + РазделительПути;
	СтруктураПараметровДереваКонфигурации.КаталогОбъектов = КаталогОбъектов;
	
	ЭтоФорма = Ложь;
	Если СтруктураПараметровДереваКонфигурации.ТипОбъектаРус = "ОбщаяФорма" Тогда
		ЭтоФорма = Истина;
	КонецЕсли;
	
	ТипОбъекта = СтруктураПараметровДереваКонфигурации.ТипОбъекта;
	ТипОбъектаРусМнФормы = СтруктураПараметровДереваКонфигурации.ТипОбъектаРусМнФормы;
	
	Для Каждого СтрокаДанныхОбъект Из МассивСтрокОбъекты Цикл
		
		СтруктураПараметровДереваКонфигурации.Вставить("СтрокаДанныхОбъект", СтрокаДанныхОбъект);
		
		МассивНаименованияОбъекта = СтрРазделить(СтрокаДанныхОбъект.Значение, ".");
		Если МассивНаименованияОбъекта.Количество() <> 2 Тогда
			Продолжить;
		КонецЕсли;
		
		НаименованиеОбъекта = МассивНаименованияОбъекта[1];
		
		ИДОбъекта = Новый УникальныйИдентификатор;
		ПутьОбъекта = ТипОбъекта + "." + НаименованиеОбъекта;
		
		СтрокаДереваОбъект = СтруктураКонфигурации.Добавить();
		СтрокаДереваОбъект.ТипОбъекта = ТипОбъекта;
		СтрокаДереваОбъект.Объект = НаименованиеОбъекта;
		СтрокаДереваОбъект.ПутьОбъекта = ПутьОбъекта;
		СтрокаДереваОбъект.ИД = ИДОбъекта;
		СтрокаДереваОбъект.ИДРодителя = ИДВетки;
		
		СтруктураПараметровДереваКонфигурации.ИДРодителя = ИДОбъекта;
		СтруктураПараметровДереваКонфигурации.ПутьРодителя = ПутьОбъекта;
		
		ТаблицаПодчиненныхТипов = СтруктураПараметровДереваКонфигурации.ТаблицаПодчиненныхТипов;
		Если ТаблицаПодчиненныхТипов = Неопределено Тогда
			СтруктураПараметровДереваКонфигурации.ИДРодителя = ИДВетки;
			СтруктураПараметровДереваКонфигурации.ПутьРодителя = "";
			Продолжить;
		КонецЕсли;
		
		ФайлОбъекта = СтрШаблон("%1%2%3%2.mdo", СтруктураПараметровДереваКонфигурации.КаталогОбъектов,
			НаименованиеОбъекта, РазделительПути);
		Если НЕ апк_ФайлСуществует(ФайлОбъекта) Тогда
			СтруктураПараметровДереваКонфигурации.ИДРодителя = ИДВетки;
			СтруктураПараметровДереваКонфигурации.ПутьРодителя = "";
			Продолжить;
		КонецЕсли;
		
		ДеревоДанных = XML_РазобратьФайлВыгрузки(ФайлОбъекта);
		СтруктураПараметровДереваКонфигурации.ДеревоДанных = ДеревоДанных;
		СтруктураПараметровДереваКонфигурации.НаименованиеОбъекта = НаименованиеОбъекта;
		
		Для Каждого СтрокаПодчиненногоТипа Из ТаблицаПодчиненныхТипов Цикл
			
			ЗаполнитьЗначенияСвойств(СтруктураПараметровДереваКонфигурации, СтрокаПодчиненногоТипа);
			
			ЗаполнитьСоставПодчиненныхОбъектовEDT(СтруктураПараметровДереваКонфигурации);
			
		КонецЦикла;
		
		СтруктураПараметровДереваКонфигурации.ИДРодителя = ИДВетки;
		СтруктураПараметровДереваКонфигурации.ПутьРодителя = "";
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСоставПодчиненныхОбъектовEDT(СтруктураПараметровДереваКонфигурации)
	
	СтрокаДанныхОбъект = СтруктураПараметровДереваКонфигурации.СтрокаДанныхОбъект;
	ДеревоДанных = СтруктураПараметровДереваКонфигурации.ДеревоДанных;
	
	ТипОбъекта = СтруктураПараметровДереваКонфигурации.ТипОбъекта;
	ТипОбъектаАнгл = СтруктураПараметровДереваКонфигурации.ТипОбъектаАнгл;
	ТипПодчиненногоОбъекта = СтруктураПараметровДереваКонфигурации.ТипПодчиненногоОбъекта;
	ТипПодчиненногоОбъектаАнгл = СтруктураПараметровДереваКонфигурации.ТипПодчиненногоОбъектаАнгл;
	ТипПодчиненногоОбъектаАнглМнФормы = СтруктураПараметровДереваКонфигурации.ТипПодчиненногоОбъектаАнглМнФормы;
	ИДРодителя = СтруктураПараметровДереваКонфигурации.ИДРодителя;
	ПутьРодителя = СтруктураПараметровДереваКонфигурации.ПутьРодителя;
	
	ЭтоСтандартныйРеквизит = (ТипПодчиненногоОбъекта = "СтандартныйРеквизит");
	ЭтоСтандартнаяТабличнаяЧасть = (ТипПодчиненногоОбъекта = "СтандартнаяТабличнаяЧасть");
	
	СтрокаПоискаПодчиненныеОбъекты = СтрШаблон("mdclass:%1", ТипОбъектаАнгл);
	
	СтрокаДанныхПодчиненныеОбъекты = ПолучитьСтрокуДереваПоПравилуПоиска(ДеревоДанных, СтрокаПоискаПодчиненныеОбъекты);
	Если СтрокаДанныхПодчиненныеОбъекты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДанныхПодчиненныеОбъекты = Новый Структура;
	СтруктураДанныхПодчиненныеОбъекты.Вставить("ИмяНРег", НРег(ТипПодчиненногоОбъектаАнглМнФормы));
	
	МассивДанныхПодчиненныеОбъекты = СтрокаДанныхПодчиненныеОбъекты.Строки.НайтиСтроки(СтруктураДанныхПодчиненныеОбъекты);
	Если МассивДанныхПодчиненныеОбъекты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КаталогОбъектов = СтруктураПараметровДереваКонфигурации.КаталогОбъектов;
	НаименованиеОбъекта = СтруктураПараметровДереваКонфигурации.НаименованиеОбъекта;
	
	ЭтоТабличнаяЧасть = (ТипПодчиненногоОбъекта = "ТабличнаяЧасть");
	ЭтоОперацияWebСервиса = (ТипПодчиненногоОбъекта = "Операция");
	ЭтоШаблонURL = (ТипПодчиненногоОбъекта = "ШаблонURL");
	
	Для Каждого СтрокаДанныхПодчиненногоОбъекта Из МассивДанныхПодчиненныеОбъекты Цикл
		
		СтрокаДанныхПодчиненныйОбъект = ПолучитьСтрокуДереваПоПравилуПоиска(СтрокаДанныхПодчиненногоОбъекта, "name");
		Если СтрокаДанныхПодчиненныйОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НаименованиеПодчиненногоОбъекта = СтрокаДанныхПодчиненныйОбъект.Значение;
		
		Если ЭтоСтандартныйРеквизит ИЛИ ЭтоСтандартнаяТабличнаяЧасть Тогда
			
			НаименованиеПодчиненногоОбъекта = ПолучитьНаименованиеСтандартногоРеквизита(НаименованиеПодчиненногоОбъекта);
			
			СтруктураПараметровДереваКонфигурации.НаименованиеПодчиненногоОбъекта = НаименованиеПодчиненногоОбъекта;
			
			// Для стандартных реквизитов необходима дополнительная проверка существования.
			// Т.к. в XML выгружаются либо все стандартные реквизиты, либо ни одного.
			Если НЕ СтандартныйРеквизитСуществуетEDT(СтруктураПараметровДереваКонфигурации) Тогда
				// Если стандартный реквизит не существует, то пропускаем.
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		ИДОбъекта = Новый УникальныйИдентификатор;
		ПутьОбъекта = СтрШаблон("%1.%2.%3", ПутьРодителя, ТипПодчиненногоОбъекта, НаименованиеПодчиненногоОбъекта);
		
		СтрокаДереваПодчиненногоОбъекта = СтруктураКонфигурации.Добавить();
		СтрокаДереваПодчиненногоОбъекта.ТипОбъекта = ТипПодчиненногоОбъекта;
		СтрокаДереваПодчиненногоОбъекта.Объект = НаименованиеПодчиненногоОбъекта;
		СтрокаДереваПодчиненногоОбъекта.ПутьОбъекта = ПутьОбъекта;
		СтрокаДереваПодчиненногоОбъекта.ИД = ИДОбъекта;
		СтрокаДереваПодчиненногоОбъекта.ИДРодителя = ИДРодителя;
		
		// Проверяем реквизиты табличной части, операции web-сервиса и шаблоны URL.
		Если ЭтоТабличнаяЧасть ИЛИ ЭтоОперацияWebСервиса ИЛИ ЭтоШаблонURL Тогда
			
			ТипПодчиненногоОбъектаПодчиненногоОбъекта = "";
			ИмяПодчиненногоОбъектаПодчиненногоОбъектаАнгл = "";
			Если ЭтоТабличнаяЧасть Тогда
				ТипПодчиненногоОбъектаПодчиненногоОбъекта = "Реквизит";
				ИмяПодчиненногоОбъектаПодчиненногоОбъектаАнгл = "attributes";
			ИначеЕсли ЭтоОперацияWebСервиса Тогда
				ТипПодчиненногоОбъектаПодчиненногоОбъекта = "Параметр";
				ИмяПодчиненногоОбъектаПодчиненногоОбъектаАнгл = "parameters";
			ИначеЕсли ЭтоШаблонURL Тогда
				ТипПодчиненногоОбъектаПодчиненногоОбъекта = "МетодШаблонаURL";
				ИмяПодчиненногоОбъектаПодчиненногоОбъектаАнгл = "methods";
			Иначе
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьСоставПодчиненныхОбъектовПодчиненныхОбъектовEDT(СтрокаДанныхПодчиненногоОбъекта,
				ИДОбъекта,
				ПутьОбъекта,
				СтруктураПараметровДереваКонфигурации,
				ТипПодчиненногоОбъектаПодчиненногоОбъекта,
				ИмяПодчиненногоОбъектаПодчиненногоОбъектаАнгл);
			
			// Для табличной части необходимо также заполнить стандартные реквизиты, например, НомерСтроки.
			Если ЭтоТабличнаяЧасть Тогда
				
				ЗаполнитьСоставПодчиненныхОбъектовПодчиненныхОбъектовEDT(СтрокаДанныхПодчиненногоОбъекта,
					ИДОбъекта,
					ПутьОбъекта,
					СтруктураПараметровДереваКонфигурации,
					"СтандартныйРеквизит",
					"standardAttributes");
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСоставПодчиненныхОбъектовПодчиненныхОбъектовEDT(СтрокаДанных, ИДРодителя, ПутьРодителя,
	СтруктураПараметровДереваКонфигурации, ТипОбъекта, ИмяОбъектаАнгл)
	
	СтруктураДанныхПодчиненныхОбъектов = Новый Структура;
	СтруктураДанныхПодчиненныхОбъектов.Вставить("ИмяНРег", НРег(ИмяОбъектаАнгл));
	
	МассивДанныхПодчиненныхОбъектов = СтрокаДанных.Строки.НайтиСтроки(СтруктураДанныхПодчиненныхОбъектов);
	Если МассивДанныхПодчиненныхОбъектов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоСтандартныйРеквизит = (ТипОбъекта = "СтандартныйРеквизит");
	
	Для Каждого СтрокаДанныхПодчиненногоОбъекта Из МассивДанныхПодчиненныхОбъектов Цикл
		
		СтрокаДанныхИмениПодчиненногоОбъекта = ПолучитьСтрокуДереваПоПравилуПоиска(СтрокаДанныхПодчиненногоОбъекта, "name");
		Если СтрокаДанныхИмениПодчиненногоОбъекта = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НаименованиеПодчиненногоОбъекта = СтрокаДанныхИмениПодчиненногоОбъекта.Значение;
		
		Если ЭтоСтандартныйРеквизит Тогда
			НаименованиеПодчиненногоОбъекта = ПолучитьНаименованиеСтандартногоРеквизита(НаименованиеПодчиненногоОбъекта);
		КонецЕсли;
		
		СтрокаДереваПодчиненногоОбъекта = СтруктураКонфигурации.Добавить();
		СтрокаДереваПодчиненногоОбъекта.ТипОбъекта = ТипОбъекта;
		СтрокаДереваПодчиненногоОбъекта.Объект = НаименованиеПодчиненногоОбъекта;
		СтрокаДереваПодчиненногоОбъекта.ПутьОбъекта = СтрШаблон("%1.%2.%3",
			ПутьРодителя, ТипОбъекта, НаименованиеПодчиненногоОбъекта);
		СтрокаДереваПодчиненногоОбъекта.ИД = Новый УникальныйИдентификатор;
		СтрокаДереваПодчиненногоОбъекта.ИДРодителя = ИДРодителя;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СтандартныйРеквизитСуществуетEDT(СтруктураПараметровДереваКонфигурации)
	
	РеквизитСуществует = Истина;
	
	НаименованиеСтандартногоРеквизита = СтруктураПараметровДереваКонфигурации.НаименованиеПодчиненногоОбъекта;
	
	МассивСтандартныхРеквизитов = СтруктураПараметровДереваКонфигурации.МассивСтандартныхРеквизитов;
	Если МассивСтандартныхРеквизитов.Найти(НаименованиеСтандартногоРеквизита) = Неопределено Тогда
		Возврат РеквизитСуществует;
	КонецЕсли;
	
	ДеревоДанных = СтруктураПараметровДереваКонфигурации.ДеревоДанных;
	ТипОбъекта = СтруктураПараметровДереваКонфигурации.ТипОбъекта;
	ТипОбъектаАнгл = СтруктураПараметровДереваКонфигурации.ТипОбъектаАнгл;
	
	// Проверяем наличие стандартного реквизита.
	Если (НаименованиеСтандартногоРеквизита = "Владелец") ИЛИ (НаименованиеСтандартногоРеквизита = "Owner") Тогда
		
		// Если это владелец, то проверяем наличие свойства "Владельцы".
		СтрокаПоискаПодчиненныеОбъекты = СтрШаблон("mdclass:%1", ТипОбъектаАнгл);
		СтрокаПоиска = СтрШаблон("mdclass:%1.owners", ТипОбъектаАнгл);
		
		СтрокаДереваДанныхВладельцы = ПолучитьСтрокуДереваПоПравилуПоиска(ДеревоДанных, СтрокаПоиска);
		
		РеквизитСуществует = (СтрокаДереваДанныхВладельцы <> Неопределено);
		
	ИначеЕсли (НаименованиеСтандартногоРеквизита = "Наименование") ИЛИ (НаименованиеСтандартногоРеквизита = "Description") Тогда
		
		// Если это наименование, то проверяем длину кода.
		СтрокаПоиска = СтрШаблон("mdclass:%1.descriptionLength", ТипОбъектаАнгл);
		
		СтрокаДереваДанныхДлинаНаименования = ПолучитьСтрокуДереваПоПравилуПоиска(ДеревоДанных, СтрокаПоиска);
		Если СтрокаДереваДанныхДлинаНаименования = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		СтрокаДереваДанныхДлинаНаименованияЗначение = СтрокаДереваДанныхДлинаНаименования.Значение;
		Если НЕ апк_ЭтоЧисло(СтрокаДереваДанныхДлинаНаименованияЗначение) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		РеквизитСуществует = Число(СтрокаДереваДанныхДлинаНаименованияЗначение) > 0;
		
	ИначеЕсли (НаименованиеСтандартногоРеквизита = "Код") ИЛИ (НаименованиеСтандартногоРеквизита = "Code") Тогда
		
		// Если это код, то проверяем длину кода.
		СтрокаПоиска = СтрШаблон("mdclass:%1.codeLength", ТипОбъектаАнгл);
		
		СтрокаДереваДанныхДлинаКода = ПолучитьСтрокуДереваПоПравилуПоиска(ДеревоДанных, СтрокаПоиска);
		Если СтрокаДереваДанныхДлинаКода = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		СтрокаДереваДанныхДлинаКодаЗначение = СтрокаДереваДанныхДлинаКода.Значение;
		Если НЕ апк_ЭтоЧисло(СтрокаДереваДанныхДлинаКодаЗначение) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		РеквизитСуществует = Число(СтрокаДереваДанныхДлинаКодаЗначение) > 0;
		
	ИначеЕсли (НаименованиеСтандартногоРеквизита = "Родитель") ИЛИ (НаименованиеСтандартногоРеквизита = "Parent") Тогда
		
		// Если это родитель, то проверяем свойство "Иерархия".
		СтрокаПоиска = СтрШаблон("mdclass:%1.hierarchical", ТипОбъектаАнгл);
		
		СтрокаДереваДанныхИерархия = ПолучитьСтрокуДереваПоПравилуПоиска(ДеревоДанных, СтрокаПоиска);
		Если СтрокаДереваДанныхИерархия = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		СтрокаДереваДанныхИерархияЗначение = СтрокаДереваДанныхИерархия.Значение;
		РеквизитСуществует = апк_ЭтоБулево(СтрокаДереваДанныхИерархияЗначение);
		
	ИначеЕсли (НаименованиеСтандартногоРеквизита = "ЭтоГруппа") ИЛИ (НаименованиеСтандартногоРеквизита = "IsFolder") Тогда
		
		// Если это группа, то проверяем свойство "Иерархия".
		СтрокаПоиска = СтрШаблон("mdclass:%1.hierarchical", ТипОбъектаАнгл);
		
		СтрокаДереваДанныхИерархия = ПолучитьСтрокуДереваПоПравилуПоиска(ДеревоДанных, СтрокаПоиска);
		Если СтрокаДереваДанныхИерархия = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		СтрокаДереваДанныхИерархияЗначение = СтрокаДереваДанныхИерархия.Значение;
		СтрокаДереваДанныхИерархияЗначение = апк_ЭтоБулево(СтрокаДереваДанныхИерархияЗначение);
		
		// Если есть иерархия, то проверяем ее значение.
		Если НЕ СтрокаДереваДанныхИерархияЗначение Тогда
			Возврат Ложь;
		КонецЕсли;
		
		// Для планов видов характеристик достаточно, чтобы была иерархия, остальные свойства не проверяем.
		Если ТипОбъекта = "ПланВидовХарактеристик" Тогда
			Возврат РеквизитСуществует;
		КонецЕсли;
		
		СтрокаПоиска = СтрШаблон("mdclass:%1.hierarchyType", ТипОбъектаАнгл);
		
		СтрокаДереваДанныхТипИерархии = ПолучитьСтрокуДереваПоПравилуПоиска(ДеревоДанных, СтрокаПоиска);
		Если СтрокаДереваДанныхТипИерархии = Неопределено Тогда
			// Если значение иерархии "Иерархия групп и элементов", то это свойство не выгружается в файл.
			Возврат Истина;
		КонецЕсли;
		
		РеквизитСуществует = (СтрСравнить(СтрокаДереваДанныхТипИерархии.Значение, "HierarchyFoldersAndItems") = 0);
		
	КонецЕсли;
	
	Возврат РеквизитСуществует;
	
КонецФункции

Функция ПолучитьНаименованиеКонфигурацииEDT(ДеревоДанных)
	
	НаименованиеКонфигурации = "Конфигурация";
	
	СтрокаПоискаНаименование = "mdclass:Configuration.Name";
	СтрокаДанныхНаименование = ПолучитьСтрокуДереваПоПравилуПоиска(ДеревоДанных, СтрокаПоискаНаименование);
	Если СтрокаДанныхНаименование <> Неопределено Тогда
		НаименованиеКонфигурации = СтрокаДанныхНаименование.Значение;
	КонецЕсли;
	
	Возврат НаименованиеКонфигурации;
	
КонецФункции

Процедура ЗаполнитьСоставПодсистемEDT(СтруктураПараметровДереваКонфигурации)
	
	ИДРодителя = СтруктураПараметровДереваКонфигурации.ИДРодителя;
	ПутьРодителя = СтруктураПараметровДереваКонфигурации.ПутьРодителя;
	
	ДобавлятьВеткуМетаданных = СтруктураПараметровДереваКонфигурации.ДобавлятьВеткуМетаданных;
	Если ДобавлятьВеткуМетаданных Тогда
		
		СтруктураПараметровДереваКонфигурации.ТипОбъекта = "Подсистема";
		СтруктураПараметровДереваКонфигурации.ТипОбъектаРус = "Подсистема";
		СтруктураПараметровДереваКонфигурации.ТипОбъектаРусМнФормы = "Подсистемы";
		СтруктураПараметровДереваКонфигурации.ТипОбъектаАнгл = "Subsystem";
		СтруктураПараметровДереваКонфигурации.ТипОбъектаАнглМнФормы = "Subsystems";
		
		ИД = Новый УникальныйИдентификатор;
		ПутьРодителя = СтруктураПараметровДереваКонфигурации.ТипОбъектаРусМнФормы;
		
		СтрокаОбъекта = СтруктураКонфигурации.Вставить(2);
		СтрокаОбъекта.ТипОбъекта = "ВеткаМетаданных";
		СтрокаОбъекта.Объект = СтруктураПараметровДереваКонфигурации.ТипОбъектаРусМнФормы;
		СтрокаОбъекта.ПутьОбъекта = ПутьРодителя;
		СтрокаОбъекта.ИД = ИД;
		СтрокаОбъекта.ИДРодителя = СтруктураПараметровДереваКонфигурации.СтрокаОбщие.ИД;;
		
		ИДРодителя = ИД;
		ПутьРодителя = "";
		
	КонецЕсли;
	
	СтрокаДанныхОбъекты = СтруктураПараметровДереваКонфигурации.СтрокаДанныхОбъекты;
	Если СтрокаДанныхОбъекты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипОбъекта = СтруктураПараметровДереваКонфигурации.ТипОбъекта;
	ТипОбъектаАнглМнФормы = СтруктураПараметровДереваКонфигурации.ТипОбъектаАнглМнФормы;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяНРег", НРег(ТипОбъектаАнглМнФормы));
	
	МассивСтрокОбъекты = СтрокаДанныхОбъекты.Строки.НайтиСтроки(СтруктураОтбора, Ложь);
	Если МассивСтрокОбъекты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТипОбъектаРусМнФормы = СтруктураПараметровДереваКонфигурации.ТипОбъектаРусМнФормы;
	ТипОбъектаАнгл = СтруктураПараметровДереваКонфигурации.ТипОбъектаАнгл;
	
	КаталогОбъектов = СтруктураПараметровДереваКонфигурации.КаталогОбъектов + ТипОбъектаАнглМнФормы + РазделительПути;
	
	Для Каждого СтрокаДанныхОбъект Из МассивСтрокОбъекты Цикл
		
		НаименованиеОбъекта = СтрокаДанныхОбъект.Значение;
		НаименованиеОбъекта = СтрЗаменить(НаименованиеОбъекта, "Subsystem.", "");
		
		ИДОбъекта = Новый УникальныйИдентификатор;
		ПутьОбъекта = СтрШаблон("%1.%2", ПутьРодителя, НаименованиеОбъекта);
		ПутьОбъекта = СтрСоединить(СтрРазделить(ПутьОбъекта, ".", Ложь), ".");
		
		СтрокаДереваОбъект = СтруктураКонфигурации.Добавить();
		СтрокаДереваОбъект.ТипОбъекта = ТипОбъекта;
		СтрокаДереваОбъект.Объект = НаименованиеОбъекта;
		СтрокаДереваОбъект.ПутьОбъекта = ПутьОбъекта;
		СтрокаДереваОбъект.ИД = ИДОбъекта;
		СтрокаДереваОбъект.ИДРодителя = ИДРодителя;
		
		ФайлОбъекта = СтрШаблон("%1%2%3%2.mdo", КаталогОбъектов, НаименованиеОбъекта, РазделительПути);
		Если НЕ апк_ФайлСуществует(ФайлОбъекта) Тогда
			Продолжить;
		КонецЕсли;
		
		ДеревоДанных = XML_РазобратьФайлВыгрузки(ФайлОбъекта);
		
		СтрокаДанныхПодсистемы = ПолучитьСтрокуДереваПоПравилуПоиска(ДеревоДанных, "mdclass:Subsystem");
		Если СтрокаДанныхПодсистемы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьСоставОбъектовПодсистемыEDT(СтрокаДереваОбъект, СтрокаДанныхПодсистемы);
		
		КаталогОбъекта = КаталогОбъектов + НаименованиеОбъекта + РазделительПути;
		
		СтруктураПараметровДереваКонфигурации.ИДРодителя = ИДОбъекта;
		СтруктураПараметровДереваКонфигурации.ПутьРодителя = ПутьОбъекта;
		СтруктураПараметровДереваКонфигурации.КаталогОбъектов = КаталогОбъекта;
		СтруктураПараметровДереваКонфигурации.ДобавлятьВеткуМетаданных = Ложь;
		СтруктураПараметровДереваКонфигурации.СтрокаДанныхОбъекты = СтрокаДанныхПодсистемы;
		
		ЗаполнитьСоставПодсистемEDT(СтруктураПараметровДереваКонфигурации);
		
		СтруктураПараметровДереваКонфигурации.КаталогОбъектов = КаталогОбъектов;
		СтруктураПараметровДереваКонфигурации.СтрокаДанныхОбъекты = СтрокаДанныхПодсистемы;
		
	КонецЦикла;
	
	СтрокаОбъектыБезПодсистем = СтруктураКонфигурации.Добавить();
	СтрокаОбъектыБезПодсистем.Объект = НСтр("ru='<Не входящие в подсистемы>'; en='<Не входящие в подсистемы>'",
		КодОсновногоЯзыка);
	
КонецПроцедуры

Процедура ЗаполнитьСоставОбъектовПодсистемыEDT(СтрокаДереваПодсистема, ДеревоДанныхПодсистемы)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяНРег", "content");
	
	МассивСтрокСостав = ДеревоДанныхПодсистемы.Строки.НайтиСтроки(СтруктураОтбора, Ложь);
	Если МассивСтрокСостав.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаДанныхОбъекта Из МассивСтрокСостав Цикл
		
		ПутьОбъектаАнгл = СтрокаДанныхОбъекта.Значение;
		МассивПутиАнгл = СтрРазделить(ПутьОбъектаАнгл, ".");
		Если МассивПутиАнгл.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		МассивПутиАнгл[0] = ПолучитьТипОбъектаПоТаблицеТипов(МассивПутиАнгл[0]);
		
		ПутьОбъекта = СтрСоединить(МассивПутиАнгл, ".");
		СтрокаСтруктурыКонфигурации = СтруктураКонфигурации.Найти(ПутьОбъекта, "ПутьОбъекта");
		Если СтрокаСтруктурыКонфигурации = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы = СоставПодсистем.Добавить();
		СтрокаТаблицы.ИДПодсистемы = СтрокаДереваПодсистема.ИД;
		СтрокаТаблицы.ИДОбъекта = СтрокаСтруктурыКонфигурации.ИД;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьЯзыкиКонфигурацииEDT()
	
	ТаблицаЯзыковКонфигурации = Новый ТаблицаЗначений;
	ТаблицаЯзыковКонфигурации.Колонки.Добавить("Наименование");
	ТаблицаЯзыковКонфигурации.Колонки.Добавить("Синоним");
	ТаблицаЯзыковКонфигурации.Колонки.Добавить("КодЯзыка");
	
	ФайлКонфигурации = ПолучитьФайлКонфигурации();
	Если НЕ апк_ФайлСуществует(ФайлКонфигурации) Тогда
		Возврат ТаблицаЯзыковКонфигурации;
	КонецЕсли;
	
	ДокументDOM = ДокументDOM(ФайлКонфигурации);
	Если ДокументDOM = Неопределено Тогда
		Возврат ТаблицаЯзыковКонфигурации;
	КонецЕсли;
	
	ВыражениеПоискаКодаЯзыка = "//languages/languageCode";
	РезультатXPath = ВычислитьВыражениеXPath(ВыражениеПоискаКодаЯзыка, ДокументDOM);
	Пока Истина Цикл
		
		ЭлементDOMКодЯзыка = РезультатXPath.ПолучитьСледующий();
		Если ЭлементDOMКодЯзыка = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		НовыйЯзык = ТаблицаЯзыковКонфигурации.Добавить();
		НовыйЯзык.КодЯзыка = ЭлементDOMКодЯзыка.ТекстовоеСодержимое;
		
		ЭлементDOMЯзык = ЭлементDOMКодЯзыка.РодительскийУзел;
		Если ЭлементDOMЯзык = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйЯзык.Наименование = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath("name", ДокументDOM, ЭлементDOMЯзык);
		НовыйЯзык.Синоним = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath("synonym/value", ДокументDOM, ЭлементDOMЯзык);
		
	КонецЦикла;
	
	Возврат ТаблицаЯзыковКонфигурации;
	
КонецФункции

#КонецОбласти

#Область РазборФайлаВыгрузкиXML

// Функция получает дерево значений из файла xml формы
//
Функция XML_РазобратьФайлВыгрузки(ПолноеИмяФайла, ДеревоДанных = "") Экспорт
	
	XML_СоздатьДеревоФайлаВыгрузки(ДеревоДанных);
	
	ЧтениеXML = XML_ПрочитатьФайлВыгрузки(ПолноеИмяФайла);
	Если ЧтениеXML = Неопределено Тогда
		Возврат ДеревоДанных;
	КонецЕсли;
	
	XML_ПолучитьДеревоИзФайлаВыгрузки(ДеревоДанных, ЧтениеXML, ПолноеИмяФайла);
	
	Возврат ДеревоДанных;
	
КонецФункции

// Функция создает пустое дерево значений структуры "Имя, ИмяНРег, Значение".
// Параметры:
//   Дерево - ДеревоЗначений, дерево значений, которое будет приведено к необходимой структуре и очищено.
// Возвращаемое значение:
//   ДеревоЗначений.
Функция XML_СоздатьДеревоФайлаВыгрузки(Дерево = "")
	
	Если ТипЗнч(Дерево) <> Тип("ДеревоЗначений") Тогда
		Дерево = Новый ДеревоЗначений;
	КонецЕсли;
	
	Описание = Новый ОписаниеТипов("Строка");
	Колонки = Дерево.Колонки;
	
	Если Колонки.Найти("Имя") = Неопределено Тогда
		Колонки.Добавить("Имя", Описание);
	КонецЕсли;
	
	Если Колонки.Найти("ИмяНРег") = Неопределено Тогда
		Колонки.Добавить("ИмяНРег", Описание);
	КонецЕсли;
	
	Если Колонки.Найти("Значение") = Неопределено Тогда
		Колонки.Добавить("Значение", Описание);
	КонецЕсли;
	
	Дерево.Строки.Очистить();
	
	Возврат Дерево;
	
КонецФункции

Функция XML_ПрочитатьФайлВыгрузки(ПутьФайла)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ИгнорироватьПробелы = Ложь;
	
	Попытка
		ЧтениеXML.ОткрытьФайл(ПутьФайла);
	Исключение
		ЗаписатьОшибкуЧтенияФайлаВТаблицуРезультат(ПутьФайла, ИнформацияОбОшибке());
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ЧтениеXML;
	
КонецФункции

Функция XML_ПолучитьДеревоИзФайлаВыгрузки(ДеревоДанных, ЧтениеXML, ПолноеИмяФайла = "")
	
	Попытка
		Пока ЧтениеXML.Прочитать() Цикл
			
			ТипУзла = ЧтениеXML.ТипУзла;
			
			Если ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				СтрокаДерева = XML_ДобавитьСтрокуДерева(ДеревоДанных, ЧтениеXML.Имя);
				
				XML_ДобавитьАтрибутыВДерево(СтрокаДерева, ЧтениеXML);
				XML_ПолучитьДеревоИзФайлаВыгрузки(СтрокаДерева, ЧтениеXML, ПолноеИмяФайла);
			ИначеЕсли ТипУзла = ТипУзлаXML.Текст Тогда
				ДеревоДанных.Значение = ЧтениеXML.Значение;
			ИначеЕсли ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
				Возврат "";
			КонецЕсли;
			
		КонецЦикла;
	Исключение
		ЗаписатьОшибкуЧтенияФайлаВТаблицуРезультат(ПолноеИмяФайла, ИнформацияОбОшибке());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция XML_ДобавитьСтрокуДерева(ДеревоДанных, Имя, Значение = "", Системная = Ложь)
	
	СтрокаДерева = ДеревоДанных.Строки.Добавить();
	
	СтрокаДерева.Имя = Имя;
	СтрокаДерева.ИмяНРег = НРег(Имя);
	СтрокаДерева.Значение = Значение;
	
	Возврат СтрокаДерева;
	
КонецФункции

Функция XML_ДобавитьАтрибутыВДерево(ДеревоДанных, ЧтениеXML)
	
	Если ЧтениеXML.КоличествоАтрибутов() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	СтрокаАтрибутов = XML_ДобавитьСтрокуДерева(ДеревоДанных, "Атрибуты", "", Истина);
	
	Для Счетчик = 0 По ЧтениеXML.КоличествоАтрибутов() - 1 Цикл
		XML_ДобавитьСтрокуДерева(СтрокаАтрибутов, ЧтениеXML.ИмяАтрибута(Счетчик), ЧтениеXML.ПолучитьАтрибут(Счетчик));
	КонецЦикла;
	
КонецФункции

#КонецОбласти

Функция ПолучитьСтрокуОбъекта(ОбъектПуть)
	
	Возврат СтруктураКонфигурации.Найти(ОбъектПуть, "ПутьОбъекта");
	
КонецФункции

Функция ПолучитьСтрокуРодителяОбъекта(ОбъектПуть)
	
	СтрокаОбъекта = СтруктураКонфигурации.Найти(ОбъектПуть, "ПутьОбъекта");
	Если СтрокаОбъекта = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СтруктураКонфигурации.Найти(СтрокаОбъекта.ИДРодителя, "ИД");
	
КонецФункции

Процедура ЗаполнитьТаблицуОбъектовИПодсистем()
	
	ТаблицаОбъектовИПодсистем = Контекст["ТаблицаОбъектовИПодсистем"];
	Если ТаблицаОбъектовИПодсистем <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Загружаем структуру конфигурации и состав подсистем.
	ЗагрузитьСтруктуруКонфигурации();
	
	ТаблицаСтруктурыКонфигурации = СтруктураКонфигурации.Выгрузить();
	ТаблицаСоставаПодсистем = СоставПодсистем.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ вт_СтруктураКонфигурации
	|ИЗ
	|	&СтруктураКонфигурации КАК СтруктураКонфигурации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ вт_СоставПодсистем
	|ИЗ
	|	&СоставПодсистем КАК СоставПодсистем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_СтруктураКонфигурацииОбъект.ПутьОбъекта КАК ОбъектПуть,
	|	вт_СтруктураКонфигурацииПодсистема.ПутьОбъекта КАК ПодсистемаПуть
	|ИЗ
	|	вт_СоставПодсистем КАК вт_СоставПодсистем
	|	ЛЕВОЕ СОЕДИНЕНИЕ вт_СтруктураКонфигурации КАК вт_СтруктураКонфигурацииОбъект
	|		ПО вт_СоставПодсистем.ИДОбъекта = вт_СтруктураКонфигурацииОбъект.ИД
	|	ЛЕВОЕ СОЕДИНЕНИЕ вт_СтруктураКонфигурации КАК вт_СтруктураКонфигурацииПодсистема
	|		ПО вт_СоставПодсистем.ИДПодсистемы = вт_СтруктураКонфигурацииПодсистема.ИД";
	
	Запрос.УстановитьПараметр("СтруктураКонфигурации", ТаблицаСтруктурыКонфигурации);
	Запрос.УстановитьПараметр("СоставПодсистем", ТаблицаСоставаПодсистем);
	
	ТаблицаОбъектовИПодсистем = Запрос.Выполнить().Выгрузить();
	
	ТаблицаОбъектовИПодсистемКопия = ТаблицаОбъектовИПодсистем.Скопировать();
	
	ТаблицаОбъектовИПодсистем.Колонки.Добавить("ВходитВСоставДочернихПодсистем");
	ТаблицаОбъектовИПодсистем.ЗаполнитьЗначения(Ложь, "ВходитВСоставДочернихПодсистем");
	
	Для Каждого СтрокаОбъектаИПодсистемы Из ТаблицаОбъектовИПодсистемКопия Цикл
		
		ПодсистемаПуть = СтрокаОбъектаИПодсистемы.ПодсистемаПуть;
		Пока Истина Цикл
			
			СтрокаРодителяОбъекта = ПолучитьСтрокуРодителяОбъекта(ПодсистемаПуть);
			Если СтрокаРодителяОбъекта = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
			Если СтрокаРодителяОбъекта.ТипОбъекта = "ВеткаМетаданных" Тогда
				Прервать;
			КонецЕсли;
			
			ПодсистемаПуть = СтрокаРодителяОбъекта.ПутьОбъекта;
			
			НоваяСтрокаОбъектаИПодсистемы = ТаблицаОбъектовИПодсистем.Добавить();
			НоваяСтрокаОбъектаИПодсистемы.ОбъектПуть = СтрокаОбъектаИПодсистемы.ОбъектПуть;
			НоваяСтрокаОбъектаИПодсистемы.ПодсистемаПуть = ПодсистемаПуть;
			НоваяСтрокаОбъектаИПодсистемы.ВходитВСоставДочернихПодсистем = Истина;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТаблицаОбъектовИПодсистем.Индексы.Добавить("ОбъектПуть, ПодсистемаПуть");
	
	Контекст.Вставить("ТаблицаОбъектовИПодсистем", ТаблицаОбъектовИПодсистем);
	
КонецПроцедуры

Функция ОбъектВходитВПодсистему(Знач ОбъектПуть, ПодсистемаПуть, ПроверятьДочерниеПодсистемы = Истина)
	
	ОбъектВходитВПодсистему = Ложь;
	
	Если ПустаяСтрока(ОбъектПуть) Тогда
		Возврат ОбъектВходитВПодсистему;
	КонецЕсли;
	
	ТаблицаТиповОбъектовВУ = ПолучитьТаблицуТиповОбъектовДляДереваКонфигурации();
	
	// Получаем путь к родителю объекта, если это не объект верхнего уровня.
	// Например, если на входе форма, то нужно получить справочник, т.к. сама форма не входит в подсистемы.
	Пока Истина Цикл
		
		СтрокаОбъекта = ПолучитьСтрокуОбъекта(ОбъектПуть);
		Если СтрокаОбъекта = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		// Если нашли тип объекта среди типов объектов верхнего уровня, то прерываем.
		Если ТаблицаТиповОбъектовВУ.Найти(СтрокаОбъекта.ТипОбъекта) <> Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		// Если родителя не нашли, выходим.
		СтрокаРодителяОбъекта = ПолучитьСтрокуРодителяОбъекта(ОбъектПуть);
		Если СтрокаРодителяОбъекта = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		// Если родитель - ветка метаданных, то прерываем.
		ТипРодителяОбъекта = СтрокаРодителяОбъекта.ТипОбъекта;
		Если ТипРодителяОбъекта = "ВеткаМетаданных" Тогда
			Прервать;
		КонецЕсли;
		
		// Берем родителя объекта.
		ОбъектПуть = СтрокаРодителяОбъекта.ПутьОбъекта;
		
	КонецЦикла;
	
	СтруктураОбъектИПодсистема = Новый Структура;
	
	ТаблицаОбъектовИПодсистем = Контекст["ТаблицаОбъектовИПодсистем"];
	Если ТаблицаОбъектовИПодсистем = Неопределено Тогда
		ЗаполнитьТаблицуОбъектовИПодсистем();
	КонецЕсли;
	
	Если ТипЗнч(ПодсистемаПуть) = Тип("Строка") Тогда
		МассивПодсистем = Новый Массив;
		МассивПодсистем.Добавить(ПодсистемаПуть);
	ИначеЕсли ТипЗнч(ПодсистемаПуть) = Тип("Массив") Тогда
		МассивПодсистем = ПодсистемаПуть;
	КонецЕсли;
	
	Для Каждого Подсистема Из МассивПодсистем Цикл
		
		Если ПустаяСтрока(Подсистема) Тогда
			Продолжить;
		КонецЕсли;
		
		Подсистема = СокрЛП(Подсистема);
		
		СтруктураОбъектИПодсистема.Очистить();
		
		СтруктураОбъектИПодсистема.Вставить("ОбъектПуть", ОбъектПуть);
		СтруктураОбъектИПодсистема.Вставить("ПодсистемаПуть", Подсистема);
		Если НЕ ПроверятьДочерниеПодсистемы Тогда
			СтруктураОбъектИПодсистема.Вставить("ВходитВСоставДочернихПодсистем", Ложь);
		КонецЕсли;
		
		МассивОбъектовИПодсистем = ТаблицаОбъектовИПодсистем.НайтиСтроки(СтруктураОбъектИПодсистема);
		Если МассивОбъектовИПодсистем.Количество() > 0 Тогда
			ОбъектВходитВПодсистему = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОбъектВходитВПодсистему;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииДляРаботыСДокументомDOM

Функция ДокументDOM(ПутьКФайлу)
	
	// Если в файле есть ошибки, то не пытаемся читать его повторно.
	Если ФайлСодержитОшибки(ПутьКФайлу) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ПутьКФайлу);
		
		ПостроительDOM = Новый ПостроительDOM;
		ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
		
		ЧтениеXML.Закрыть();
	Исключение
		ЗаписатьОшибкуЧтенияФайлаВТаблицуРезультат(ПутьКФайлу, ИнформацияОбОшибке());
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ДокументDOM;
	
КонецФункции

Процедура ЗаписатьДокументDOMВФайл(ДокументDOM, ПолноеИмяФайла)
	
	ПараметрыЗаписи = ПараметрыЗаписиДокументаDOM(ПолноеИмяФайла);
	
	Кодировка      = ПараметрыЗаписи.Кодировка;
	СимволыОтступа = ПараметрыЗаписи.СимволыОтступа;
	
	ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML(Кодировка,,,, СимволыОтступа);
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ПолноеИмяФайла, ПараметрыЗаписиXML, ПараметрыЗаписи.ДобавлятьBOM);
	
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьDOM.Записать(ДокументDOM, ЗаписьXML);
	
	ЗаписьXML.Закрыть();
	
	Если НЕ ЭтоВыгрузкаXMLФайлов() Тогда
		ИсправитьФайлXMLПроектаEDT(ПолноеИмяФайла, ПараметрыЗаписи);
	КонецЕсли;
	
	СтрокаРезультата = Результат.Найти(ПолноеИмяФайла, "ПолноеИмяФайла");
	Если СтрокаРезультата <> Неопределено Тогда
		СтрокаРезультата.Изменен = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьКодировкуФайла(ПолноеИмяФайла)
	
	КодировкаФайла = "";
	
	Если НЕ апк_ФайлСуществует(ПолноеИмяФайла) Тогда
		Возврат КодировкаФайла;
	КонецЕсли;
	
	Если СтрЗаканчиваетсяНа(НРег(ПолноеИмяФайла), ".bsl")
	 ИЛИ СтрЗаканчиваетсяНа(НРег(ПолноеИмяФайла), ".txt") Тогда
		КодировкаФайла = "UTF-8";
	Иначе
		ДокументDOM = ДокументDOM(ПолноеИмяФайла);
		Если ДокументDOM = Неопределено Тогда
			Возврат КодировкаФайла;
		КонецЕсли;
		КодировкаФайла = ДокументDOM.КодировкаXML;
	КонецЕсли;
	
	Возврат КодировкаФайла;
	
КонецФункции

Функция ПараметрыЗаписиДокументаDOM(ПолноеИмяФайла)
	
	ДокументТекст = ПолучитьТекстовыйДокументИзФайла(ПолноеИмяФайла);
	
	КодировкаBOM     = ОпределитьBOMФайла(ПолноеИмяФайла);
	НаличиеBOM       = (НЕ ПустаяСтрока(КодировкаBOM));
	Кодировка        = ?(НаличиеBOM, КодировкаBOM, ПолучитьКодировкуФайла(ПолноеИмяФайла));
	РазделительСтрок = ?(ДокументТекст = Неопределено, Символы.ПС, ДокументТекст.РазделительСтрок);
	ТекстДокумента   = ?(ДокументТекст = Неопределено, "", ДокументТекст.ПолучитьТекст());
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("РазделительСтрок",           РазделительСтрок);
	ПараметрыЗаписи.Вставить("Кодировка",                  Кодировка);
	ПараметрыЗаписи.Вставить("ДобавлятьBOM",               НаличиеBOM);
	ПараметрыЗаписи.Вставить("СимволыОтступа",             ОпределитьСимволыОтступа(ПолноеИмяФайла));
	ПараметрыЗаписи.Вставить("ТекстТегаКорневогоЭлемента", ПолучитьТекстТегаКорневогоЭлементаEDT(ПолноеИмяФайла));
	ПараметрыЗаписи.Вставить("ЕстьПустаяСтрокаВКонце",     СтрЗаканчиваетсяНа(ТекстДокумента, РазделительСтрок));
	
	Возврат ПараметрыЗаписи;
	
КонецФункции

Функция ВычислитьВыражениеXPath(Выражение, ДокументDOM, ЭлементDOM = Неопределено)
	
	Разыменователь = ДокументDOM.СоздатьРазыменовательПИ();
	УзелКонтекста = ?(ЭлементDOM = Неопределено, ДокументDOM, ЭлементDOM);
	Попытка
		РезультатXPath = ДокументDOM.ВычислитьВыражениеXPath(Выражение, УзелКонтекста, Разыменователь);
	Исключение
		РезультатXPath = Неопределено;
	КонецПопытки;
	
	Возврат РезультатXPath;
	
КонецФункции

Функция ПолучитьЭлементDOMПоВыражениюXPath(Выражение, ДокументDOM, ЭлементDOM = Неопределено)
	
	РезультатXPath = ВычислитьВыражениеXPath(Выражение, ДокументDOM, ЭлементDOM);
	Если РезультатXPath = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезультатXPath.ПолучитьСледующий();
	
КонецФункции

Функция ПолучитьЗначениеЭлементаDOMПоВыражениюXPath(Выражение, ДокументDOM, ЭлементDOM = Неопределено,
	ЗначениеПоУмолчанию = "")
	
	ЭлементDOMРезультат = ПолучитьЭлементDOMПоВыражениюXPath(Выражение, ДокументDOM, ЭлементDOM);
	
	// Если такого выражения нет, то возвращаем значение по умолчанию.
	Если ЭлементDOMРезультат = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат ЭлементDOMРезультат.ТекстовоеСодержимое;
	
КонецФункции

Функция ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMРодителя, ИмяЭлемента, ТекстовоеСодержимое = "")
	
	НовыйЭлементDOM = ДокументDOM.СоздатьЭлемент(ИмяЭлемента);
	НовыйЭлементDOM.ТекстовоеСодержимое = ТекстовоеСодержимое;
	
	ЭлементDOMРодителя.ДобавитьДочерний(НовыйЭлементDOM);
	
	Возврат НовыйЭлементDOM;
	
КонецФункции

#Область ПроцедурыИФункцииДляРазбораЭлементовФормXML

Функция ПолучитьИмяЭлемента(ДокументDOM, ЭлементDOM, Префикс = "xmlns", ТипПолучения = "Атрибут")
	
	Если ТипПолучения = "Атрибут" Тогда
		Имя = ЭлементDOM.ПолучитьАтрибут("name");
	ИначеЕсли ТипПолучения = "Узел" Тогда
		Имя = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath(Префикс + ":Name", ДокументDOM, ЭлементDOM);
	Иначе
		Имя = "";
	КонецЕсли;
	
	Если Имя = Неопределено Тогда
		Имя = "";
	КонецЕсли;
	
	Возврат Имя;
	
КонецФункции

Функция ПолучитьЗаголовокЭлемента(ДокументDOM, ЭлементDOMЭлемента, Префикс = "xmlns", КодЯзыка = "ru")
	
	ВыражениеXPath = СтрШаблон("%1:Title/v8:item/v8:lang[text()='%2']", Префикс, КодЯзыка);
	ЭлементDOMЯзык = ПолучитьЭлементDOMПоВыражениюXPath(ВыражениеXPath, ДокументDOM, ЭлементDOMЭлемента);
	
	Если ЭлементDOMЯзык = Неопределено Тогда
		// Возможно, при добавлении заголовка не было указано пространство имен, проверяем заголовок в дочерних элементах.
		Заголовок = ПолучитьЗаголовокЭлементаПоДочернимУзлам(ДокументDOM, ЭлементDOMЭлемента, КодЯзыка);
	Иначе
		ЭлементDOMЭлементаЗаголовка = ЭлементDOMЯзык.РодительскийУзел;
		Заголовок = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath("v8:content", ДокументDOM, ЭлементDOMЭлементаЗаголовка);
	КонецЕсли;
	
	Возврат Заголовок;
	
КонецФункции

Функция ПолучитьЗаголовокЭлементаПоДочернимУзлам(ДокументDOM, ЭлементDOMЭлемента, КодЯзыка)
	
	Заголовок = "";
	
	// Получаем узел "Title".
	ЭлементDOMЗаголовок = ПолучитьЭлементDOMПоВыражениюXPath("Title", ДокументDOM, ЭлементDOMЭлемента);
	Если ЭлементDOMЗаголовок = Неопределено Тогда
		Возврат Заголовок;
	КонецЕсли;
	
	ЭлементDOMЯзык = Неопределено;
	
	// Обходим дочерние узлы узла "Title".
	ДочерниеУзлыЗаголовка = ЭлементDOMЗаголовок.ДочерниеУзлы;
	Для Каждого ДочернийУзелЗаголовка Из ДочерниеУзлыЗаголовка Цикл
		// Проверяем только узел "v8:item".
		Если СтрСравнить(ДочернийУзелЗаголовка.ИмяЭлемента, "v8:item") <> 0 Тогда
			Продолжить;
		КонецЕсли;
		// Обходим дочерние узлы.
		Для Каждого ДочернийУзелЭлементаЗаголовка Из ДочернийУзелЗаголовка.ДочерниеУзлы Цикл
			// Ищем узел "v8:lang", текстовое содержимое которого - код соответствующего языка.
			Если (СтрСравнить(ДочернийУзелЭлементаЗаголовка.ИмяЭлемента, "v8:lang") = 0)
				И (СтрСравнить(ДочернийУзелЭлементаЗаголовка.ТекстовоеСодержимое, КодЯзыка) = 0) Тогда
				// Узел "v8:lang" найден, выходим.
				ЭлементDOMЯзык = ДочернийУзелЭлементаЗаголовка;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЭлементDOMЯзык <> Неопределено Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЭлементDOMЯзык = Неопределено Тогда
		Возврат Заголовок;
	КонецЕсли;
	
	// Получаем родительский узел для узла "v8:lang".
	ЭлементDOMЗаголовка = ЭлементDOMЯзык.РодительскийУзел;
	
	// Обходим дочерние узлы родительского узла.
	Для Каждого ДочернийУзелЭлементаЗаголовка Из ЭлементDOMЗаголовка.ДочерниеУзлы Цикл
		// Ищем узел "v8:content".
		Если СтрСравнить(ДочернийУзелЭлементаЗаголовка.ИмяЭлемента, "v8:content") = 0 Тогда
			// Узел "v8:content" найден, получаем заголовок.
			Заголовок = ДочернийУзелЭлементаЗаголовка.ТекстовоеСодержимое;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Заголовок;
	
КонецФункции

Функция ПолучитьСинонимОбъекта(ДокументDOM, ЭлементDOMСвойствОбъекта, Префикс = "xmlns")
	
	ВыражениеXPath = СтрШаблон("%1:Synonym/v8:item/v8:lang[text()='%2']", Префикс, КодОсновногоЯзыка);
	ЭлементDOMЯзык = ПолучитьЭлементDOMПоВыражениюXPath(ВыражениеXPath, ДокументDOM, ЭлементDOMСвойствОбъекта);
	Если ЭлементDOMЯзык = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ЭлементDOMv8item = ЭлементDOMЯзык.РодительскийУзел;
	
	Синоним = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath("v8:content", ДокументDOM, ЭлементDOMv8item);
	
	Возврат Синоним;
	
КонецФункции

Функция ПолучитьПодсказкуЭлемента(ДокументDOM, ЭлементDOMЭлемента, Префикс = "xmlns")
	
	ВыражениеXPath = СтрШаблон("%1:ToolTip/v8:item/v8:lang[text()='%2']", Префикс, КодОсновногоЯзыка);
	ЭлементDOMЯзык = ПолучитьЭлементDOMПоВыражениюXPath(ВыражениеXPath, ДокументDOM, ЭлементDOMЭлемента);
	Если ЭлементDOMЯзык = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ЭлементDOMv8item = ЭлементDOMЯзык.РодительскийУзел;
	
	Подсказка = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath("v8:content", ДокументDOM, ЭлементDOMv8item);
	
	Возврат Подсказка;
	
КонецФункции

Функция ПолучитьЗаголовокПоляСКД(ДокументDOM, ЭлементDOMЭлемента, Префикс = "xmlns", КодЯзыка = "ru")
	
	ПрефиксТипа = ?(Префикс = "", "", СтрШаблон("%1:", Префикс));
	
	ВыражениеXPath = СтрШаблон("%1title", ПрефиксТипа);
	Заголовок = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath(ВыражениеXPath, ДокументDOM, ЭлементDOMЭлемента);
	Если Не ПустаяСтрока(Заголовок) Тогда
		Возврат Заголовок;
	КонецЕсли;
	
	ВыражениеXPath = СтрШаблон("%1title/v8:item/v8:lang[text()='%2']", ПрефиксТипа, КодЯзыка);
	ЭлементDOMЯзык = ПолучитьЭлементDOMПоВыражениюXPath(ВыражениеXPath, ДокументDOM, ЭлементDOMЭлемента);
	Если ЭлементDOMЯзык = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ЭлементDOMv8item = ЭлементDOMЯзык.РодительскийУзел;
	
	Заголовок = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath("v8:content", ДокументDOM, ЭлементDOMv8item);
	
	Возврат Заголовок;
	
КонецФункции

Процедура ОчиститьПодсказкуЭлемента(ДокументDOM, ЭлементDOMЭлемента, Префикс = "xmlns")
	
	ВыражениеXPath = СтрШаблон("%1:ToolTip", Префикс);
	ЭлементDOMПодсказка = ПолучитьЭлементDOMПоВыражениюXPath(ВыражениеXPath, ДокументDOM, ЭлементDOMЭлемента);
	Если ЭлементDOMПодсказка <> Неопределено Тогда
		ЭлементDOMПодсказка.ТекстовоеСодержимое = "";
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьЗаголовокЭлемента(ДокументDOM, ЭлементDOMЭлементаФормы, ЗаголовокДляУстановки, КодЯзыка = "ru")
	
	// Проверяем элемент "Title".
	ЭлементDOMTitle = ПолучитьЭлементDOMПоВыражениюXPath("xmlns:Title", ДокументDOM, ЭлементDOMЭлементаФормы);
	Если ЭлементDOMTitle = Неопределено Тогда
		// Возможно, что элемент был добавлен в предыдущей итерации без указания пространства имен. Ищем еще раз.
		ЭлементDOMTitle = ПолучитьЭлементDOMПоВыражениюXPath("Title", ДокументDOM, ЭлементDOMЭлементаФормы);
	КонецЕсли;
	
	Если ЭлементDOMTitle = Неопределено Тогда
		// Если элемента "Title" не найдено и устанавливаемый заголовок пустой, то выходим.
		Если ПустаяСтрока(ЗаголовокДляУстановки) Тогда
			Возврат;
		КонецЕсли;
		// Иначе добавляем элемент "Title".
		ЭлементDOMTitle = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMЭлементаФормы, "Title");
	КонецЕсли;
	
	// Проверяем элемент "v8:item" с подчиненным элементом на русском языке.
	ВыражениеXPath = СтрШаблон("v8:item/v8:lang[text()='%1']", КодЯзыка);
	ЭлементDOMv8lang = ПолучитьЭлементDOMПоВыражениюXPath(ВыражениеXPath, ДокументDOM, ЭлементDOMTitle);
	Если ЭлементDOMv8lang = Неопределено Тогда
		// Если элемента "v8:item" на русском языке не найдено и устанавливаемый заголовок пустой, то выходим.
		Если ПустаяСтрока(ЗаголовокДляУстановки) Тогда
			Возврат;
		КонецЕсли;
		// Иначе добавляем элемент "v8:item".
		ЭлементDOMv8item = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMTitle, "v8:item");
		ЭлементDOMv8lang = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMv8item, "v8:lang", КодЯзыка);
	КонецЕсли;
	
	ЭлементDOMv8item = ЭлементDOMv8lang.РодительскийУзел;
	ЭлементDOMv8content = ПолучитьЭлементDOMПоВыражениюXPath("v8:content", ДокументDOM, ЭлементDOMv8item);
	Если ЭлементDOMv8content = Неопределено Тогда
		ЭлементDOMv8content = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMv8item, "v8:content", ЗаголовокДляУстановки);
	Иначе
		ЭлементDOMv8content.ТекстовоеСодержимое = ЗаголовокДляУстановки;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьСинонимОбъекта(ДокументDOM, ЭлементDOMСвойствОбъекта, СинонимОбъекта)
	
	// Проверяем элемент "Synonym".
	ЭлементDOMСиноним = ПолучитьЭлементDOMПоВыражениюXPath("xmlns:Synonym", ДокументDOM, ЭлементDOMСвойствОбъекта);
	Если ЭлементDOMСиноним = Неопределено Тогда
		// Если элемента "Synonym" не найдено и устанавливаемый синоним пустой, то выходим.
		Если ПустаяСтрока(СинонимОбъекта) Тогда
			Возврат;
		КонецЕсли;
		// Иначе добавляем элемент "Synonym".
		ЭлементDOMСиноним = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMСвойствОбъекта, "Synonym");
	КонецЕсли;
	
	// Проверяем элемент "v8:item" с подчиненным элементом на основном языке конфигурации.
	ЭлементDOMv8lang = ПолучитьЭлементDOMПоВыражениюXPath(СтрШаблон("v8:item/v8:lang[text()='%1']", КодОсновногоЯзыка), ДокументDOM, ЭлементDOMСиноним);
	Если ЭлементDOMv8lang = Неопределено Тогда
		// Если элемента "v8:item" не найдено и устанавливаемый синоним пустой, то выходим.
		Если ПустаяСтрока(СинонимОбъекта) Тогда
			Возврат;
		КонецЕсли;
		// Иначе добавляем элемент "v8:item".
		ЭлементDOMv8item = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMСиноним, "v8:item");
		ЭлементDOMv8lang = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMv8item, "v8:lang", КодОсновногоЯзыка);
	КонецЕсли;
	
	ЭлементDOMv8item = ЭлементDOMv8lang.РодительскийУзел;
	ЭлементDOMv8content = ПолучитьЭлементDOMПоВыражениюXPath("v8:content", ДокументDOM, ЭлементDOMv8item);
	Если ЭлементDOMv8content = Неопределено Тогда
		ЭлементDOMv8content = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMv8item, "v8:content", СинонимОбъекта);
	Иначе
		ЭлементDOMv8content.ТекстовоеСодержимое = СинонимОбъекта;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьОтображатьЗаголовокЭлементаФормы(ДокументDOM, ЭлементDOMЭлементаФормы, ЗначениеОтображатьЗаголовок = Ложь)
	
	ЗначениеОтображатьЗаголовокТекст = ?(ЗначениеОтображатьЗаголовок, "true", "false");
	
	ЭлементDOMУстановитьЗаголовок = ПолучитьЭлементDOMПоВыражениюXPath("xmlns:ShowTitle", ДокументDOM, ЭлементDOMЭлементаФормы);
	Если ЭлементDOMУстановитьЗаголовок = Неопределено Тогда
		ЭлементDOMУстановитьЗаголовок = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMЭлементаФормы, "ShowTitle", ЗначениеОтображатьЗаголовокТекст);
	Иначе
		ЭлементDOMУстановитьЗаголовок.ТекстовоеСодержимое = ЗначениеОтображатьЗаголовокТекст;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьПоложениеЗаголовкаДляЭлементаФормы(ДокументDOM, ЭлементDOMЭлементаФормы, ЗначениеПоложениеЗаголовка = "None")
	
	ЭлементDOMПоложениеЗаголовка = ПолучитьЭлементDOMПоВыражениюXPath("xmlns:TitleLocation", ДокументDOM, ЭлементDOMЭлементаФормы);
	Если ЭлементDOMПоложениеЗаголовка = Неопределено Тогда
		ЭлементDOMПоложениеЗаголовка = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMЭлементаФормы, "TitleLocation", ЗначениеПоложениеЗаголовка);
	Иначе
		ЭлементDOMПоложениеЗаголовка.ТекстовоеСодержимое = ЗначениеПоложениеЗаголовка;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьПризнакИспользоватьВсегда(ДокументDOM, ЭлементDOMРеквизит, ИмяРеквизитаСсылка)
	
	ЭлементDOMИспользоватьВсегда = ПолучитьЭлементDOMПоВыражениюXPath("xmlns:UseAlways", ДокументDOM, ЭлементDOMРеквизит);
	Если ЭлементDOMИспользоватьВсегда = Неопределено Тогда
		ЭлементDOMИспользоватьВсегда = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMРеквизит, "UseAlways");
	КонецЕсли;
	
	ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMИспользоватьВсегда, "Field", ИмяРеквизитаСсылка);
	
КонецПроцедуры

Процедура УстановитьЗаголовокПоляСКД(ДокументDOM, ЭлементDOMЭлементаФормы, ЗаголовокДляУстановки, ПрефиксПоля = "xmlns", КодЯзыка = "ru")
	
	// Проверяем элемент "title".
	ЭлементDOMTitle = ПолучитьЭлементDOMПоВыражениюXPath(СтрШаблон("%1:title[@xsi:type='v8:LocalStringType']", ПрефиксПоля), ДокументDOM, ЭлементDOMЭлементаФормы);
	Если ЭлементDOMTitle = Неопределено Тогда
		// Возможно, что элемент был добавлен в предыдущей итерации без указания пространства имен. Ищем еще раз.
		ЭлементDOMTitle = ПолучитьЭлементDOMПоВыражениюXPath("title[@xsi:type='v8:LocalStringType']", ДокументDOM, ЭлементDOMЭлементаФормы);
	КонецЕсли;
	
	Если ЭлементDOMTitle = Неопределено Тогда
		// Если элемента "title" не найдено и устанавливаемый заголовок пустой, то выходим.
		Если ПустаяСтрока(ЗаголовокДляУстановки) Тогда
			Возврат;
		КонецЕсли;
		// Иначе добавляем элемент "title".
		ЭлементDOMTitle = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMЭлементаФормы, СтрШаблон("%1title", ?(ПрефиксПоля = "xmlns", "", СтрШаблон("%1:", ПрефиксПоля))));
		ЭлементDOMTitle.УстановитьАтрибут("http://www.w3.org/2001/XMLSchema-instance", "xsi:type", "v8:LocalStringType");
	КонецЕсли;
	
	// Проверяем элемент "v8:item" с подчиненным элементом на русском языке.
	ВыражениеXPath = СтрШаблон("v8:item/v8:lang[text()='%1']", КодЯзыка);
	ЭлементDOMv8lang = ПолучитьЭлементDOMПоВыражениюXPath(ВыражениеXPath, ДокументDOM, ЭлементDOMTitle);
	Если ЭлементDOMv8lang = Неопределено Тогда
		// Если элемента "v8:item" на русском языке не найдено и устанавливаемый заголовок пустой, то выходим.
		Если ПустаяСтрока(ЗаголовокДляУстановки) Тогда
			Возврат;
		КонецЕсли;
		// Иначе добавляем элемент "v8:item".
		ЭлементDOMv8item = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMTitle, "v8:item");
		ЭлементDOMv8lang = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMv8item, "v8:lang", КодЯзыка);
	КонецЕсли;
	
	ЭлементDOMv8item = ЭлементDOMv8lang.РодительскийУзел;
	ЭлементDOMv8content = ПолучитьЭлементDOMПоВыражениюXPath("v8:content", ДокументDOM, ЭлементDOMv8item);
	Если ЭлементDOMv8content = Неопределено Тогда
		ЭлементDOMv8content = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMv8item, "v8:content", ЗаголовокДляУстановки);
	Иначе
		ЭлементDOMv8content.ТекстовоеСодержимое = ЗаголовокДляУстановки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииДляРазбораЭлементовФормEDT

Функция ПолучитьИмяЭлементаEDT(ДокументDOM, ЭлементDOM)
	
	Имя = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath("name", ДокументDOM, ЭлементDOM);
	
	Если Имя = Неопределено Тогда
		Имя = "";
	КонецЕсли;
	
	Возврат Имя;
	
КонецФункции

Функция ПолучитьЗаголовокЭлементаEDT(ДокументDOM, ЭлементDOMЭлемента, КодЯзыка = "ru")
	
	ВыражениеXPath = СтрШаблон("title/key[text()='%1']", КодЯзыка);
	ЭлементDOMЯзык = ПолучитьЭлементDOMПоВыражениюXPath(ВыражениеXPath, ДокументDOM, ЭлементDOMЭлемента);
	Если ЭлементDOMЯзык = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ЭлементDOM = ЭлементDOMЯзык.РодительскийУзел;
	
	Заголовок = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath("value", ДокументDOM, ЭлементDOM);
	
	Возврат Заголовок;
	
КонецФункции

Функция ПолучитьЗаголовокПоляДинамическогоСпискаEDT(ДокументDOM, ЭлементDOMЭлемента, КодЯзыка = "ru")
	
	ВыражениеXPath = СтрШаблон("title/localValue/content/key[text()='%1']", КодЯзыка);
	ЭлементDOMЯзык = ПолучитьЭлементDOMПоВыражениюXPath(ВыражениеXPath, ДокументDOM, ЭлементDOMЭлемента);
	Если ЭлементDOMЯзык = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ЭлементDOM = ЭлементDOMЯзык.РодительскийУзел;
	
	Заголовок = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath("value", ДокументDOM, ЭлементDOM);
	
	Возврат Заголовок;
	
КонецФункции

Функция ПолучитьСинонимОбъектаEDT(ДокументDOM, ЭлементDOMСвойствОбъекта)
	
	ВыражениеXPath = СтрШаблон("synonym/key[text()='%1']", КодОсновногоЯзыка);
	ЭлементDOMЯзык = ПолучитьЭлементDOMПоВыражениюXPath(ВыражениеXPath, ДокументDOM, ЭлементDOMСвойствОбъекта);
	Если ЭлементDOMЯзык = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ЭлементDOMv8item = ЭлементDOMЯзык.РодительскийУзел;
	
	Синоним = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath("value", ДокументDOM, ЭлементDOMv8item);
	
	Возврат Синоним;
	
КонецФункции

Функция ПолучитьПодсказкуЭлементаEDT(ДокументDOM, ЭлементDOMЭлемента)
	
	ВыражениеXPath = СтрШаблон("toolTip/key[text()='%1']", КодОсновногоЯзыка);
	ЭлементDOMЯзык = ПолучитьЭлементDOMПоВыражениюXPath(ВыражениеXPath, ДокументDOM, ЭлементDOMЭлемента);
	Если ЭлементDOMЯзык = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ЭлементDOM = ЭлементDOMЯзык.РодительскийУзел;
	
	Подсказка = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath("value", ДокументDOM, ЭлементDOM);
	
	Возврат Подсказка;
	
КонецФункции

Процедура УдалитьПодсказкуЭлементаEDT(ДокументDOM, ЭлементDOMЭлемента)
	
	ВыражениеXPath = СтрШаблон("toolTip/key[text()='%1']", КодОсновногоЯзыка);
	ЭлементDOMЯзык = ПолучитьЭлементDOMПоВыражениюXPath(ВыражениеXPath, ДокументDOM, ЭлементDOMЭлемента);
	Если ЭлементDOMЯзык = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементDOMПодсказка = ЭлементDOMЯзык.РодительскийУзел;
	
	ВыражениеXPath = "value";
	ЭлементDOMЗначениеПодсказки = ПолучитьЭлементDOMПоВыражениюXPath(ВыражениеXPath, ДокументDOM, ЭлементDOMПодсказка);
	Если ЭлементDOMЗначениеПодсказки <> Неопределено Тогда
		ЭлементDOMЭлемента.УдалитьДочерний(ЭлементDOMПодсказка);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьЗаголовокЭлементаEDT(ДокументDOM, ЭлементDOMЭлементаФормы, ЗаголовокДляУстановки, КодЯзыка = "ru")
	
	// Проверяем элемент "title/key" с подчиненным элементом на русском языке.
	ВыражениеXPath = СтрШаблон("title/key[text()='%1']", КодЯзыка);
	ЭлементDOMkey = ПолучитьЭлементDOMПоВыражениюXPath(ВыражениеXPath, ДокументDOM, ЭлементDOMЭлементаФормы);
	Если ЭлементDOMkey = Неопределено Тогда
		
		// Если элемента "key" на русском языке не найдено и устанавливаемый заголовок пустой, то выходим.
		Если ПустаяСтрока(ЗаголовокДляУстановки) Тогда
			Возврат;
		КонецЕсли;
		
		// В файле проекта EDT для каждого языка элемент "title" дублируется, поэтому добавляем элемент "title" и "key".
		ЭлементDOMtitle = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMЭлементаФормы, "title");
		ЭлементDOMkey = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMtitle, "key", КодЯзыка);
		
		// Перенесем элемент "title" после узла "userVisible".
		ВставитьЭлементDOMПослеУказанногоУзла(ДокументDOM, ЭлементDOMЭлементаФормы, ЭлементDOMtitle, "userVisible");
		
	Иначе
		
		// Если элемент "key" с заданным языком существует, то определяем родительский элемент "title".
		ЭлементDOMtitle = ЭлементDOMkey.РодительскийУзел;
		Если ЭлементDOMtitle = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ЭлементDOMvalue = ПолучитьЭлементDOMПоВыражениюXPath("value", ДокументDOM, ЭлементDOMtitle);
	Если ЭлементDOMvalue = Неопределено Тогда
		ЭлементDOMvalue = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMtitle, "value", ЗаголовокДляУстановки);
	Иначе
		ЭлементDOMvalue.ТекстовоеСодержимое = ЗаголовокДляУстановки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВставитьЭлементDOMПослеУказанногоУзла(ДокументDOM, ЭлементDOMРодителя, ЭлементDOMВставляемогоУзла, ИмяУзла)
	
	ЭлементDOMУказанногоУзла = ПолучитьЭлементDOMПоВыражениюXPath(ИмяУзла, ДокументDOM, ЭлементDOMРодителя);
	Если ЭлементDOMУказанногоУзла = Неопределено Тогда
		// Если указанного узла не существует, то выходим.
		Возврат;
	КонецЕсли;
	
	// Получаем следующий узел после указанного.
	ЭлементDOMПослеУказанногоУзла = ЭлементDOMУказанногоУзла.СледующийСоседний;
	Если ЭлементDOMПослеУказанногоУзла = Неопределено Тогда
		// Если указанный узел - последний, то переносить не надо, выходим.
		Возврат;
	КонецЕсли;
	
	Если ЭлементDOMВставляемогоУзла = ЭлементDOMПослеУказанногоУзла Тогда
		// Если вставляемый узел сразу после указанного узла, то выходим.
		Возврат;
	КонецЕсли;
	
	// Переносим вставляемый узел после указанного узла.
	ЭлементDOMРодителя.ВставитьПеред(ЭлементDOMВставляемогоУзла, ЭлементDOMПослеУказанногоУзла);
	
КонецПроцедуры

Процедура УстановитьСинонимОбъектаEDT(ДокументDOM, ЭлементDOMСвойствОбъекта, СинонимОбъекта)
	
	// Проверяем элемент "synonym".
	ЭлементDOMСиноним = ПолучитьЭлементDOMПоВыражениюXPath("synonym", ДокументDOM, ЭлементDOMСвойствОбъекта);
	Если ЭлементDOMСиноним = Неопределено Тогда
		// Если элемента "synonym" не найдено и устанавливаемый синоним пустой, то выходим.
		Если ПустаяСтрока(СинонимОбъекта) Тогда
			Возврат;
		КонецЕсли;
		// Иначе добавляем элемент "synonym".
		ЭлементDOMСиноним = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMСвойствОбъекта, "synonym");
	КонецЕсли;
	
	// Проверяем элемент "key" с подчиненным элементом на основном языке конфигурации.
	ЭлементDOMkey = ПолучитьЭлементDOMПоВыражениюXPath(СтрШаблон("key[text()='%1']", КодОсновногоЯзыка), ДокументDOM, ЭлементDOMСиноним);
	Если ЭлементDOMkey = Неопределено Тогда
		// Если элемента "key" не найдено и устанавливаемый синоним пустой, то выходим.
		Если ПустаяСтрока(СинонимОбъекта) Тогда
			Возврат;
		КонецЕсли;
		// Иначе добавляем элемент "key".
		ЭлементDOMkey = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMСиноним, "key", КодОсновногоЯзыка);
	КонецЕсли;
	
	ЭлементDOMvalue = ПолучитьЭлементDOMПоВыражениюXPath("value", ДокументDOM, ЭлементDOMСиноним);
	Если ЭлементDOMvalue = Неопределено Тогда
		ЭлементDOMvalue = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMСиноним, "value", СинонимОбъекта);
	Иначе
		ЭлементDOMvalue.ТекстовоеСодержимое = СинонимОбъекта;
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьОтображениеЗаголовкаЭлементаФормыEDT(ДокументDOM, ЭлементDOMЭлементаФормы)
	
	ВыражениеПоиска = "extInfo/showTitle";
	ЗначениеОтображенияЗаголовка = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath(ВыражениеПоиска, ДокументDOM, ЭлементDOMЭлементаФормы);
	Если СтрСравнить(ЗначениеОтображенияЗаголовка, "false") <> 0 Тогда
		// Если узел "showTitle" не равен "false", то выходим.
		Возврат;
	КонецЕсли;
	
	ЭлементDOMГруппаСвойств = ПолучитьЭлементDOMПоВыражениюXPath("extInfo", ДокументDOM, ЭлементDOMЭлементаФормы);
	Если ЭлементDOMГруппаСвойств = Неопределено Тогда
		// Данный узел выгружается всегда. Если его нет в файле, значит файл имеет неверную структуру.
		// Поэтому не добавляем узел программно, а сразу выходим из процедуры.
		Возврат;
	КонецЕсли;
	
	ЭлементDOMОтображениеЗаголовка = ПолучитьЭлементDOMПоВыражениюXPath("showTitle", ДокументDOM, ЭлементDOMГруппаСвойств);
	Если ЭлементDOMОтображениеЗаголовка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Удаляем тег <showTitle>, т.к. в EDT этого тега нет, если значение по умолчанию "false".
	ЭлементDOMГруппаСвойств.УдалитьДочерний(ЭлементDOMОтображениеЗаголовка);
	
КонецПроцедуры

Процедура УстановитьПоложениеЗаголовкаДляЭлементаФормыEDT(ДокументDOM, ЭлементDOMЭлементаФормы, ЗначениеПоложениеЗаголовка = "None")
	
	ЭлементDOMПоложениеЗаголовка = ПолучитьЭлементDOMПоВыражениюXPath("titleLocation", ДокументDOM, ЭлементDOMЭлементаФормы);
	Если ЭлементDOMПоложениеЗаголовка = Неопределено Тогда
		ЭлементDOMПоложениеЗаголовка = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMЭлементаФормы, "titleLocation", ЗначениеПоложениеЗаголовка);
	Иначе
		ЭлементDOMПоложениеЗаголовка.ТекстовоеСодержимое = ЗначениеПоложениеЗаголовка;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьПризнакИспользоватьВсегдаEDT(ДокументDOM, ЭлементDOMРеквизит, ИмяРеквизитаСсылка)
	
	ЭлементDOMИспользоватьВсегда = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMРеквизит, "notDefaultUseAlwaysAttributes");
	ЭлементDOMИспользоватьВсегда.УстановитьАтрибут("http://www.w3.org/2001/XMLSchema-instance", "xsi:type", "form:DataPath");
	
	ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMИспользоватьВсегда, "segments", ИмяРеквизитаСсылка);
	
КонецПроцедуры

Процедура УстановитьЗаголовокПоляДинамическогоСпискаEDT(ДокументDOM, ЭлементDOMЭлементаФормы, ЗаголовокДляУстановки, КодЯзыка = "ru")
	
	// Проверяем элемент "title/key" с подчиненным элементом на русском языке.
	ВыражениеXPath = СтрШаблон("title/localValue/content/key[text()='%1']", КодЯзыка);
	ЭлементDOMkey = ПолучитьЭлементDOMПоВыражениюXPath(ВыражениеXPath, ДокументDOM, ЭлементDOMЭлементаФормы);
	Если ЭлементDOMkey = Неопределено Тогда
		
		// Если элемента "key" на русском языке не найдено и устанавливаемый заголовок пустой, то выходим.
		Если ПустаяСтрока(ЗаголовокДляУстановки) Тогда
			Возврат;
		КонецЕсли;
		
		// В файле проекта EDT для каждого языка элемент "title" дублируется, поэтому добавляем элемент "title" и "key".
		ЭлементDOMtitle = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMЭлементаФормы, "title");
		ЭлементDOMlocalValue = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMtitle, "localValue");
		ЭлементDOMcontent = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMlocalValue, "content");
		ЭлементDOMkey = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMcontent, "key", КодЯзыка);
		
		// Перенесем элемент "title" после узла "field".
		ВставитьЭлементDOMПослеУказанногоУзла(ДокументDOM, ЭлементDOMЭлементаФормы, ЭлементDOMtitle, "field");
		
	Иначе
		
		// Если элемент "key" с заданным языком существует, то определяем родительский элемент "title".
		ЭлементDOMcontent = ЭлементDOMkey.РодительскийУзел;
		Если ЭлементDOMcontent = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ЭлементDOMvalue = ПолучитьЭлементDOMПоВыражениюXPath("value", ДокументDOM, ЭлементDOMcontent);
	Если ЭлементDOMvalue = Неопределено Тогда
		ЭлементDOMvalue = ДобавитьДочернийЭлементDOM(ДокументDOM, ЭлементDOMcontent, "value", ЗаголовокДляУстановки);
	Иначе
		ЭлементDOMvalue.ТекстовоеСодержимое = ЗаголовокДляУстановки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПроцедурыИФункцииПриведенияКСтандартам

Функция ПолучитьХранилищеЗначений(Значение)
	
	Возврат Новый ХранилищеЗначения(Значение);
	
КонецФункции

Процедура ПривестиКонфигурациюКСтандартам(ЗначениеФлаговНаФорме = Неопределено) Экспорт
	
	Попытка
		ЗаполнитьКонтекст();
		КодОсновногоЯзыка = Контекст["КодОсновногоЯзыкаКонфигурации"];
		
		// Если вызов из формы, то заменим текущее значение флагов на выбранное пользователем.
		Если ЗначениеФлаговНаФорме <> Неопределено Тогда
			ЗначениеФлагов = ЗначениеФлаговНаФорме;
		КонецЕсли;
		
		// Если все-таки значение флагов по какой-то причине не заполнено, переопределим по умолчанию.
		Если ЗначениеФлагов = Неопределено Тогда
			ЗначениеФлагов = ПолучитьЗначенияФлаговПоУмолчанию();
		КонецЕсли;
		
		ЭтоВыгрузкаXMLФайлов = ЭтоВыгрузкаXMLФайлов();
		УстановленОтборПоОбъектам = ПроверитьУстановленОтборПоОбъектам();
		ИнициализироватьТаблицуВыбранныхОбъектов();
		
		Если ЗначениеФлагов.Стандарт437 Тогда
			ПривестиКонфигурациюКСтандарту437();
		КонецЕсли;
		
		Если ЗначениеФлагов.Стандарт441 Тогда
			ПривестиКонфигурациюКСтандарту441();
		КонецЕсли;
		
		Если ЗначениеФлагов.Стандарт453 Тогда
			ПривестиКонфигурациюКСтандарту453();
		КонецЕсли;
		
		Если ЗначениеФлагов.Стандарт455 Тогда
			ПривестиКонфигурациюКСтандарту455();
		КонецЕсли;
		
		Если ЗначениеФлагов.Стандарт456 Тогда
			ПривестиКонфигурациюКСтандарту456();
		КонецЕсли;
		
		Если ЗначениеФлагов.Стандарт458 Тогда
			ПривестиКонфигурациюКСтандарту458();
		КонецЕсли;
		
		Если ЗначениеФлагов.Стандарт467 Тогда
			ПривестиКонфигурациюКСтандарту467();
		КонецЕсли;
		
		Если ЗначениеФлагов.Стандарт474 Тогда
			ПривестиКонфигурациюКСтандарту474();
		КонецЕсли;
		
		Если ЗначениеФлагов.Стандарт478 Тогда
			Если ЭтоВыгрузкаXMLФайлов Тогда
				ПривестиКонфигурациюКСтандарту478();
			Иначе
				ПривестиКонфигурациюКСтандарту478EDT();
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеФлагов.Стандарт644 Тогда
			ПривестиКонфигурациюКСтандарту644();
		КонецЕсли;
		
		Если ЗначениеФлагов.Стандарт680 Тогда
			ПривестиКонфигурациюКСтандарту680();
		КонецЕсли;
		
		Если ЗначениеФлагов.Стандарт702 Тогда
			Если ЭтоВыгрузкаXMLФайлов Тогда
				ПривестиКонфигурациюКСтандарту702();
			Иначе
				ПривестиКонфигурациюКСтандарту702EDT();
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеФлагов.Стандарт762 Тогда
			ПривестиКонфигурациюКСтандарту762();
		КонецЕсли;
		
		Если ЗначениеФлагов.Стандарт765 Тогда
			Если ЭтоВыгрузкаXMLФайлов Тогда
				ПривестиКонфигурациюКСтандарту765();
			Иначе
				ПривестиКонфигурациюКСтандарту765EDT();
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеФлагов.Стандарт767 Тогда
			Если ЭтоВыгрузкаXMLФайлов Тогда
				ПривестиКонфигурациюКСтандарту767();
			Иначе
				ПривестиКонфигурациюКСтандарту767EDT();
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		
		Объект = НСтр("ru='Обработка АвтоформатированиеКодаИЛокализация'; en='Обработка АвтоформатированиеКодаИЛокализация'",
			КодОсновногоЯзыка);
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		СформироватьXMLФайлОшибки(Объект, ОписаниеОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

Функция ПроверитьФайлВыбранДляРедактирования(ПолноеИмяФайла)
	
	СтрокаФайлаРезультата = Результат.Найти(ПолноеИмяФайла, "ПолноеИмяФайла");
	Если СтрокаФайлаРезультата = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если УстановленОтборПоОбъектам Тогда
		СтрокаСтруктуры = ТаблицаВыбранныхОбъектов.Найти(СтрокаФайлаРезультата.Объект, "ПутьОбъекта");
		Если СтрокаСтруктуры = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если (НЕ СтрокаФайлаРезультата.ЗахваченВХранилище)
		 ИЛИ (НЕ СтрокаФайлаРезультата.РедактированиеРазрешено)
		 ИЛИ (НЕ СтрокаФайлаРезультата.ВыбранДляИзменения)
		 ИЛИ СтрокаФайлаРезультата.СодержитОшибки Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#Область ПроцедурыИФункцииПриведенияКСтандарту437ОформлениеТекстовЗапросов

Функция ПривестиОбъектКСтандарту437(ПолноеИмяФайла)
	
	ДокументТекст = ПолучитьТекстовыйДокументИзФайла(ПолноеИмяФайла, КодировкаТекста.UTF8);
	Если ДокументТекст = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ОбъектИзменен = Ложь;
	
	Если ЗначениеФлагов.КаноническийВидКлючевыхСловЗапроса Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = ПроверкаКаноническогоНаписанияКлючевыхСловЗапроса(ДокументТекст);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("КаноническийВидКлючевыхСловЗапроса", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "КаноническийВидКлючевыхСловЗапроса");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбъектИзменен Тогда
		ЗаписатьИзмененияВФайл(ДокументТекст, ПолноеИмяФайла);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Процедура ПривестиКонфигурациюКСтандарту437()
	
	МассивФайлов = НайтиФайлы(КаталогВыгрузкиРезультат, "*.bsl", Истина);
	Для Каждого Файл Из МассивФайлов Цикл
		
		ПолноеИмяФайла = Файл.ПолноеИмя;
		Если ПроверитьФайлВыбранДляРедактирования(ПолноеИмяФайла) Тогда
			ПривестиОбъектКСтандарту437(ПолноеИмяФайла);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииПриведенияКСтандарту441ОбщиеТребованияКПостроениюКонструкцийВстроенногоЯзыка

Функция ПривестиОбъектКСтандарту441(ПолноеИмяФайла)
	
	ДокументТекст = ПолучитьТекстовыйДокументИзФайла(ПолноеИмяФайла, КодировкаТекста.UTF8);
	Если ДокументТекст = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ОбъектИзменен = Ложь;
	
	Если ЗначениеФлагов.КаноническийВидКлючевыхСловЯзыка Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = ПроверкаКаноническогоНаписанияКлючевыхСлов(ДокументТекст);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("КаноническийВидКлючевыхСловЯзыка", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "КаноническийВидКлючевыхСловЯзыка");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбъектИзменен Тогда
		ЗаписатьИзмененияВФайл(ДокументТекст, ПолноеИмяФайла);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Процедура ПривестиКонфигурациюКСтандарту441()
	
	МассивФайлов = НайтиФайлы(КаталогВыгрузкиРезультат, "*.bsl", Истина);
	Для Каждого Файл Из МассивФайлов Цикл
		
		ПолноеИмяФайла = Файл.ПолноеИмя;
		Если ПроверитьФайлВыбранДляРедактирования(ПолноеИмяФайла) Тогда
			ПривестиОбъектКСтандарту441(ПолноеИмяФайла);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииПриведенияКСтандарту453ОписаниеПроцедурИФункций

Процедура ПривестиОбъектКСтандарту453(ПолноеИмяФайла)
	
	Контекст.Вставить("ТекущийОбрабатываемыйФайл", ПолноеИмяФайла);
	
	ДокументТекст = ПолучитьТекстовыйДокументИзФайла(ПолноеИмяФайла, КодировкаТекста.UTF8);
	Если ДокументТекст = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектИзменен = Ложь;
	
	Если ЗначениеФлагов.ДобавлениеДополнительныхОтступовВОписаниеПараметра Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = ДобавитьДополнительныеОтступыВСтрокуСОписаниемПараметраИВозвращаемогоЗначения(ПолноеИмяФайла,
			ДокументТекст);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("ДобавлениеДополнительныхОтступовВОписаниеПараметра", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ДобавлениеДополнительныхОтступовВОписаниеПараметра");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеФлагов.АвтоисправлениеОписанийПроцедурИФункций Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = ИсправитьОписаниеПроцедурИФункций(ДокументТекст);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("АвтоисправлениеОписанийПроцедурИФункций", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "АвтоисправлениеОписанийПроцедурИФункций");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбъектИзменен Тогда
		ЗаписатьИзмененияВФайл(ДокументТекст, ПолноеИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПривестиКонфигурациюКСтандарту453()
	
	МассивФайлов = НайтиФайлы(КаталогВыгрузкиРезультат, "*.bsl", Истина);
	Для Каждого Файл Из МассивФайлов Цикл
		
		ПолноеИмяФайла = Файл.ПолноеИмя;
		Если ПроверитьФайлВыбранДляРедактирования(ПолноеИмяФайла) Тогда
			ПривестиОбъектКСтандарту453(ПолноеИмяФайла);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииПриведенияКСтандарту455СтруктураМодуля

Функция ПолучитьТаблицуСтандартныхОбластейИзМакета()
	
	ТаблицаСтандартныхОбластей = ПолучитьТаблицуИзМакета("СтандартныеОбласти");
	Если ТаблицаСтандартныхОбластей.Колонки.Найти("ИмяОбластиПолное") = Неопределено Тогда
		ТаблицаСтандартныхОбластей.Колонки.Добавить("ИмяОбластиПолное");
	КонецЕсли;
	
	Для Каждого СтрокаСтандартнойОбласти Из ТаблицаСтандартныхОбластей Цикл
		ИмяОбластиПолное = СтрокаСтандартнойОбласти.ИмяОбластиПолное;
		СтрокаСтандартнойОбласти.ИмяОбластиПолное = ?(ЗначениеЗаполнено(ИмяОбластиПолное), Булево(ИмяОбластиПолное), Истина);
	КонецЦикла;
	
	Возврат ТаблицаСтандартныхОбластей;
	
КонецФункции

Функция ПолучитьПараметрыСтандарта455()
	
	ТаблицаСтандартныхОбластей = ПолучитьТаблицуСтандартныхОбластейИзМакета();
	ХранилищеСтандартныхОбластей = ПолучитьХранилищеЗначений(ТаблицаСтандартныхОбластей);
	
	ПараметрыСтандарта455 = Новый Структура;
	ПараметрыСтандарта455.Вставить("ХранилищеСтандартныхОбластей", ХранилищеСтандартныхОбластей);
	
	Возврат ПараметрыСтандарта455;
	
КонецФункции

Процедура ПривестиОбъектКСтандарту455(ПолноеИмяФайла, ПараметрыСтандарта455)
	
	ДокументТекст = ПолучитьТекстовыйДокументИзФайла(ПолноеИмяФайла, КодировкаТекста.UTF8);
	Если ДокументТекст = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектИзменен = Ложь;
	
	Если ЗначениеФлагов.ЗаменаОбластейВВидеКомментариев Тогда
		
		ТаблицаСтандартныхОбластей = ПараметрыСтандарта455.ХранилищеСтандартныхОбластей.Получить();
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = ЗаменитьОбластиВВидеКомментариев(ДокументТекст, ПолноеИмяФайла, ТаблицаСтандартныхОбластей);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("ЗаменаОбластейВВидеКомментариев", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ЗаменаОбластейВВидеКомментариев");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеФлагов.ДобавлениеОбластиОписаниеПеременных Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = ДобавитьОбластьОписаниеПеременных(ПолноеИмяФайла, ДокументТекст);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("ДобавлениеОбластиОписаниеПеременных", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ДобавлениеОбластиОписаниеПеременных");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеФлагов.ДобавлениеОбластиИнициализация Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = ДобавитьОбластьИнициализация(ДокументТекст);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("ДобавлениеОбластиИнициализация", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ДобавлениеОбластиИнициализация");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеФлагов.УдалениеПустыхОбластей Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = УдалитьПустыеОбласти(ДокументТекст);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("УдалениеПустыхОбластей", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "УдалениеПустыхОбластей");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбъектИзменен Тогда
		ЗаписатьИзмененияВФайл(ДокументТекст, ПолноеИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПривестиКонфигурациюКСтандарту455()
	
	ПараметрыСтандарта455 = ПолучитьПараметрыСтандарта455();
	
	МассивФайлов = НайтиФайлы(КаталогВыгрузкиРезультат, "*.bsl", Истина);
	Для Каждого Файл Из МассивФайлов Цикл
		
		ПолноеИмяФайла = Файл.ПолноеИмя;
		Если ПроверитьФайлВыбранДляРедактирования(ПолноеИмяФайла) Тогда
			ПривестиОбъектКСтандарту455(ПолноеИмяФайла, ПараметрыСтандарта455);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииПриведенияКСтандарту456ТекстыМодулей

Процедура ПривестиОбъектКСтандарту456(ПолноеИмяФайла)
	
	ДокументТекст = ПолучитьТекстовыйДокументИзФайла(ПолноеИмяФайла, КодировкаТекста.UTF8);
	Если ДокументТекст = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектИзменен = Ложь;
	
	Если ЗначениеФлагов.ИсправлениеЗнакаМинусВДругихКодировках Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = ИсправитьЗнакМинусВДругихКодировках(ДокументТекст);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("ИсправлениеЗнакаМинусВДругихКодировках", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ИсправлениеЗнакаМинусВДругихКодировках");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеФлагов.УдалениеПроверкиАвтоТестИзМодулей Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = УдалитьПроверкуПараметраАвтоТест(ДокументТекст, ПолноеИмяФайла);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("УдалениеПроверкиАвтоТестИзМодулей", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "УдалениеПроверкиАвтоТестИзМодулей");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеФлагов.КрайняяЛеваяПозицияОписания Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = ПроверкаОператоровСКрайнейЛевойПозиции(ДокументТекст);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("КрайняяЛеваяПозицияОписания", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "КрайняяЛеваяПозицияОписания");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеФлагов.ДлинныеКомментарииСБольшойБуквы
	 ИЛИ ЗначениеФлагов.ПробелВНачалеКомментариев Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = ПроверкаФорматаКомментария(ДокументТекст);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("ДлинныеКомментарииСБольшойБуквы, ПробелВНачалеКомментариев", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ДлинныеКомментарииСБольшойБуквы");
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ПробелВНачалеКомментариев");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеФлагов.ПереносКомментариевДлиннее120Символов Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = ПроверкаКомментариевНаДопустимуюДлину(ДокументТекст);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("ПереносКомментариевДлиннее120Символов", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ПереносКомментариевДлиннее120Символов");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеФлагов.ДвойныеСимволыТочкаСЗапятойВКодеМодулей Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = ЗаменитьДвойнойСимволТочкаСЗапятойНаОдинарный(ДокументТекст);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("ДвойныеСимволыТочкаСЗапятойВКодеМодулей", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ДвойныеСимволыТочкаСЗапятойВКодеМодулей");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбъектИзменен Тогда
		ЗаписатьИзмененияВФайл(ДокументТекст, ПолноеИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПривестиКонфигурациюКСтандарту456()
	
	МассивФайлов = НайтиФайлы(КаталогВыгрузкиРезультат, "*.bsl", Истина);
	Для Каждого Файл Из МассивФайлов Цикл
		
		ПолноеИмяФайла = Файл.ПолноеИмя;
		Если ПроверитьФайлВыбранДляРедактирования(ПолноеИмяФайла) Тогда
			ПривестиОбъектКСтандарту456(ПолноеИмяФайла);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииПриведенияКСтандарту458ОбщиеТребованияПоЛокализацииКонфигурации

Процедура ПривестиОбъектКСтандарту458(ПолноеИмяФайла)
	
	ДокументDOM = ДокументDOM(ПолноеИмяФайла);
	Если ДокументDOM = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектИзменен = Ложь;
	
	Если ЗначениеФлагов.ОчисткаИзлишнейЛокализации Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = ОчиститьИзлишнююЛокализацию(ДокументDOM);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("ОчисткаИзлишнейЛокализации", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ОчисткаИзлишнейЛокализации");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбъектИзменен Тогда
		ЗаписатьДокументDOMВФайл(ДокументDOM, ПолноеИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПривестиКонфигурациюКСтандарту458()
	
	МаскиФайлов = ?(ЭтоВыгрузкаXMLФайлов,
		"*.xml",
		"*.mdo;*.form;*.xml;*.mxlx");
	МассивМасок = СтрРазделить(МаскиФайлов, ";", Ложь);
	
	Для Каждого МаскаФайлов Из МассивМасок Цикл
		
		МассивФайлов = НайтиФайлы(КаталогВыгрузкиРезультат, МаскаФайлов, Истина);
		Для Каждого Файл Из МассивФайлов Цикл
			
			ПолноеИмяФайла = Файл.ПолноеИмя;
			Если ПроверитьФайлВыбранДляРедактирования(ПолноеИмяФайла) Тогда
				ПривестиОбъектКСтандарту458(ПолноеИмяФайла);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииПриведенияКСтандарту467ОбщиеТребованияККонфигурации

Процедура ПривестиПодсистемуКСтандарту467(ПолноеИмяФайла)
	
	ДокументDOM = ДокументDOM(ПолноеИмяФайла);
	Если ДокументDOM = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектИзменен = Ложь;
	
	Если ЗначениеФлагов.УдалениеНекорректныхСсылокНаОтсутствующиеОбъектыПодсистем Тогда
		ОбъектИзмененПравилом = УдалитьБитыеСсылкиНаОбъектыПодсистемы(ДокументDOM);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "УдалениеНекорректныхСсылокНаОтсутствующиеОбъектыПодсистем");
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектИзменен Тогда
		ЗаписатьДокументDOMВФайл(ДокументDOM, ПолноеИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПривестиПодсистемыКСтандарту467()
	
	КаталогВыгрузкиПодсистем = КаталогВыгрузкиРезультат + "Subsystems" + РазделительПути;
	РасширениеФайловПодсистем = ?(ЭтоВыгрузкаXMLФайлов, "*.xml", "*.mdo");
	МассивФайлов = НайтиФайлы(КаталогВыгрузкиПодсистем, РасширениеФайловПодсистем, Истина);
	Для Каждого Файл Из МассивФайлов Цикл
		
		ПолноеИмяФайла = Файл.ПолноеИмя;
		Если ПроверитьФайлВыбранДляРедактирования(ПолноеИмяФайла) Тогда
			ПривестиПодсистемуКСтандарту467(ПолноеИмяФайла);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПривестиОбъектКонфигурацииКСтандарту467(ФайлКонфигурации)
	
	Если НЕ апк_ФайлСуществует(ФайлКонфигурации) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаФайлаРезультата = Результат.Найти(ФайлКонфигурации, "ПолноеИмяФайла");
	Если СтрокаФайлаРезультата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если (НЕ СтрокаФайлаРезультата.ЗахваченВХранилище) ИЛИ (НЕ СтрокаФайлаРезультата.РедактированиеРазрешено) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументDOM = ДокументDOM(ФайлКонфигурации);
	Если ДокументDOM = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектИзменен = Ложь;
	
	Если ЗначениеФлагов.СортировкаОбъектовВерхнегоУровня Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = СортироватьОбъектыМетаданных(ДокументDOM);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("СортировкаОбъектовВерхнегоУровня", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ФайлКонфигурации, "СортировкаОбъектовВерхнегоУровня");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбъектИзменен Тогда
		ЗаписатьДокументDOMВФайл(ДокументDOM, ФайлКонфигурации);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПривестиМодульКСтандарту467(ПолноеИмяФайла)
	
	ДокументТекст = ПолучитьТекстовыйДокументИзФайла(ПолноеИмяФайла, КодировкаТекста.UTF8);
	Если ДокументТекст = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектИзменен = Ложь;
	
	Если ЗначениеФлагов.УдалениеИзбыточногоОбращенияКОбъекту Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = УдалитьИзбыточноеОбращениеКОбъектуВКодеМодуля(ПолноеИмяФайла, ДокументТекст);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("УдалениеИзбыточногоОбращенияКОбъекту", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "УдалениеИзбыточногоОбращенияКОбъекту");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбъектИзменен Тогда
		ЗаписатьИзмененияВФайл(ДокументТекст, ПолноеИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПривестиМодулиКСтандарту467()
	
	МассивФайлов = НайтиФайлы(КаталогВыгрузкиРезультат, "*.bsl", Истина);
	Для Каждого Файл Из МассивФайлов Цикл
		
		ПолноеИмяФайла = Файл.ПолноеИмя;
		Если ПроверитьФайлВыбранДляРедактирования(ПолноеИмяФайла) Тогда
			ПривестиМодульКСтандарту467(ПолноеИмяФайла);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПривестиКонфигурациюКСтандарту467()
	
	ПривестиПодсистемыКСтандарту467();
	
	ФайлКонфигурации = ПолучитьФайлКонфигурации();
	ПривестиОбъектКонфигурацииКСтандарту467(ФайлКонфигурации);
	
	ПривестиМодулиКСтандарту467();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииПриведенияКСтандарту474ИмяСинонимКомментарий

#Область ПроцедурыИФункцииПриведенияКСтандарту474ИмяСинонимКомментарийXML

Функция ПолучитьПараметрыСтандарта474()
	
	ТаблицаИзмененийСинонимов = Новый ТаблицаЗначений;
	ТаблицаИзмененийСинонимов.Колонки.Добавить("КаталогОбъектов");
	ТаблицаИзмененийСинонимов.Колонки.Добавить("ИскатьВПодкаталогах");
	ТаблицаИзмененийСинонимов.Колонки.Добавить("РасширениеФайлов");
	ТаблицаИзмененийСинонимов.Колонки.Добавить("ИмяОбъекта");
	ТаблицаИзмененийСинонимов.Колонки.Добавить("ИсходныйСиноним");
	ТаблицаИзмененийСинонимов.Колонки.Добавить("НовыйСиноним");
	ТаблицаИзмененийСинонимов.Колонки.Добавить("ТипВыгрузкиФайлов");
	ТаблицаИзмененийСинонимов.Колонки.Добавить("ВыражениеПоискаСвойств");
	
	НоваяСтрокаТаблицы = ТаблицаИзмененийСинонимов.Добавить();
	НоваяСтрокаТаблицы.КаталогОбъектов = "Roles";
	НоваяСтрокаТаблицы.ИмяОбъекта = "ДобавлениеИзменение";
	НоваяСтрокаТаблицы.ИсходныйСиноним = НСтр("ru='Добавление изменение'; en='Add edit'", КодОсновногоЯзыка);
	НоваяСтрокаТаблицы.НовыйСиноним = НСтр("ru='Добавление и изменение'; en='Add and edit'", КодОсновногоЯзыка);
	НоваяСтрокаТаблицы.РасширениеФайлов = "*.xml";
	НоваяСтрокаТаблицы.ИскатьВПодкаталогах = Ложь;
	НоваяСтрокаТаблицы.ТипВыгрузкиФайлов = "XML";
	НоваяСтрокаТаблицы.ВыражениеПоискаСвойств = "/xmlns:MetaDataObject/xmlns:Role/xmlns:Properties";
	
	НоваяСтрокаТаблицы = ТаблицаИзмененийСинонимов.Добавить();
	НоваяСтрокаТаблицы.КаталогОбъектов = "Roles";
	НоваяСтрокаТаблицы.ИмяОбъекта = "ДобавлениеИзменение";
	НоваяСтрокаТаблицы.ИсходныйСиноним = НСтр("ru='Добавление изменение'; en='Add edit'", КодОсновногоЯзыка);
	НоваяСтрокаТаблицы.НовыйСиноним = НСтр("ru='Добавление и изменение'; en='Add and edit'", КодОсновногоЯзыка);
	НоваяСтрокаТаблицы.РасширениеФайлов = "*.mdo";
	НоваяСтрокаТаблицы.ИскатьВПодкаталогах = Истина;
	НоваяСтрокаТаблицы.ТипВыгрузкиФайлов = "EDT";
	НоваяСтрокаТаблицы.ВыражениеПоискаСвойств = "/mdclass:Role";
	
	ПараметрыСтандарта474 = Новый Структура;
	ПараметрыСтандарта474.Вставить("ТаблицаИзмененийСинонимов", ТаблицаИзмененийСинонимов);
	
	Возврат ПараметрыСтандарта474;
	
КонецФункции

Процедура ПривестиОбъектКСтандарту474(ПолноеИмяФайла, ПараметрыСтандарта474)
	
	ДокументDOM = ДокументDOM(ПолноеИмяФайла);
	Если ДокументDOM = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектИзменен = Ложь;
	
	Если ЗначениеФлагов.ДобавлениеСоюзовИПредлоговВСинонимыОбъектов Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = ИзменитьСинонимОбъекта(ДокументDOM, ПараметрыСтандарта474.ПараметрыИзмененияСинонима);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("ДобавлениеСоюзовИПредлоговВСинонимыОбъектов", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ДобавлениеСоюзовИПредлоговВСинонимыОбъектов");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбъектИзменен Тогда
		ЗаписатьДокументDOMВФайл(ДокументDOM, ПолноеИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПривестиКонфигурациюКСтандарту474()
	
	ПараметрыСтандарта474 = ПолучитьПараметрыСтандарта474();
	ТаблицаИзмененийСинонимов = ПараметрыСтандарта474.ТаблицаИзмененийСинонимов;
	
	ТипВыгрузкиФайлов = ?(ЭтоВыгрузкаXMLФайлов, "XML", "EDT");
	
	СтруктураОтбораТипВыгрузкиФайлов = Новый Структура;
	СтруктураОтбораТипВыгрузкиФайлов.Вставить("ТипВыгрузкиФайлов", ТипВыгрузкиФайлов);
	
	ТаблицаИзмененийСинонимовПоТипуВыгрузки = ТаблицаИзмененийСинонимов.Скопировать(СтруктураОтбораТипВыгрузкиФайлов);
	Для Каждого СтрокаИзмененийСинонима Из ТаблицаИзмененийСинонимовПоТипуВыгрузки Цикл
		
		ПараметрыСтандарта474.Вставить("ПараметрыИзмененияСинонима", СтрокаИзмененийСинонима);
		
		КаталогОбъектов = СтрокаИзмененийСинонима.КаталогОбъектов;
		КаталогПоискаФайлов = КаталогВыгрузкиРезультат + КаталогОбъектов;
		Если НЕ ЭтоВыгрузкаXMLФайлов Тогда
			Если НЕ апк_ФайлСуществует(КаталогПоискаФайлов) Тогда
				КаталогПоискаФайлов = КаталогВыгрузкиРезультат + "src";
				КаталогПоискаФайлов = ОтредактироватьПутьККаталогу(КаталогПоискаФайлов) + КаталогОбъектов;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ апк_ФайлСуществует(КаталогПоискаФайлов) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивФайлов = НайтиФайлы(КаталогПоискаФайлов, СтрокаИзмененийСинонима.РасширениеФайлов, СтрокаИзмененийСинонима.ИскатьВПодкаталогах);
		Для Каждого Файл Из МассивФайлов Цикл
			
			ПолноеИмяФайла = Файл.ПолноеИмя;
			Если ПроверитьФайлВыбранДляРедактирования(ПолноеИмяФайла) Тогда
				ПривестиОбъектКСтандарту474(ПолноеИмяФайла, ПараметрыСтандарта474);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПроцедурыИФункцииПриведенияКСтандарту478ПодсказкаИПроверкаЗаполнения

Функция ПолучитьМассивТиповОбъектовИмеющихРеквизиты()
	
	МассивТиповОбъектовИмеющихРеквизиты = Новый Массив;
	МассивТиповОбъектовИмеющихРеквизиты.Добавить("ПланОбмена");
	МассивТиповОбъектовИмеющихРеквизиты.Добавить("Справочник");
	МассивТиповОбъектовИмеющихРеквизиты.Добавить("Документ");
	МассивТиповОбъектовИмеющихРеквизиты.Добавить("ЖурналДокументов");
	МассивТиповОбъектовИмеющихРеквизиты.Добавить("Перечисление");
	МассивТиповОбъектовИмеющихРеквизиты.Добавить("Отчет");
	МассивТиповОбъектовИмеющихРеквизиты.Добавить("Обработка");
	МассивТиповОбъектовИмеющихРеквизиты.Добавить("ПланВидовХарактеристик");
	МассивТиповОбъектовИмеющихРеквизиты.Добавить("ПланСчетов");
	МассивТиповОбъектовИмеющихРеквизиты.Добавить("ПланВидовРасчета");
	МассивТиповОбъектовИмеющихРеквизиты.Добавить("РегистрСведений");
	МассивТиповОбъектовИмеющихРеквизиты.Добавить("РегистрНакопления");
	МассивТиповОбъектовИмеющихРеквизиты.Добавить("РегистрБухгалтерии");
	МассивТиповОбъектовИмеющихРеквизиты.Добавить("РегистрРасчета");
	МассивТиповОбъектовИмеющихРеквизиты.Добавить("БизнесПроцесс");
	МассивТиповОбъектовИмеющихРеквизиты.Добавить("Задача");
	
	Возврат МассивТиповОбъектовИмеющихРеквизиты;
	
КонецФункции

#Область ПроцедурыИФункцииПриведенияКСтандарту478ПодсказкаИПроверкаЗаполненияXML

Функция ПолучитьТаблицуТиповОбъектовРеквизит()
	
	ТаблицаТиповОбъектовРеквизит = Новый ТаблицаЗначений;
	ТаблицаТиповОбъектовРеквизит.Колонки.Добавить("ТипОбъекта");
	ТаблицаТиповОбъектовРеквизит.Колонки.Добавить("ВыражениеПоиска");
	ТаблицаТиповОбъектовРеквизит.Колонки.Добавить("Префикс");
	ТаблицаТиповОбъектовРеквизит.Колонки.Добавить("ТипПолучения");
	
	// Реквизит или реквизит табличной части.
	НовыйТипРеквизита = ТаблицаТиповОбъектовРеквизит.Добавить();
	НовыйТипРеквизита.ТипОбъекта = "Реквизит";
	НовыйТипРеквизита.ВыражениеПоиска = "//xmlns:ChildObjects/xmlns:Attribute/xmlns:Properties";
	НовыйТипРеквизита.Префикс = "xmlns";
	НовыйТипРеквизита.ТипПолучения = "Узел";
	
	// Стандартный реквизит.
	НовыйТипРеквизита = ТаблицаТиповОбъектовРеквизит.Добавить();
	НовыйТипРеквизита.ТипОбъекта = "СтандартныйРеквизит";
	НовыйТипРеквизита.ВыражениеПоиска = "//xmlns:Properties/xmlns:StandardAttributes/xr:StandardAttribute";
	НовыйТипРеквизита.Префикс = "xr";
	НовыйТипРеквизита.ТипПолучения = "Атрибут";
	
	// Измерение.
	НовыйТипРеквизита = ТаблицаТиповОбъектовРеквизит.Добавить();
	НовыйТипРеквизита.ТипОбъекта = "Измерение";
	НовыйТипРеквизита.ВыражениеПоиска = "//xmlns:ChildObjects/xmlns:Dimension/xmlns:Properties";
	НовыйТипРеквизита.Префикс = "xmlns";
	НовыйТипРеквизита.ТипПолучения = "Узел";
	
	// Ресурс.
	НовыйТипРеквизита = ТаблицаТиповОбъектовРеквизит.Добавить();
	НовыйТипРеквизита.ТипОбъекта = "Ресурс";
	НовыйТипРеквизита.ВыражениеПоиска = "//xmlns:ChildObjects/xmlns:Resource/xmlns:Properties";
	НовыйТипРеквизита.Префикс = "xmlns";
	НовыйТипРеквизита.ТипПолучения = "Узел";
	
	Возврат ТаблицаТиповОбъектовРеквизит;
	
КонецФункции

Функция ПолучитьТаблицуОбъектовИмеющихРеквизиты(ФайлКонфигурации)
	
	ТаблицаОбъектов = Новый ТаблицаЗначений;
	ТаблицаОбъектов.Колонки.Добавить("ПолноеИмя");
	
	Если НЕ апк_ФайлСуществует(ФайлКонфигурации) Тогда
		Возврат ТаблицаОбъектов;
	КонецЕсли;
	
	МассивТиповОбъектовИмеющихРеквизиты = ПолучитьМассивТиповОбъектовИмеющихРеквизиты();
	
	ДокументDOM = ДокументDOM(ФайлКонфигурации);
	Если ДокументDOM = Неопределено Тогда
		Возврат ТаблицаОбъектов;
	КонецЕсли;
	
	ЭлементDOMПодчиненныеОбъекты = ПолучитьЭлементDOMПоВыражениюXPath("//xmlns:ChildObjects", ДокументDOM);
	Если ЭлементDOMПодчиненныеОбъекты = Неопределено Тогда
		// Если подчиненных объектов нет, выходим.
		Возврат ТаблицаОбъектов;
	КонецЕсли;
	
	ДочерниеУзлы = ЭлементDOMПодчиненныеОбъекты.ДочерниеУзлы;
	Если ДочерниеУзлы.Количество() = 0 Тогда
		// Если подчиненных объектов нет, выходим.
		Возврат ТаблицаОбъектов;
	КонецЕсли;
	
	ТаблицаТиповОбъектовИнициализировать();
	
	Для Каждого ДочернийУзел Из ДочерниеУзлы Цикл
		
		ТипОбъектаАнгл = ДочернийУзел.ИмяЭлемента;
		
		ТипОбъектаРус = ПолучитьТипОбъектаПоТаблицеТипов(ТипОбъектаАнгл,,, "");
		Если МассивТиповОбъектовИмеющихРеквизиты.Найти(ТипОбъектаРус) = Неопределено Тогда
			// Если такого типа нет в массиве типов объектов, имеющих реквизиты, то пропускаем.
			Продолжить;
		КонецЕсли;
		
		ИмяОбъекта = ДочернийУзел.ТекстовоеСодержимое;
		
		ТипОбъектаАнглМнФормы = ПолучитьТипОбъектаПоТаблицеТипов(ТипОбъектаАнгл,, "ИмяАнглМнФормы", "");
		Если ПустаяСтрока(ТипОбъектаАнглМнФормы) Тогда
			Продолжить;
		КонецЕсли;
		
		ПолноеИмяФайла = СтрШаблон("%1%2%3%4.xml", КаталогВыгрузкиРезультат, ТипОбъектаАнглМнФормы, РазделительПути, ИмяОбъекта);
		Если НЕ апк_ФайлСуществует(ПолноеИмяФайла) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаОбъекта = ТаблицаОбъектов.Добавить();
		СтрокаОбъекта.ПолноеИмя = ПолноеИмяФайла;
		
	КонецЦикла;
	
	Возврат ТаблицаОбъектов;
	
КонецФункции

Функция ПолучитьПараметрыСтандарта478()
	
	ФайлКонфигурации = ПолучитьФайлКонфигурации();
	
	ТаблицаОбъектовИмеющихРеквизиты = ПолучитьТаблицуОбъектовИмеющихРеквизиты(ФайлКонфигурации);
	
	ТаблицаТиповОбъектовРеквизит = ПолучитьТаблицуТиповОбъектовРеквизит();
	
	// Составим исключения объектов, которые не нужно менять.
	// При загрузке XML файлов этих объектов возникает ошибка, и XML не грузится.
	МассивИсключенийОбъектов = Новый Массив;
	МассивИсключенийОбъектов.Добавить(СтрШаблон("%1InformationRegisters%2НастройкиТранспортаОбменаОбластейДанных.xml", КаталогВыгрузкиРезультат, РазделительПути));
	МассивИсключенийОбъектов.Добавить(СтрШаблон("%1InformationRegisters%2НастройкиТранспортаОбменаОбластиДанных.xml", КаталогВыгрузкиРезультат, РазделительПути));
	МассивИсключенийОбъектов.Добавить(СтрШаблон("%1Documents%2ДоверенностьВыданная.xml", КаталогВыгрузкиРезультат, РазделительПути));
	МассивИсключенийОбъектов.Добавить(СтрШаблон("%1Documents%2КорректировкаПриобретения.xml", КаталогВыгрузкиРезультат, РазделительПути));
	МассивИсключенийОбъектов.Добавить(СтрШаблон("%1Documents%2КорректировкаРеализации.xml", КаталогВыгрузкиРезультат, РазделительПути));
	
	ПараметрыСтандарта478 = Новый Структура;
	ПараметрыСтандарта478.Вставить("ТаблицаОбъектовИмеющихРеквизиты", ТаблицаОбъектовИмеющихРеквизиты);
	ПараметрыСтандарта478.Вставить("ТаблицаТиповОбъектовРеквизит", ТаблицаТиповОбъектовРеквизит);
	ПараметрыСтандарта478.Вставить("МассивИсключенийОбъектов", МассивИсключенийОбъектов);
	
	Возврат ПараметрыСтандарта478;
	
КонецФункции

Процедура ПривестиОбъектКСтандарту478(ПолноеИмяФайла, ПараметрыСтандарта478)
	
	ТаблицаТиповОбъектовРеквизит = ПараметрыСтандарта478.ТаблицаТиповОбъектовРеквизит;
	
	ДокументDOM = ДокументDOM(ПолноеИмяФайла);
	Если ДокументDOM = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектИзменен = Ложь;
	
	Если ЗначениеФлагов.ОчисткаПодсказокРеквизитов Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = ОчиститьПодсказкиРеквизитов(ДокументDOM, ТаблицаТиповОбъектовРеквизит);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("ОчисткаПодсказокРеквизитов", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ОчисткаПодсказокРеквизитов");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбъектИзменен Тогда
		ЗаписатьДокументDOMВФайл(ДокументDOM, ПолноеИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПривестиКонфигурациюКСтандарту478()
	
	Если ЗначениеФлагов.ОчисткаПодсказокРеквизитов Тогда
		
		ПараметрыСтандарта478 = ПолучитьПараметрыСтандарта478();
		МассивИсключенийОбъектов = ПараметрыСтандарта478.МассивИсключенийОбъектов;
		
		ТаблицаОбъектов = ПараметрыСтандарта478.ТаблицаОбъектовИмеющихРеквизиты;
		Для Каждого СтрокаОбъекта Из ТаблицаОбъектов Цикл
			
			ПолноеИмяФайла = СтрокаОбъекта.ПолноеИмя;
			
			Если ПроверитьФайлВыбранДляРедактирования(ПолноеИмяФайла)
				И (МассивИсключенийОбъектов.Найти(ПолноеИмяФайла) = Неопределено) Тогда
				ПривестиОбъектКСтандарту478(ПолноеИмяФайла, ПараметрыСтандарта478);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииПриведенияКСтандарту478ПодсказкаИПроверкаЗаполненияEDT

Функция ПолучитьТаблицуТиповОбъектовРеквизитEDT()
	
	ТаблицаТиповОбъектовРеквизит = Новый ТаблицаЗначений;
	ТаблицаТиповОбъектовРеквизит.Колонки.Добавить("ТипОбъекта");
	ТаблицаТиповОбъектовРеквизит.Колонки.Добавить("ВыражениеПоиска");
	
	// Реквизит
	НовыйТипРеквизита = ТаблицаТиповОбъектовРеквизит.Добавить();
	НовыйТипРеквизита.ТипОбъекта = "Реквизит";
	НовыйТипРеквизита.ВыражениеПоиска = "/mdclass:%1/attributes";
	
	// Реквизит табличной части
	НовыйТипРеквизита = ТаблицаТиповОбъектовРеквизит.Добавить();
	НовыйТипРеквизита.ТипОбъекта = "Реквизит";
	НовыйТипРеквизита.ВыражениеПоиска = "/mdclass:%1/tabularSections/attributes";
	
	// Стандартный реквизит.
	НовыйТипРеквизита = ТаблицаТиповОбъектовРеквизит.Добавить();
	НовыйТипРеквизита.ТипОбъекта = "СтандартныйРеквизит";
	НовыйТипРеквизита.ВыражениеПоиска = "/mdclass:%1/standardAttributes";
	
	// Измерение.
	НовыйТипРеквизита = ТаблицаТиповОбъектовРеквизит.Добавить();
	НовыйТипРеквизита.ТипОбъекта = "Измерение";
	НовыйТипРеквизита.ВыражениеПоиска = "/mdclass:%1/dimensions";
	
	// Ресурс.
	НовыйТипРеквизита = ТаблицаТиповОбъектовРеквизит.Добавить();
	НовыйТипРеквизита.ТипОбъекта = "Ресурс";
	НовыйТипРеквизита.ВыражениеПоиска = "/mdclass:%1/resources";
	
	Возврат ТаблицаТиповОбъектовРеквизит;
	
КонецФункции

Функция ПолучитьТаблицуОбъектовИмеющихРеквизитыEDT(ФайлКонфигурации)
	
	ТаблицаОбъектов = Новый ТаблицаЗначений;
	ТаблицаОбъектов.Колонки.Добавить("ПолноеИмя");
	ТаблицаОбъектов.Колонки.Добавить("ТипОбъекта");
	
	Если НЕ апк_ФайлСуществует(ФайлКонфигурации) Тогда
		Возврат ТаблицаОбъектов;
	КонецЕсли;
	
	МассивТиповОбъектовИмеющихРеквизиты = ПолучитьМассивТиповОбъектовИмеющихРеквизиты();
	
	ДокументDOM = ДокументDOM(ФайлКонфигурации);
	Если ДокументDOM = Неопределено Тогда
		Возврат ТаблицаОбъектов;
	КонецЕсли;
	
	ЭлементDOMПодчиненныеОбъекты = ПолучитьЭлементDOMПоВыражениюXPath("/mdclass:Configuration", ДокументDOM);
	Если ЭлементDOMПодчиненныеОбъекты = Неопределено Тогда
		Возврат ТаблицаОбъектов;
	КонецЕсли;
	
	ТаблицаТиповОбъектовИнициализировать();
	
	Для Каждого СтрокаТипа Из ТаблицаТиповОбъектов Цикл
		
		Если МассивТиповОбъектовИмеющихРеквизиты.Найти(СтрокаТипа.Имя) = Неопределено Тогда
			// Если такого типа нет в массиве типов объектов, имеющих реквизиты, то пропускаем.
			Продолжить;
		КонецЕсли;
		
		ТипОбъектаАнглМнФормы = СтрокаТипа.ИмяАнглМнФормы;
		Если ПустаяСтрока(ТипОбъектаАнглМнФормы) Тогда
			Продолжить;
		КонецЕсли;
		
		ТипОбъектаАнгл = СтрокаТипа.ИмяАнгл;
		
		ИмяОбъектаДляПоиска = НРег(Сред(ТипОбъектаАнглМнФормы, 1, 1)) + Сред(ТипОбъектаАнглМнФормы,2);
		ВыражениеПоискаПоТипу = СтрШаблон("/mdclass:Configuration/%1", ИмяОбъектаДляПоиска);
		
		РезультатXPath = ВычислитьВыражениеXPath(ВыражениеПоискаПоТипу, ДокументDOM);
		Пока Истина Цикл
			
			ЭлементDOM = РезультатXPath.ПолучитьСледующий();
			Если ЭлементDOM = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
			ИмяОбъекта = ЭлементDOM.ТекстовоеСодержимое;
			МассивИмени = СтрРазделить(ИмяОбъекта, ".");
			ИмяОбъекта = МассивИмени[МассивИмени.ВГраница()];
			
			ПолноеИмяФайла = СтрШаблон("%1src%2%3%2%4%2%4.mdo", КаталогВыгрузкиРезультат, РазделительПути, ТипОбъектаАнглМнФормы, ИмяОбъекта);
			Если НЕ апк_ФайлСуществует(ПолноеИмяФайла) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаОбъекта = ТаблицаОбъектов.Добавить();
			СтрокаОбъекта.ПолноеИмя  = ПолноеИмяФайла;
			СтрокаОбъекта.ТипОбъекта = ТипОбъектаАнгл;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаОбъектов;
	
КонецФункции

Функция ПолучитьПараметрыСтандарта478EDT()
	
	ФайлКонфигурации = ПолучитьФайлКонфигурации();
	ТаблицаОбъектовИмеющихРеквизиты = ПолучитьТаблицуОбъектовИмеющихРеквизитыEDT(ФайлКонфигурации);
	
	ТаблицаТиповОбъектовРеквизит = ПолучитьТаблицуТиповОбъектовРеквизитEDT();
	
	// Составим исключения объектов, которые не нужно менять.
	// При загрузке XML файлов этих объектов возникает ошибка, и XML не грузится.
	МассивИсключенийОбъектов = Новый Массив;
	МассивИсключенийОбъектов.Добавить(СтрШаблон("%1src%2InformationRegisters%2НастройкиТранспортаОбменаОбластейДанных%2НастройкиТранспортаОбменаОбластейДанных.mdo", КаталогВыгрузкиРезультат, РазделительПути));
	МассивИсключенийОбъектов.Добавить(СтрШаблон("%1src%2InformationRegisters%2НастройкиТранспортаОбменаОбластиДанных%2НастройкиТранспортаОбменаОбластиДанных.mdo", КаталогВыгрузкиРезультат, РазделительПути));
	МассивИсключенийОбъектов.Добавить(СтрШаблон("%1src%2Documents%2ДоверенностьВыданная%2ДоверенностьВыданная.mdo", КаталогВыгрузкиРезультат, РазделительПути));
	МассивИсключенийОбъектов.Добавить(СтрШаблон("%1src%2Documents%2КорректировкаПриобретения%2КорректировкаПриобретения.mdo", КаталогВыгрузкиРезультат, РазделительПути));
	МассивИсключенийОбъектов.Добавить(СтрШаблон("%1src%2Documents%2КорректировкаРеализации%2КорректировкаРеализации.mdo", КаталогВыгрузкиРезультат, РазделительПути));
	
	ПараметрыСтандарта478 = Новый Структура;
	ПараметрыСтандарта478.Вставить("ТаблицаОбъектовИмеющихРеквизиты", ТаблицаОбъектовИмеющихРеквизиты);
	ПараметрыСтандарта478.Вставить("ТаблицаТиповОбъектовРеквизит", ТаблицаТиповОбъектовРеквизит);
	ПараметрыСтандарта478.Вставить("МассивИсключенийОбъектов", МассивИсключенийОбъектов);
	
	Возврат ПараметрыСтандарта478;
	
КонецФункции

Процедура ПривестиОбъектКСтандарту478EDT(ПолноеИмяФайла, ТипОбъекта, ПараметрыСтандарта478)
	
	ТаблицаТиповОбъектовРеквизит = ПараметрыСтандарта478.ТаблицаТиповОбъектовРеквизит;
	
	ДокументDOM = ДокументDOM(ПолноеИмяФайла);
	Если ДокументDOM = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектИзменен = Ложь;
	
	Если ЗначениеФлагов.ОчисткаПодсказокРеквизитов Тогда
		ОбъектИзмененПравилом = ОчиститьПодсказкиРеквизитовEDT(ДокументDOM, ТипОбъекта, ТаблицаТиповОбъектовРеквизит);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ОчисткаПодсказокРеквизитов");
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектИзменен Тогда
		ЗаписатьДокументDOMВФайл(ДокументDOM, ПолноеИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПривестиКонфигурациюКСтандарту478EDT()
	
	Если ЗначениеФлагов.ОчисткаПодсказокРеквизитов Тогда
		
		ПараметрыСтандарта478 = ПолучитьПараметрыСтандарта478EDT();
		МассивИсключенийОбъектов = ПараметрыСтандарта478.МассивИсключенийОбъектов;
		
		ТаблицаОбъектов = ПараметрыСтандарта478.ТаблицаОбъектовИмеющихРеквизиты;
		Для Каждого СтрокаОбъекта Из ТаблицаОбъектов Цикл
			
			ПолноеИмяФайла = СтрокаОбъекта.ПолноеИмя;
			ТипОбъекта = СтрокаОбъекта.ТипОбъекта;
			
			Если ПроверитьФайлВыбранДляРедактирования(ПолноеИмяФайла)
				И (МассивИсключенийОбъектов.Найти(ПолноеИмяФайла) = Неопределено) Тогда
				ПривестиОбъектКСтандарту478EDT(ПолноеИмяФайла, ТипОбъекта, ПараметрыСтандарта478);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПроцедурыИФункцииПриведенияКСтандарту644ОбеспечениеСовместимостиБиблиотек

Функция ПривестиОбъектКСтандарту644(ПолноеИмяФайла)
	
	ДокументТекст = ПолучитьТекстовыйДокументИзФайла(ПолноеИмяФайла, КодировкаТекста.UTF8);
	Если ДокументТекст = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ОбъектИзменен = Ложь;
	
	Если ЗначениеФлагов.ПустаяСтрокаМеждуОбъявлениемПодсистемыИОписаниемПроцедуры Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = ДобавитьПустуюСтрокуМеждуОбъявлениемПодсистемыИОписаниемПроцедуры(ДокументТекст);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("ПустаяСтрокаМеждуОбъявлениемПодсистемыИОписаниемПроцедуры", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ПустаяСтрокаМеждуОбъявлениемПодсистемыИОписаниемПроцедуры");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбъектИзменен Тогда
		ЗаписатьИзмененияВФайл(ДокументТекст, ПолноеИмяФайла);
	КонецЕсли;
	
КонецФункции

Процедура ПривестиКонфигурациюКСтандарту644()
	
	МассивФайлов = НайтиФайлы(КаталогВыгрузкиРезультат, "*.bsl", Истина);
	Для Каждого Файл Из МассивФайлов Цикл
		
		ПолноеИмяФайла = Файл.ПолноеИмя;
		Если ПроверитьФайлВыбранДляРедактирования(ПолноеИмяФайла) Тогда
			ПривестиОбъектКСтандарту644(ПолноеИмяФайла);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииПриведенияКСтандарту680ПоддержкаТолстогоКлиентаУправляемоеПриложениеКлиентСервер

Функция ПривестиОбъектКСтандарту680(ПолноеИмяФайла)
	
	ДокументТекст = ПолучитьТекстовыйДокументИзФайла(ПолноеИмяФайла, КодировкаТекста.UTF8);
	Если ДокументТекст = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ОбъектИзменен = Ложь;
	
	Если ЗначениеФлагов.ЗаключениеКодаВИнструкциюПрепроцессора Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = ЗаключитьМодульВИнструкциюПрепроцессора(ДокументТекст, ПолноеИмяФайла);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("ЗаключениеКодаВИнструкциюПрепроцессора", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ЗаключениеКодаВИнструкциюПрепроцессора");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбъектИзменен Тогда
		ЗаписатьИзмененияВФайл(ДокументТекст, ПолноеИмяФайла);
	КонецЕсли;
	
КонецФункции

Процедура ПривестиКонфигурациюКСтандарту680()
	
	МассивФайлов = НайтиФайлы(КаталогВыгрузкиРезультат, "*.bsl", Истина);
	Для Каждого Файл Из МассивФайлов Цикл
		
		ПолноеИмяФайла = Файл.ПолноеИмя;
		Если ПроверитьФайлВыбранДляРедактирования(ПолноеИмяФайла) Тогда
			ПривестиОбъектКСтандарту680(ПолноеИмяФайла);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииПриведенияКСтандарту702УстановкаПризнакаИспользоватьВсегда

#Область ПроцедурыИФункцииПриведенияКСтандарту702УстановкаПризнакаИспользоватьВсегдаXML

Функция ПривестиОбъектКСтандарту702(ПолноеИмяФайла)
	
	ДокументDOM = ДокументDOM(ПолноеИмяФайла);
	Если ДокументDOM = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ОбъектИзменен = Ложь;
	
	Если ЗначениеФлагов.УстановкаПризнакаИспользоватьВсегда Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = УстановитьПризнакиИспользоватьВсегдаДляПолейДинамическихСписков(ДокументDOM);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("УстановкаПризнакаИспользоватьВсегда", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "УстановкаПризнакаИспользоватьВсегда");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбъектИзменен Тогда
		ЗаписатьДокументDOMВФайл(ДокументDOM, ПолноеИмяФайла);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Процедура ПривестиКонфигурациюКСтандарту702()
	
	МассивФайлов = НайтиФайлы(КаталогВыгрузкиРезультат, "Form.xml", Истина);
	Для Каждого Файл Из МассивФайлов Цикл
		
		ПолноеИмяФайла = Файл.ПолноеИмя;
		Если ПроверитьФайлВыбранДляРедактирования(ПолноеИмяФайла) Тогда
			ПривестиОбъектКСтандарту702(ПолноеИмяФайла);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииПриведенияКСтандарту702УстановкаПризнакаИспользоватьВсегдаEDT

Функция ПривестиОбъектКСтандарту702EDT(ПолноеИмяФайла)
	
	ДокументDOM = ДокументDOM(ПолноеИмяФайла);
	Если ДокументDOM = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ОбъектИзменен = Ложь;
	
	Если ЗначениеФлагов.УстановкаПризнакаИспользоватьВсегда Тогда
		ОбъектИзмененПравилом = УстановитьПризнакиИспользоватьВсегдаДляПолейДинамическихСписковEDT(ДокументDOM);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "УстановкаПризнакаИспользоватьВсегда");
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектИзменен Тогда
		ЗаписатьДокументDOMВФайл(ДокументDOM, ПолноеИмяФайла);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Процедура ПривестиКонфигурациюКСтандарту702EDT()
	
	МассивФайлов = НайтиФайлы(КаталогВыгрузкиРезультат, "Form.form", Истина);
	Для Каждого Файл Из МассивФайлов Цикл
		
		ПолноеИмяФайла = Файл.ПолноеИмя;
		Если ПроверитьФайлВыбранДляРедактирования(ПолноеИмяФайла) Тогда
			ПривестиОбъектКСтандарту702EDT(ПолноеИмяФайла);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПроцедурыИФункцииПриведенияКСтандарту762ЛокализацияЗапросовОтчетовДинамическихСписковСКД

Функция ПолучитьТаблицуПоискаПолейСКД()
	
	ТаблицаПоискаПолейСКД = Новый ТаблицаЗначений;
	ТаблицаПоискаПолейСКД.Колонки.Добавить("ВыражениеПоискаПоТипу");
	ТаблицаПоискаПолейСКД.Колонки.Добавить("ПрефиксТипа");
	ТаблицаПоискаПолейСКД.Колонки.Добавить("НаименованиеДокументовДляПоиска");
	ТаблицаПоискаПолейСКД.Колонки.Добавить("УзелТекстаЗапроса");
	ТаблицаПоискаПолейСКД.Колонки.Добавить("ИспользоватьФорматированиеДляXML");
	ТаблицаПоискаПолейСКД.Колонки.Добавить("ФорматированиеПоляДляСКД");
	
	НоваяСтрока = ТаблицаПоискаПолейСКД.Добавить();
	НоваяСтрока.ВыражениеПоискаПоТипу = "//xmlns:field[@xsi:type='DataSetFieldField']";
	НоваяСтрока.ПрефиксТипа = "xmlns";
	НоваяСтрока.НаименованиеДокументовДляПоиска = "Template.xml";
	НоваяСтрока.УзелТекстаЗапроса = "xmlns:query";
	НоваяСтрока.ИспользоватьФорматированиеДляXML = Истина;
	НоваяСтрока.ФорматированиеПоляДляСКД = Истина;
	
	НоваяСтрока = ТаблицаПоискаПолейСКД.Добавить();
	НоваяСтрока.ВыражениеПоискаПоТипу = "//xmlns:Field[@xsi:type='dcssch:DataSetFieldField']";
	НоваяСтрока.ПрефиксТипа = "dcssch";
	НоваяСтрока.НаименованиеДокументовДляПоиска = "Form.xml";
	НоваяСтрока.УзелТекстаЗапроса = "xmlns:QueryText";
	НоваяСтрока.ИспользоватьФорматированиеДляXML = Истина;
	НоваяСтрока.ФорматированиеПоляДляСКД = Ложь;
	
	НоваяСтрока = ТаблицаПоискаПолейСКД.Добавить();
	НоваяСтрока.ВыражениеПоискаПоТипу = "//xmlns:field[@xsi:type='DataSetFieldField']";
	НоваяСтрока.ПрефиксТипа = "xmlns";
	НоваяСтрока.НаименованиеДокументовДляПоиска = "Template.dcs";
	НоваяСтрока.УзелТекстаЗапроса = "xmlns:query";
	НоваяСтрока.ИспользоватьФорматированиеДляXML = Ложь;
	НоваяСтрока.ФорматированиеПоляДляСКД = Истина;
	
	НоваяСтрока = ТаблицаПоискаПолейСКД.Добавить();
	НоваяСтрока.ВыражениеПоискаПоТипу = "//fields[@xsi:type='schema:DataCompositionSchemaDataSetField']";
	НоваяСтрока.ПрефиксТипа = "";
	НоваяСтрока.НаименованиеДокументовДляПоиска = "Form.form";
	НоваяСтрока.УзелТекстаЗапроса = "queryText";
	НоваяСтрока.ИспользоватьФорматированиеДляXML = Ложь;
	НоваяСтрока.ФорматированиеПоляДляСКД = Ложь;
	
	Возврат ТаблицаПоискаПолейСКД;
	
КонецФункции

Функция ПривестиОбъектКСтандарту762(ПолноеИмяФайла, СтрокаПоискаПолейСКД)
	
	ДокументDOM = ДокументDOM(ПолноеИмяФайла);
	Если ДокументDOM = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ОбъектИзменен = Ложь;
	
	Если ЗначениеФлагов.УстановкаСинонимаДляВычисляемыхПолей Тогда
		ОбъектИзмененПравилом = ЗаполнитьСинонимыДляВычисляемыхПолей(ДокументDOM, СтрокаПоискаПолейСКД);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "УстановкаСинонимаДляВычисляемыхПолей");
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектИзменен Тогда
		ЗаписатьДокументDOMВФайл(ДокументDOM, ПолноеИмяФайла);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Процедура ПривестиКонфигурациюКСтандарту762()
	
	ТаблицаПоискаПолейСКД = ПолучитьТаблицуПоискаПолейСКД();
	СтрокиПоискаПолейСКД = ТаблицаПоискаПолейСКД.НайтиСтроки(Новый Структура("ИспользоватьФорматированиеДляXML", ЭтоВыгрузкаXMLФайлов()));
	
	Для Каждого СтрокаПоискаПолейСКД Из СтрокиПоискаПолейСКД Цикл
		
		МассивФайлов = НайтиФайлы(КаталогВыгрузкиРезультат, СтрокаПоискаПолейСКД.НаименованиеДокументовДляПоиска, Истина);
		Для Каждого Файл Из МассивФайлов Цикл
			
			ПолноеИмяФайла = Файл.ПолноеИмя;
			Если Не ПроверитьФайлВыбранДляРедактирования(ПолноеИмяФайла) Тогда
				Продолжить;
			КонецЕсли;
			
			ПривестиОбъектКСтандарту762(ПолноеИмяФайла, СтрокаПоискаПолейСКД);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииПриведенияКСтандарту765ЛокализацияЭлементовФорм

Процедура ДобавитьИсключениеВТаблицуИсключенийЗаголовковЭлементовФорм(ТаблицаИсключений, Наименование, Заголовок)
	
	НовоеИсключение = ТаблицаИсключений.Добавить();
	НовоеИсключение.Наименование = Наименование;
	НовоеИсключение.Заголовок = Заголовок;
	
КонецПроцедуры

Функция ПолучитьТаблицуИсключенийЗаголовковЭлементовФорм()
	
	ТаблицаИсключений = Новый ТаблицаЗначений;
	ТаблицаИсключений.Колонки.Добавить("Наименование");
	ТаблицаИсключений.Колонки.Добавить("Заголовок");
	
	ДобавитьИсключениеВТаблицуИсключенийЗаголовковЭлементовФорм(ТаблицаИсключений, "ФНСРоссии", "ФНС России"); // АПК:1297 - не локализуется
	ДобавитьИсключениеВТаблицуИсключенийЗаголовковЭлементовФорм(ТаблицаИсключений, "ГруппаПользовательскихНастроек", "Группа пользовательских настроек"); // АПК:1297 - не локализуется
	
	Возврат ТаблицаИсключений;
	
КонецФункции

Функция ПолучитьПараметрыСтандарта765()
	
	ТаблицаИсключенийЗаголовковЭлементовФорм = ПолучитьТаблицуИсключенийЗаголовковЭлементовФорм();
	ХранилищеИсключенийЗаголовковЭлементовФорм = ПолучитьХранилищеЗначений(ТаблицаИсключенийЗаголовковЭлементовФорм);
	
	ПараметрыСтандарта765 = Новый Структура;
	ПараметрыСтандарта765.Вставить("ХранилищеИсключенийЗаголовковЭлементовФорм", ХранилищеИсключенийЗаголовковЭлементовФорм);
	
	Возврат ПараметрыСтандарта765;
	
КонецФункции

#Область ПроцедурыИФункцииПриведенияКСтандарту765ЛокализацияЭлементовФормXML

Функция ПривестиОбъектКСтандарту765(ПолноеИмяФайла, ПараметрыСтандарта765)
	
	ТаблицаИсключенийЗаголовковЭлементовФорм = ПараметрыСтандарта765.ХранилищеИсключенийЗаголовковЭлементовФорм.Получить();
	ТаблицаТиповЭлементовФорм = ПараметрыСтандарта765.ТаблицаТиповЭлементовФорм;
	
	ДокументDOM = ДокументDOM(ПолноеИмяФайла);
	Если ДокументDOM = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ОбъектИзменен = Ложь;
	
	Если ЗначениеФлагов.ОчисткаПодсказокГруппФорм Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = ОчиститьПодсказкиГруппФормы(ДокументDOM);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("ОчисткаПодсказокГруппФорм", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ОчисткаПодсказокГруппФорм");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеФлагов.ЗаполнениеЗаголовковГруппИТаблицФорм
		ИЛИ ЗначениеФлагов.ЗаменаАвтогенерируемыхЗаголовков Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		ОбъектИзмененПравилом = ЗаполнитьЗаголовкиТаблицИГруппФормыXML(ДокументDOM,
			ТаблицаИсключенийЗаголовковЭлементовФорм,
			ТаблицаТиповЭлементовФорм);
		
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("ЗаполнениеЗаголовковГруппИТаблицФорм", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ЗаполнениеЗаголовковГруппИТаблицФорм");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеФлагов.ОчисткаЗаголовковРеквизитовФормыНеРазмещенныхНаФорме Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = ОчиститьЗаголовкиРеквизитовФормыНеРазмещенныхНаФорме(ДокументDOM);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("ОчисткаЗаголовковРеквизитовФормыНеРазмещенныхНаФорме", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ОчисткаЗаголовковРеквизитовФормыНеРазмещенныхНаФорме");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеФлагов.ЗаполнениеЗаголовковКолонокДинамическогоСписка Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = ЗаполнитьЗаголовкиПолейДинамическогоСписка(ДокументDOM);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("ЗаполнениеЗаголовковКолонокДинамическогоСписка", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ЗаполнениеЗаголовковКолонокДинамическогоСписка");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеФлагов.ЗаполнениеЗаголовковКолонокТаблицыЗначений Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = ЗаполнитьЗаголовкиКолонокРеквизитаФормы(ДокументDOM, ТаблицаИсключенийЗаголовковЭлементовФорм);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("ЗаполнениеЗаголовковКолонокТаблицыЗначений", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ЗаполнениеЗаголовковКолонокТаблицыЗначений");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеФлагов.ЗаполнениеЗаголовковСвойствСпискаЗначений Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = ЗаполнитьЗаголовкиСвойствСпискаЗначений(ДокументDOM);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("ЗаполнениеЗаголовковСвойствСпискаЗначений", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ЗаполнениеЗаголовковСвойствСпискаЗначений");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеФлагов.ЗаполнениеЗаголовковЭлементовФорм Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = ЗаполнитьЗаголовкиЭлементовФорм(ДокументDOM);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("ЗаполнениеЗаголовковЭлементовФорм", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ЗаполнениеЗаголовковЭлементовФорм");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбъектИзменен Тогда
		ЗаписатьДокументDOMВФайл(ДокументDOM, ПолноеИмяФайла);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Процедура ПривестиКонфигурациюКСтандарту765()
	
	ТаблицаТиповЭлементовФорм = ПолучитьТаблицуТиповЭлементовФормыXML();
	
	ПараметрыСтандарта765 = ПолучитьПараметрыСтандарта765();
	ПараметрыСтандарта765.Вставить("ТаблицаТиповЭлементовФорм", ТаблицаТиповЭлементовФорм);
	
	МассивФайлов = НайтиФайлы(КаталогВыгрузкиРезультат, "Form.xml", Истина);
	Для Каждого Файл Из МассивФайлов Цикл
		
		ПолноеИмяФайла = Файл.ПолноеИмя;
		Если ПроверитьФайлВыбранДляРедактирования(ПолноеИмяФайла) Тогда
			ПривестиОбъектКСтандарту765(ПолноеИмяФайла, ПараметрыСтандарта765);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииПриведенияКСтандарту765ЛокализацияЭлементовФормEDT

Функция ПолучитьТаблицуТиповЭлементовФормыXML()
	
	ТаблицаТиповЭлементовФормы = Новый ТаблицаЗначений;
	ТаблицаТиповЭлементовФормы.Колонки.Добавить("ИмяЭлемента");
	ТаблицаТиповЭлементовФормы.Колонки.Добавить("ОчищатьФлагОтображатьЗаголовок");
	
	НоваяСтрока = ТаблицаТиповЭлементовФормы.Добавить();
	НоваяСтрока.ИмяЭлемента = "UsualGroup";
	НоваяСтрока.ОчищатьФлагОтображатьЗаголовок = Истина;
	
	НоваяСтрока = ТаблицаТиповЭлементовФормы.Добавить();
	НоваяСтрока.ИмяЭлемента = "Pages";
	НоваяСтрока.ОчищатьФлагОтображатьЗаголовок = Ложь;
	
	НоваяСтрока = ТаблицаТиповЭлементовФормы.Добавить();
	НоваяСтрока.ИмяЭлемента = "Page";
	НоваяСтрока.ОчищатьФлагОтображатьЗаголовок = Истина;
	
	НоваяСтрока = ТаблицаТиповЭлементовФормы.Добавить();
	НоваяСтрока.ИмяЭлемента = "CommandBar";
	НоваяСтрока.ОчищатьФлагОтображатьЗаголовок = Ложь;
	
	НоваяСтрока = ТаблицаТиповЭлементовФормы.Добавить();
	НоваяСтрока.ИмяЭлемента = "ColumnGroup";
	НоваяСтрока.ОчищатьФлагОтображатьЗаголовок = Ложь;
	
	НоваяСтрока = ТаблицаТиповЭлементовФормы.Добавить();
	НоваяСтрока.ИмяЭлемента = "Popup";
	НоваяСтрока.ОчищатьФлагОтображатьЗаголовок = Ложь;
	
	НоваяСтрока = ТаблицаТиповЭлементовФормы.Добавить();
	НоваяСтрока.ИмяЭлемента = "ButtonGroup";
	НоваяСтрока.ОчищатьФлагОтображатьЗаголовок = Ложь;
	
	НоваяСтрока = ТаблицаТиповЭлементовФормы.Добавить();
	НоваяСтрока.ИмяЭлемента = "Table";
	НоваяСтрока.ОчищатьФлагОтображатьЗаголовок = Ложь;
	
	Возврат ТаблицаТиповЭлементовФормы;
	
КонецФункции

Функция ПолучитьТаблицуПоискаТаблицИГруппФормыEDT()
	
	ТаблицаПоиска = Новый ТаблицаЗначений;
	ТаблицаПоиска.Колонки.Добавить("ТипЭлемента");
	ТаблицаПоиска.Колонки.Добавить("ВыражениеПоиска");
	ТаблицаПоиска.Колонки.Добавить("ПолучатьРодителя");
	ТаблицаПоиска.Колонки.Добавить("ОчищатьФлагОтображатьЗаголовок");
	
	НоваяСтрока = ТаблицаПоиска.Добавить();
	НоваяСтрока.ТипЭлемента = "UsualGroup";
	НоваяСтрока.ВыражениеПоиска = "//items/type[text()='UsualGroup']";
	НоваяСтрока.ПолучатьРодителя = Истина;
	НоваяСтрока.ОчищатьФлагОтображатьЗаголовок = Истина;
	
	НоваяСтрока = ТаблицаПоиска.Добавить();
	НоваяСтрока.ТипЭлемента = "FormGroup";
	НоваяСтрока.ВыражениеПоиска = "//items[@xsi:type='form:FormGroup']";
	НоваяСтрока.ПолучатьРодителя = Ложь;
	НоваяСтрока.ОчищатьФлагОтображатьЗаголовок = Ложь;
	
	НоваяСтрока = ТаблицаПоиска.Добавить();
	НоваяСтрока.ТипЭлемента = "Pages";
	НоваяСтрока.ВыражениеПоиска = "//items/type[text()='Pages']";
	НоваяСтрока.ПолучатьРодителя = Истина;
	НоваяСтрока.ОчищатьФлагОтображатьЗаголовок = Ложь;
	
	НоваяСтрока = ТаблицаПоиска.Добавить();
	НоваяСтрока.ТипЭлемента = "Page";
	НоваяСтрока.ВыражениеПоиска = "//items/type[text()='Page']";
	НоваяСтрока.ПолучатьРодителя = Истина;
	НоваяСтрока.ОчищатьФлагОтображатьЗаголовок = Истина;
	
	НоваяСтрока = ТаблицаПоиска.Добавить();
	НоваяСтрока.ТипЭлемента = "CommandBar";
	НоваяСтрока.ВыражениеПоиска = "//items/type[text()='CommandBar']";
	НоваяСтрока.ПолучатьРодителя = Истина;
	НоваяСтрока.ОчищатьФлагОтображатьЗаголовок = Ложь;
	
	НоваяСтрока = ТаблицаПоиска.Добавить();
	НоваяСтрока.ТипЭлемента = "ColumnGroup";
	НоваяСтрока.ВыражениеПоиска = "//items/type[text()='ColumnGroup']";
	НоваяСтрока.ПолучатьРодителя = Истина;
	НоваяСтрока.ОчищатьФлагОтображатьЗаголовок = Ложь;
	
	НоваяСтрока = ТаблицаПоиска.Добавить();
	НоваяСтрока.ТипЭлемента = "Popup";
	НоваяСтрока.ВыражениеПоиска = "//items/type[text()='Popup']";
	НоваяСтрока.ПолучатьРодителя = Истина;
	НоваяСтрока.ОчищатьФлагОтображатьЗаголовок = Ложь;
	
	НоваяСтрока = ТаблицаПоиска.Добавить();
	НоваяСтрока.ТипЭлемента = "ButtonGroup";
	НоваяСтрока.ВыражениеПоиска = "//items/type[text()='ButtonGroup']";
	НоваяСтрока.ПолучатьРодителя = Истина;
	НоваяСтрока.ОчищатьФлагОтображатьЗаголовок = Ложь;
	
	НоваяСтрока = ТаблицаПоиска.Добавить();
	НоваяСтрока.ТипЭлемента = "Table";
	НоваяСтрока.ВыражениеПоиска = "//items[@xsi:type='form:Table']";
	НоваяСтрока.ПолучатьРодителя = Ложь;
	НоваяСтрока.ОчищатьФлагОтображатьЗаголовок = Ложь;
	
	Возврат ТаблицаПоиска;
	
КонецФункции

Функция ПривестиОбъектКСтандарту765EDT(ПолноеИмяФайла, ПараметрыСтандарта765)
	
	ТаблицаИсключенийЗаголовковЭлементовФорм = ПараметрыСтандарта765.ХранилищеИсключенийЗаголовковЭлементовФорм.Получить();
	ТаблицаПоискаТаблицИГрупп = ПараметрыСтандарта765.ТаблицаПоискаТаблицИГрупп;
	
	ДокументDOM = ДокументDOM(ПолноеИмяФайла);
	Если ДокументDOM = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ОбъектИзменен = Ложь;
	
	Если ЗначениеФлагов.ОчисткаПодсказокГруппФорм Тогда
		ОбъектИзмененПравилом = ОчиститьПодсказкиГруппФормыEDT(ДокументDOM);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ОчисткаПодсказокГруппФорм");
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеФлагов.ЗаменаАвтогенерируемыхЗаголовков
		ИЛИ ЗначениеФлагов.ЗаполнениеЗаголовковГруппИТаблицФорм Тогда
		ОбъектИзмененПравилом = ЗаполнитьЗаголовкиТаблицИГруппФормыEDT(ДокументDOM,
			ТаблицаИсключенийЗаголовковЭлементовФорм,
			ТаблицаПоискаТаблицИГрупп);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ЗаполнениеЗаголовковГруппИТаблицФорм");
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеФлагов.ОчисткаЗаголовковРеквизитовФормыНеРазмещенныхНаФорме Тогда
		ОбъектИзмененПравилом = ОчиститьЗаголовкиРеквизитовФормыНеРазмещенныхНаФормеEDT(ДокументDOM);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ОчисткаЗаголовковРеквизитовФормыНеРазмещенныхНаФорме");
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеФлагов.ЗаполнениеЗаголовковКолонокДинамическогоСписка Тогда
		ОбъектИзмененПравилом = ЗаполнитьЗаголовкиПолейДинамическогоСпискаEDT(ДокументDOM);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ЗаполнениеЗаголовковКолонокДинамическогоСписка");
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеФлагов.ЗаполнениеЗаголовковКолонокТаблицыЗначений Тогда
		ОбъектИзмененПравилом = ЗаполнитьЗаголовкиКолонокРеквизитаФормыEDT(ДокументDOM, ТаблицаИсключенийЗаголовковЭлементовФорм);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ЗаполнениеЗаголовковКолонокТаблицыЗначений");
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеФлагов.ЗаполнениеЗаголовковСвойствСпискаЗначений Тогда
		ОбъектИзмененПравилом = ЗаполнитьЗаголовкиСвойствСпискаЗначенийEDT(ДокументDOM);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ЗаполнениеЗаголовковСвойствСпискаЗначений");
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеФлагов.ЗаполнениеЗаголовковЭлементовФорм Тогда
		ОбъектИзмененПравилом = ЗаполнитьЗаголовкиЭлементовФорм(ДокументDOM);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ЗаполнениеЗаголовковЭлементовФорм");
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектИзменен Тогда
		ЗаписатьДокументDOMВФайл(ДокументDOM, ПолноеИмяФайла);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Процедура ПривестиКонфигурациюКСтандарту765EDT()
	
	ТаблицаПоискаТаблицИГрупп = ПолучитьТаблицуПоискаТаблицИГруппФормыEDT();
	
	ПараметрыСтандарта765 = ПолучитьПараметрыСтандарта765();
	ПараметрыСтандарта765.Вставить("ТаблицаПоискаТаблицИГрупп", ТаблицаПоискаТаблицИГрупп);
	
	МассивФайлов = НайтиФайлы(КаталогВыгрузкиРезультат, "Form.form", Истина);
	Для Каждого Файл Из МассивФайлов Цикл
		
		ПолноеИмяФайла = Файл.ПолноеИмя;
		Если ПроверитьФайлВыбранДляРедактирования(ПолноеИмяФайла) Тогда
			ПривестиОбъектКСтандарту765EDT(ПолноеИмяФайла, ПараметрыСтандарта765);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПроцедурыИФункцииПриведенияКСтандарту767ЛокализацияРегламентныхЗаданий

#Область ПроцедурыИФункцииПриведенияКСтандарту767ЛокализацияРегламентныхЗаданийXML

Функция ПривестиОбъектКСтандарту767(ПолноеИмяФайла)
	
	ДокументDOM = ДокументDOM(ПолноеИмяФайла);
	Если ДокументDOM = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ОбъектИзменен = Ложь;
	
	Если ЗначениеФлагов.ОчисткаНаименованийПредопределенныхРегламентныхЗаданий Тогда
		
		ВремяНачалаЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОбъектИзмененПравилом = ОчиститьНаименованиеПредопределенногоРегламентногоЗадания(ДокументDOM);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ЗаполнитьВремяПриведенияКСтандарту("ОчисткаНаименованийПредопределенныхРегламентныхЗаданий", ВремяНачалаЗамера);
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ОчисткаНаименованийПредопределенныхРегламентныхЗаданий");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбъектИзменен Тогда
		ЗаписатьДокументDOMВФайл(ДокументDOM, ПолноеИмяФайла);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Процедура ПривестиКонфигурациюКСтандарту767()
	
	КаталогРегламентныхЗаданий = КаталогВыгрузкиРезультат + "ScheduledJobs" + РазделительПути;
	Если НЕ апк_ФайлСуществует(КаталогРегламентныхЗаданий) Тогда
		Возврат;
	КонецЕсли;
	
	МассивФайлов = НайтиФайлы(КаталогРегламентныхЗаданий, "*.xml");
	Для Каждого Файл Из МассивФайлов Цикл
		
		ПолноеИмяФайла = Файл.ПолноеИмя;
		Если ПроверитьФайлВыбранДляРедактирования(ПолноеИмяФайла) Тогда
			ПривестиОбъектКСтандарту767(ПолноеИмяФайла);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииПриведенияКСтандарту767ЛокализацияРегламентныхЗаданийXML

Функция ПривестиОбъектКСтандарту767EDT(ПолноеИмяФайла)
	
	ДокументDOM = ДокументDOM(ПолноеИмяФайла);
	Если ДокументDOM = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ОбъектИзменен = Ложь;
	
	Если ЗначениеФлагов.ОчисткаНаименованийПредопределенныхРегламентныхЗаданий Тогда
		ОбъектИзмененПравилом = ОчиститьНаименованиеПредопределенногоРегламентногоЗаданияEDT(ДокументDOM);
		ОбъектИзменен = ОбъектИзменен ИЛИ ОбъектИзмененПравилом;
		
		Если ОбъектИзмененПравилом Тогда
			ДобавитьСтрокуВТаблицуИзмененныхОбъектов(ПолноеИмяФайла, "ОчисткаНаименованийПредопределенныхРегламентныхЗаданий");
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектИзменен Тогда
		ЗаписатьДокументDOMВФайл(ДокументDOM, ПолноеИмяФайла);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Процедура ПривестиКонфигурациюКСтандарту767EDT()
	
	КаталогРегламентныхЗаданий = КаталогВыгрузкиРезультат + СтрШаблон("src%1ScheduledJobs%1", РазделительПути);
	Если НЕ апк_ФайлСуществует(КаталогРегламентныхЗаданий) Тогда
		Возврат;
	КонецЕсли;
	
	МассивФайлов = НайтиФайлы(КаталогРегламентныхЗаданий, "*.mdo", Истина);
	Для Каждого Файл Из МассивФайлов Цикл
		
		ПолноеИмяФайла = Файл.ПолноеИмя;
		Если ПроверитьФайлВыбранДляРедактирования(ПолноеИмяФайла) Тогда
			ПривестиОбъектКСтандарту767EDT(ПолноеИмяФайла);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область АвтоформатированиеКодаМодулей

// Функция получает комментарий из строки.
// Например, строка <Строка; // Комментарий>:
//  Ложь - с символом комментария <// Комментарий>
//  Истина - без символа комментария <Комментарий>.
Функция ПолучитьКомментарийИзСтроки(СтрокаМодуля, БезСимволаКомментария = Истина)
	
	// Например, URLСтрока = "http://downloads.v8.1c.ru/tmplts/ITS/KLADR/"; - не проверяем на комментарий.
	СтрокаСКомментарием = СтрЗаменить(СтрокаМодуля, "://", "<<ВНЕШНЕЕСОЕДИНЕНИЕ>>");
	СтрокаКомментария = "";
	ПозицияКомментария = СтрНайти(СтрокаСКомментарием, "//");
	
	// Если нет знаков комментария, то возвращаем пустую строку.
	Если ПозицияКомментария = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	ПозицияКавычек = СтрНайти(СтрокаСКомментарием, """");
	// Проверяем есть ли вначале строки символ "|".
	ПервыйСимвол = Сред(СокрЛП(СтрокаСКомментарием), 1, 1);
	
	// Нет кавычек, оставляем весь комментарий.
	// Кавычки после комментария, оставляем весь комментарий.
	Если (ПозицияКавычек = 0 ИЛИ ПозицияКавычек > ПозицияКомментария) И ПервыйСимвол <> "|" Тогда
		
		Если БезСимволаКомментария Тогда
			СтрокаКомментария = Сред(СтрокаСКомментарием, ПозицияКомментария + 2);
		Иначе
			СтрокаКомментария = Сред(СтрокаСКомментарием, ПозицияКомментария);
		КонецЕсли;
		
	ИначеЕсли ПервыйСимвол = "|" Тогда
		
		КоличествоКавычекДоКомментария = СтрЧислоВхождений(Лев(СтрокаСКомментарием, ПозицияКомментария), """");
		
		// Строка открывается и закрывается до комментария, оставляем весь комментарий.
		Если КоличествоКавычекДоКомментария % 2 <> 0 Тогда
			Если БезСимволаКомментария Тогда
				СтрокаКомментария = Сред(СтрокаСКомментарием, ПозицияКомментария + 2);
			Иначе
				СтрокаКомментария = Сред(СтрокаСКомментарием, ПозицияКомментария);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		КоличествоКавычекДоКомментария = СтрЧислоВхождений(Лев(СтрокаСКомментарием, ПозицияКомментария), """");
		
		// Строка открывается и закрывается до комментария, оставляем весь комментарий.
		Если КоличествоКавычекДоКомментария % 2 = 0 Тогда
			Если БезСимволаКомментария Тогда
				СтрокаКомментария = Сред(СтрокаСКомментарием, ПозицияКомментария + 2);
			Иначе
				СтрокаКомментария = Сред(СтрокаСКомментарием, ПозицияКомментария);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// Цикл по символам начиная с ПозицияКомментария, искать первый символ <> "/".
	Если СтрДлина(СтрокаКомментария) <> 1 И БезСимволаКомментария И НЕ ПустаяСтрока(СтрокаКомментария) Тогда
		Для НомерСимвола = 1 По СтрДлина(СтрокаКомментария) Цикл
			ТекущийСимвол = Сред(СтрокаКомментария, НомерСимвола, 1);
			Если (НЕ ПустаяСтрока(СокрЛ(ТекущийСимвол)) И ТекущийСимвол <> "/") ИЛИ НомерСимвола = СтрДлина(СтрокаКомментария) Тогда
				СтрокаКомментария = СокрЛ(Сред(СтрокаКомментария, НомерСимвола));
				Прервать;
			КонецЕсли
		КонецЦикла;
	КонецЕсли;
	
	СтрокаСКомментарием = СтрЗаменить(СтрокаКомментария, "<<ВНЕШНЕЕСОЕДИНЕНИЕ>>", "://");
	
	Возврат СтрокаСКомментарием;
	
КонецФункции

Функция апк_ПолучитьРазделителиСлов()
	
	РазделителиСлов = Новый Соответствие;
	// На русском языке.
	РазделителиСлов.Вставить("ЕСЛИ", 				Истина);
	РазделителиСлов.Вставить("#ЕСЛИ", 				Истина);
	РазделителиСлов.Вставить("ИНАЧЕЕСЛИ", 			Истина);
	РазделителиСлов.Вставить("КОНЕЦЕСЛИ", 			Истина);
	РазделителиСлов.Вставить("#КОНЕЦЕСЛИ", 			Истина);
	РазделителиСлов.Вставить("ТОГДА", 				Истина);
	РазделителиСлов.Вставить("И", 					Истина);
	РазделителиСлов.Вставить("ИЛИ", 				Истина);
	РазделителиСлов.Вставить("НЕ", 					Истина);
	РазделителиСлов.Вставить("ИЗ", 					Истина);
	РазделителиСлов.Вставить("КАЖДОГО", 			Истина);
	РазделителиСлов.Вставить("ДЛЯ", 				Истина);
	РазделителиСлов.Вставить("ЦИКЛ", 				Истина);
	РазделителиСлов.Вставить("ПОКА", 				Истина);
	РазделителиСлов.Вставить("ПРОЦЕДУРА", 			Истина);
	РазделителиСлов.Вставить("ФУНКЦИЯ", 			Истина);
	РазделителиСлов.Вставить("КОНЕЦПРОЦЕДУРЫ", 		Истина);
	РазделителиСлов.Вставить("КОНЕЦФУНКЦИИ", 		Истина);
	РазделителиСлов.Вставить("ЭКСПОРТ", 			Истина);
	РазделителиСлов.Вставить("ПЕРЕМ", 				Истина);
	РазделителиСлов.Вставить("ЗНАЧ", 				Истина);
	РазделителиСлов.Вставить("НОВЫЙ", 				Истина);
	РазделителиСлов.Вставить("ПЕРЕЙТИ", 			Истина);
	РазделителиСлов.Вставить("ВЫЗВАТЬИСКЛЮЧЕНИЕ", 	Истина);
	РазделителиСлов.Вставить("ПОПЫТКА", 			Истина);
	РазделителиСлов.Вставить("ИСКЛЮЧЕНИЕ", 			Истина);
	РазделителиСлов.Вставить("КОНЕЦПОПЫТКИ", 		Истина);
	РазделителиСлов.Вставить("ДОБАВИТЬОБРАБОТЧИК", 	Истина);
	РазделителиСлов.Вставить("УДАЛИТЬОБРАБОТЧИК", 	Истина);
	РазделителиСлов.Вставить("ВОЗВРАТ", 			Истина);
	РазделителиСлов.Вставить("НЕОПРЕДЕЛЕНО", 		Истина);
	РазделителиСлов.Вставить("НЕОПРЕДЕЛЕНО;", 		Истина);
	РазделителиСлов.Вставить("НЕОПРЕДЕЛЕНО,", 		Истина);
	// На английском языке.
	РазделителиСлов.Вставить("IF", 					Истина);
	РазделителиСлов.Вставить("#IF", 				Истина);
	РазделителиСлов.Вставить("ELSIF", 				Истина);
	РазделителиСлов.Вставить("ENDIF", 				Истина);
	РазделителиСлов.Вставить("#ENDIF", 				Истина);
	РазделителиСлов.Вставить("THEN", 				Истина);
	РазделителиСлов.Вставить("AND", 				Истина);
	РазделителиСлов.Вставить("OR", 					Истина);
	РазделителиСлов.Вставить("NOT", 				Истина);
	РазделителиСлов.Вставить("FROM", 				Истина);
	РазделителиСлов.Вставить("EACH", 				Истина);
	РазделителиСлов.Вставить("FOR", 				Истина);
	РазделителиСлов.Вставить("DO", 					Истина);
	РазделителиСлов.Вставить("WHILE", 				Истина);
	РазделителиСлов.Вставить("PROCEDURE", 			Истина);
	РазделителиСлов.Вставить("FUNCTION", 			Истина);
	РазделителиСлов.Вставить("ENDPROCEDURE", 		Истина);
	РазделителиСлов.Вставить("ENDFUNCTION", 		Истина);
	РазделителиСлов.Вставить("EXPORT", 				Истина);
	РазделителиСлов.Вставить("VAR", 				Истина);
	РазделителиСлов.Вставить("VAL", 				Истина);
	РазделителиСлов.Вставить("NEW", 				Истина);
	РазделителиСлов.Вставить("GOTO", 				Истина);
	РазделителиСлов.Вставить("RAISE", 				Истина);
	РазделителиСлов.Вставить("TRY", 				Истина);
	РазделителиСлов.Вставить("EXCEPT", 				Истина);
	РазделителиСлов.Вставить("ENDTRY", 				Истина);
	РазделителиСлов.Вставить("ADDHANDLER", 			Истина);
	РазделителиСлов.Вставить("REMOVEHANDLER", 		Истина);
	РазделителиСлов.Вставить("RETURN", 				Истина);
	РазделителиСлов.Вставить("UNDEFINED", 			Истина);
	РазделителиСлов.Вставить("UNDEFINED;", 			Истина);
	РазделителиСлов.Вставить("UNDEFINED,", 			Истина);
	
	РазделителиСлов.Вставить("<", 					Истина);
	РазделителиСлов.Вставить(">", 					Истина);
	РазделителиСлов.Вставить("=", 					Истина);
	РазделителиСлов.Вставить("+", 					Истина);
	РазделителиСлов.Вставить("*", 					Истина);
	РазделителиСлов.Вставить("/", 					Истина);
	РазделителиСлов.Вставить("%", 					Истина);
	РазделителиСлов.Вставить(".", 					Истина);
	РазделителиСлов.Вставить(",", 					Истина);
	РазделителиСлов.Вставить(";", 					Истина);
	РазделителиСлов.Вставить("(", 					Истина);
	РазделителиСлов.Вставить(")", 					Истина);
	
	Возврат РазделителиСлов;
	
КонецФункции

Функция апк_ПолучитьСтрокиТекстаЗапроса()
	
	СтрокиЗапроса = Новый Массив;
	// На русском языке.
	СтрокиЗапроса.Добавить("ВЫБРАТЬ");
	СтрокиЗапроса.Добавить("Выбрать Первые");
	СтрокиЗапроса.Добавить("Выбрать *");
	СтрокиЗапроса.Добавить("|ИЗ");
	СтрокиЗапроса.Добавить("|ГДЕ");
	СтрокиЗапроса.Добавить(" ГДЕ ");
	СтрокиЗапроса.Добавить("|{ГДЕ");
	СтрокиЗапроса.Добавить("ГДЕ ЛОЖЬ");
	СтрокиЗапроса.Добавить("|ПОМЕСТИТЬ");
	СтрокиЗапроса.Добавить("|ВЫРАЗИТЬ");
	СтрокиЗапроса.Добавить("ВЫБОР КОГДА");
	СтрокиЗапроса.Добавить("ТОГДА");
	СтрокиЗапроса.Добавить("ИНДЕКСИРОВАТЬ ПО");
	СтрокиЗапроса.Добавить("УПОРЯДОЧИТЬ ПО");
	СтрокиЗапроса.Добавить("СГРУППИРОВАТЬ ПО");
	СтрокиЗапроса.Добавить("ИМЕЮЩИЕ");
	СтрокиЗапроса.Добавить("ОБЪЕДИНИТЬ");
	СтрокиЗапроса.Добавить("ОБЪЕДИНИТЬ ВСЕ");
	СтрокиЗапроса.Добавить("УНИЧТОЖИТЬ");
	СтрокиЗапроса.Добавить("NULL");
	СтрокиЗапроса.Добавить(" КАК");
	СтрокиЗапроса.Добавить("КАК ");
	СтрокиЗапроса.Добавить("ВОЗР");
	СтрокиЗапроса.Добавить("Возр");
	СтрокиЗапроса.Добавить("возр");
	СтрокиЗапроса.Добавить("УБЫВ");
	СтрокиЗапроса.Добавить("Убыв");
	СтрокиЗапроса.Добавить("ИТОГИ ПО");
	СтрокиЗапроса.Добавить("В (");
	СтрокиЗапроса.Добавить("В(");
	СтрокиЗапроса.Добавить("В ИЕРАРХИИ");
	СтрокиЗапроса.Добавить("ПЕРВЫЕ");
	СтрокиЗапроса.Добавить("ПОДОБНО");
	СтрокиЗапроса.Добавить("ПОМЕСТИТЬ");
	СтрокиЗапроса.Добавить("СОЕДИНЕНИЕ");
	СтрокиЗапроса.Добавить("НЕОПРЕДЕЛЕНО");
	СтрокиЗапроса.Добавить("ЗНАЧЕНИЕ");
	СтрокиЗапроса.Добавить("СУММА(");
	СтрокиЗапроса.Добавить("МЕЖДУ");
	СтрокиЗапроса.Добавить("НЕ ");
	СтрокиЗапроса.Добавить("И (");
	СтрокиЗапроса.Добавить("|	И");
	СтрокиЗапроса.Добавить("|И ");
	СтрокиЗапроса.Добавить(" И ");
	СтрокиЗапроса.Добавить("И &");
	СтрокиЗапроса.Добавить(" = &");
	СтрокиЗапроса.Добавить("ИЛИ");
	СтрокиЗапроса.Добавить(" ИЛИ ");
	СтрокиЗапроса.Добавить(" ИЛИ НЕ ");
	СтрокиЗапроса.Добавить(".ЭтоГруппа");
	СтрокиЗапроса.Добавить(".Ссылка");
	
	// На английском языке.
	СтрокиЗапроса.Добавить("SELECT");
	СтрокиЗапроса.Добавить("SELECT TOP");
	СтрокиЗапроса.Добавить("SELECT *");
	СтрокиЗапроса.Добавить("|FROM");
	СтрокиЗапроса.Добавить("|WHERE");
	СтрокиЗапроса.Добавить(" WHERE ");
	СтрокиЗапроса.Добавить("|{WHERE");
	СтрокиЗапроса.Добавить("WHERE FALSE");
	СтрокиЗапроса.Добавить("|INTO");
	СтрокиЗапроса.Добавить("|CAST");
	СтрокиЗапроса.Добавить("CASE WHEN");
	СтрокиЗапроса.Добавить("THEN");
	СтрокиЗапроса.Добавить("INDEX BY");
	СтрокиЗапроса.Добавить("ORDER BY");
	СтрокиЗапроса.Добавить("GROUP BY");
	СтрокиЗапроса.Добавить("HAVING");
	СтрокиЗапроса.Добавить("UNION");
	СтрокиЗапроса.Добавить("UNION ALL");
	СтрокиЗапроса.Добавить("DROP");
	СтрокиЗапроса.Добавить("NULL");
	СтрокиЗапроса.Добавить(" AS");
	СтрокиЗапроса.Добавить("AS ");
	СтрокиЗапроса.Добавить("ASC");
	СтрокиЗапроса.Добавить("Asc");
	СтрокиЗапроса.Добавить("asc");
	СтрокиЗапроса.Добавить("DESC");
	СтрокиЗапроса.Добавить("Desc");
	СтрокиЗапроса.Добавить("TOTALS BY");
	СтрокиЗапроса.Добавить("IN (");
	СтрокиЗапроса.Добавить("IN(");
	СтрокиЗапроса.Добавить("IN HIERARCHY");
	СтрокиЗапроса.Добавить("TOP");
	СтрокиЗапроса.Добавить("LIKE");
	СтрокиЗапроса.Добавить("INTO");
	СтрокиЗапроса.Добавить("JOIN");
	СтрокиЗапроса.Добавить("UNDEFINED");
	СтрокиЗапроса.Добавить("VALUE");
	СтрокиЗапроса.Добавить("SUM(");
	СтрокиЗапроса.Добавить("BETWEEN");
	СтрокиЗапроса.Добавить("NOT ");
	СтрокиЗапроса.Добавить("AND (");
	СтрокиЗапроса.Добавить("|	AND");
	СтрокиЗапроса.Добавить("|AND ");
	СтрокиЗапроса.Добавить(" AND ");
	СтрокиЗапроса.Добавить("AND &");
	СтрокиЗапроса.Добавить(" = &");
	СтрокиЗапроса.Добавить("OR");
	СтрокиЗапроса.Добавить(" OR ");
	СтрокиЗапроса.Добавить(" OR NOT ");
	СтрокиЗапроса.Добавить(".IsFolder");
	СтрокиЗапроса.Добавить(".Ref");
	
	Возврат СтрокиЗапроса;
	
КонецФункции

Функция ПолучитьТаблицуСлужебныхСлов()
	
	ТаблицаСлужебныхСлов = Новый ТаблицаЗначений;
	ТаблицаСлужебныхСлов.Колонки.Добавить("Имя");
	ТаблицаСлужебныхСлов.Колонки.Добавить("Положение");
	
	// На русском языке.
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "ТОГДА";
	НоваяСтрока.Положение = "Конец";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "ЦИКЛ";
	НоваяСтрока.Положение = "Конец";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "ИНАЧЕ";
	НоваяСтрока.Положение = "Конец";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "КОНЕЦФУНКЦИИ";
	НоваяСтрока.Положение = "Конец";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "КОНЕЦПРОЦЕДУРЫ";
	НоваяСтрока.Положение = "Конец";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "ЭКСПОРТ";
	НоваяСтрока.Положение = "Конец";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "КОНЕЦПОПЫТКИ";
	НоваяСтрока.Положение = "Конец";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "ПРОДОЛЖИТЬ";
	НоваяСтрока.Положение = "Конец";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "ПРЕРВАТЬ";
	НоваяСтрока.Положение = "Конец";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "ФУНКЦИЯ";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "ПРОЦЕДУРА";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "ЕСЛИ ";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "КОНЕЦЕСЛИ";
	НоваяСтрока.Положение = "Конец";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "ДЛЯ ";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "ПЕРЕМ ";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "ПОПЫТКА";
	НоваяСтрока.Положение = "Строка";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "ИНАЧЕЕСЛИ";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "ПОКА ";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "ИСКЛЮЧЕНИЕ";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "ВОЗВРАТ";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "#ОБЛАСТЬ";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "#КОНЕЦОБЛАСТИ";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "|";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "#ЕСЛИ";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "#КОНЕЦЕСЛИ";
	НоваяСтрока.Положение = "Начало";
	
	// На английском языке.
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "THEN";
	НоваяСтрока.Положение = "Конец";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "DO";
	НоваяСтрока.Положение = "Конец";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "ESLE";
	НоваяСтрока.Положение = "Конец";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "ENDFUNCTION";
	НоваяСтрока.Положение = "Конец";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "ENDPROCEDURE";
	НоваяСтрока.Положение = "Конец";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "EXPORT";
	НоваяСтрока.Положение = "Конец";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "ENDTRY";
	НоваяСтрока.Положение = "Конец";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "CONTINUE";
	НоваяСтрока.Положение = "Конец";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "BREAK";
	НоваяСтрока.Положение = "Конец";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "FUNCTION";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "PROCEDURE";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "IF ";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "ENDIF";
	НоваяСтрока.Положение = "Конец";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "FOR ";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "VAR ";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "TRY";
	НоваяСтрока.Положение = "Строка";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "ELSIF";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "WHILE ";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "EXCEPT";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "RETURN";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "#REGION";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "#ENDREGION";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "|";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "#IF";
	НоваяСтрока.Положение = "Начало";
	
	НоваяСтрока = ТаблицаСлужебныхСлов.Добавить();
	НоваяСтрока.Имя = "#ENDIF";
	НоваяСтрока.Положение = "Начало";
	
	Возврат ТаблицаСлужебныхСлов;
	
КонецФункции

// Функция возвращает Истину, если переданная строка содержит описание области, иначе - Ложь.
// Пример: Для строк "СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ", "СтандартныеПодсистемы", "Конец СтандартныеПодсистемы"
// функция возвращает значение Истина.
//
Функция СтрокаСодержитОписаниеОбласти(Строка)
	
	МассивТекстКонецСПробелом = Новый Массив;
	МассивТекстКонецСПробелом.Добавить("КОНЕЦ ");
	МассивТекстКонецСПробелом.Добавить("END ");
	
	СокрСтрока = СтрЗаменить(Строка, Символы.Таб, " ");
	ПозицияФразы = СтрНайтиПоМассиву(ВРег(СокрСтрока), МассивТекстКонецСПробелом,, Истина).Позиция;
	Если ПозицияФразы > 0 И ПустаяСтрока(Сред(СокрСтрока, 1, ПозицияФразы - 1)) Тогда
		СокрСтрока = Сред(СокрСтрока, ПозицияФразы + 5);
	КонецЕсли;
	
	СтрокаБезПробелов = СтрЗаменить(СокрСтрока, " ", "");
	СтрокаБезПробеловИТочек = СтрЗаменить(СтрокаБезПробелов, ".", "");
	Если НЕ апк_СловоСодержитТолькоКириллицу(СтрокаБезПробеловИТочек) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СокрСтрока = СокрЛП(СокрСтрока);
	
	Если СтрНайти(СокрСтрока, " ") = 0 ИЛИ СтрокаВВерхнемРегистре(СокрСтрока) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Возвращает Истину, если в строка представляет из себя закомментированный код
// иначе, (это комментарий) возвращает Ложь.
// На вход подается строка модуля без комментария.
Функция ЭтоКод(Знач СтрокаМодуля)
	
	Если ПустаяСтрока(СтрокаМодуля) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Лев(СокрЛ(СтрокаМодуля), 1) = "|" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если СтрНайти(ВРег(СтрокаМодуля), "НСТР(") > 0
	 ИЛИ СтрНайти(ВРег(СтрокаМодуля), "NSTR(") > 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	МассивСимволовКода = Новый Массив;
	МассивСимволовКода.Добавить("<");
	МассивСимволовКода.Добавить(">");
	МассивСимволовКода.Добавить("=");
	
	МассивФразКомментария = Новый Массив;
	МассивФразКомментария.Добавить("ПРИМЕР:");
	МассивФразКомментария.Добавить("EXAMPLE:");
	МассивФразКомментария.Добавить("НАПРИМЕР,");
	МассивФразКомментария.Добавить("EXAMPLE,");
	МассивФразКомментария.Добавить("СМ.");
	МассивФразКомментария.Добавить("SEE");
	МассивФразКомментария.Добавить("КАВЫЧКИ.");
	МассивФразКомментария.Добавить(": КАВЫЧКИ");
	МассивФразКомментария.Добавить(".<");
	МассивФразКомментария.Добавить(">.");
	МассивФразКомментария.Добавить("->");
	МассивФразКомментария.Добавить("**");
	МассивФразКомментария.Добавить("{HTTP");
	
	МассивТекстВыбрать = Новый Массив;
	МассивТекстВыбрать.Добавить("ВЫБРАТЬ");
	МассивТекстВыбрать.Добавить("SELECT");
	
	РазделителиСлов = апк_ПолучитьРазделителиСлов();
	СтрокаРазделителейОкончанияСлов = ",.;*/%+-><)(";
	
	МассивИсключений = Новый Массив;
	МассивИсключений.Добавить("<xs:");
	МассивИсключений.Добавить("</xs:");
	МассивИсключений.Добавить("<?xml");
	
	ВесКода = 0;
	
	Если Лев(СтрокаМодуля, 1) = " " Тогда
		ВесКода = ВесКода - 3;
	ИначеЕсли Лев(СтрокаМодуля, 1) = Символы.Таб Тогда
		ВесКода = ВесКода + 3;
	ИначеЕсли Лев(СтрокаМодуля, 1) = "-" Тогда
		ВесКода = ВесКода - 3;
	Иначе
		ВесКода = ВесКода + 1;
	КонецЕсли;
	
	СтрокиЗапроса = апк_ПолучитьСтрокиТекстаЗапроса();
	Для Каждого СтрокаЗапроса Из СтрокиЗапроса Цикл
		ПозицияСимволаЗапроса = СтрНайти(СтрокаМодуля, СтрокаЗапроса);
		Если ПозицияСимволаЗапроса = 0 Тогда
			Продолжить;
		ИначеЕсли ПозицияСимволаЗапроса = 1 Тогда
			ВесКода = ВесКода + 5;
		Иначе
			ВесКода = ВесКода + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрЧислоВхождений(СтрокаМодуля, """") % 2 <> 0 Тогда
		ВесКода = ВесКода + 3;
	КонецЕсли;
	
	Строка = СтрЗаменить(СтрокаМодуля, Символы.Таб, " ");
	
	// Удаляем все, что находится в кавычках.
	ПозицияКавычки = СтрНайти(Строка, """");
	Пока ПозицияКавычки > 0 Цикл
		ПозицияЗакрывающейКавычки = СтрНайти(Сред(Строка, ПозицияКавычки + 1), """") + ПозицияКавычки;
		Если ПозицияЗакрывающейКавычки = 0 Тогда
			Прервать;
		КонецЕсли;
		Строка = Лев(Строка, ПозицияКавычки - 1) + "Кавычки" + Сред(Строка, ПозицияЗакрывающейКавычки + 1);
		ПозицияКавычки = СтрНайти(Строка, """");
	КонецЦикла;
	
	МассивСлов = апк_СтрРазделить(Строка, " ", Ложь);
	МассивСловВВерхнем = апк_СтрРазделить(ВРег(Строка), " ", Ложь);
	
	Если МассивСловВВерхнем.Количество() > 1 Тогда
		Если МассивСловВВерхнем[0] = "ДЛЯ" Тогда
			Возврат (МассивСловВВерхнем.Найти("ЦИКЛ") <> Неопределено);
		КонецЕсли;
		Если МассивСловВВерхнем[0] = "FOR" Тогда
			Возврат (МассивСловВВерхнем.Найти("DO") <> Неопределено);
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого СимволКода Из МассивИсключений Цикл
		ПозицияИсключения = СтрНайти(ВРег(Строка), ВРег(СимволКода));
		Если ПозицияИсключения > 0 И ПустаяСтрока(Сред(Строка, 1, ПозицияИсключения - 1)) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для Счетчик = 0 По МассивСлов.Количество() - 2 Цикл
		
		Если РазделителиСлов[МассивСловВВерхнем[Счетчик]] = Неопределено
			И РазделителиСлов[МассивСловВВерхнем[Счетчик + 1]] = Неопределено
			И СтрНайти(СтрокаРазделителейОкончанияСлов, Прав(МассивСловВВерхнем[Счетчик], 1)) = 0 Тогда
			
			ВесКода = ВесКода - 3;
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокаВРег = ВРег(СокрЛП(Строка));
	ТаблицаСлужебныхСлов = ПолучитьТаблицуСлужебныхСлов();
	Для Каждого СтрокаСлужебноеСлово Из ТаблицаСлужебныхСлов Цикл
		СлужебноеСлово = СтрокаСлужебноеСлово.Имя;
		Если СтрокаСлужебноеСлово.Положение = "Начало" Тогда
			Если Лев(СтрокаВРег, СтрДлина(СлужебноеСлово)) = СлужебноеСлово Тогда
				ВесКода = ВесКода + 5;
			КонецЕсли;
		ИначеЕсли СтрокаСлужебноеСлово.Положение = "Конец" Тогда
			Если Прав(СтрокаВРег, СтрДлина(СлужебноеСлово)) = СлужебноеСлово Тогда
				ВесКода = ВесКода + 5;
			КонецЕсли;
		ИначеЕсли СтрокаСлужебноеСлово.Положение = "Строка" Тогда
			Если СтрокаВРег = СлужебноеСлово Тогда
				ВесКода = ВесКода + 5;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если МассивСлов.Количество() = 1 И ВесКода < 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВсеСловаСЗаглавнойБуквы = Истина;
	Для Каждого Слово Из МассивСлов Цикл
		
		Слово = СокрЛП(Слово);
		ПервыйСимвол = Лев(Слово, 1);
		
		Если ПервыйСимвол = "&" Тогда
			ВесКода = ВесКода + 1;
		ИначеЕсли НЕ (СтрокаВВерхнемРегистре(ПервыйСимвол) И НЕ СтрокаВВерхнемРегистре(Слово))
			И (апк_СловоСодержитТолькоЛатиницу(ПервыйСимвол) ИЛИ апк_СловоСодержитТолькоКириллицу(ПервыйСимвол)) Тогда
			
			ВесКода = ВесКода - 2;
			ВсеСловаСЗаглавнойБуквы = Ложь;
		КонецЕсли;
		
		ПозицияСкобки = СтрНайти(Слово, "(");
		СимволПередСкобкой = Сред(Слово, ПозицияСкобки - 1, 1);
		Если ПозицияСкобки > 0
			И (апк_СловоСодержитТолькоЛатиницу(СимволПередСкобкой)
			ИЛИ апк_СловоСодержитТолькоКириллицу(СимволПередСкобкой)
			ИЛИ апк_ЭтоЧисло(СимволПередСкобкой)) Тогда
			
			ВесКода = ВесКода + 1;
			
		ИначеЕсли ПозицияСкобки > 0 Тогда
			
			ВесКода = ВесКода - 1;
			
		КонецЕсли;
		
		ПозицияТочки = СтрНайти(Слово, ".");
		СимволПослеТочки = Сред(Слово, ПозицияТочки + 1, 1);
		СловоПослеТочки = Сред(Слово, ПозицияТочки + 1);
		СловоДоТочки = Лев(Слово, ПозицияТочки - 1);
		Пока ПозицияТочки > 0 Цикл
			Если (апк_СловоСодержитТолькоЛатиницу(СимволПослеТочки)
				ИЛИ апк_СловоСодержитТолькоКириллицу(СимволПослеТочки)
				ИЛИ апк_ЭтоЧисло(СимволПослеТочки)
				ИЛИ СимволПослеТочки = "_") Тогда
				
				Если апк_ЭтоЧисло(СловоДоТочки) Тогда
					ВесКода = ВесКода - 3;
				Иначе
					ВесКода = ВесКода + 1;
				КонецЕсли;
			Иначе
				ВесКода = ВесКода - 1;
			КонецЕсли;
			
			ПозицияТочки = СтрНайти(СловоПослеТочки, ".");
			СловоПослеТочки = Сред(СловоПослеТочки, ПозицияТочки + 1);
			СимволПослеТочки = Сред(СловоПослеТочки, ПозицияТочки + 1, 1);
		КонецЦикла;
		
		Для Каждого СимволКода Из МассивСимволовКода Цикл
			Если СтрНайти(Слово, СимволКода) > 0 Тогда
				ВесКода = ВесКода + 1;
			КонецЕсли;
		КонецЦикла;
		
		ПозицияДвоеточия = СтрНайти(Слово, ":");
		СимволПередДвоеточием = Сред(Слово, ПозицияДвоеточия - 1, 1);
		Если ПозицияДвоеточия > 0
			И (апк_СловоСодержитТолькоЛатиницу(СимволПередДвоеточием)
			ИЛИ апк_СловоСодержитТолькоКириллицу(СимволПередДвоеточием)
			ИЛИ апк_ЭтоЧисло(СимволПередДвоеточием))Тогда
			
			ВесКода = ВесКода - 2;
		КонецЕсли;
		
		ПозицияЗвездочка = СтрНайти(Слово, "*");
		ПозицияВыбрать = СтрНайтиПоМассиву(ВРег(Слово),МассивТекстВыбрать,, Истина).Позиция;
		Если ПозицияЗвездочка > 0 И ПозицияВыбрать = 0 Тогда
			ВесКода = ВесКода - 2;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СимволКода Из МассивФразКомментария Цикл
		Если СтрНайти(ВРег(Строка), СимволКода) > 0 Тогда
			ВесКода = ВесКода - 5;
		КонецЕсли;
	КонецЦикла;
	
	Если ВсеСловаСЗаглавнойБуквы И МассивСлов.Количество() > 1 Тогда
		ВесКода = ВесКода + 2;
	КонецЕсли;
	
	Если МассивСлов.Количество() = 1 Тогда
		ВесКода = ВесКода - 2;
	КонецЕсли;
	
	Если Прав(СокрП(Строка), 1) = "." Тогда
		ВесКода = ВесКода - 5;
	КонецЕсли;
	
	Если СтрНайти(Строка, "...") > 0 Тогда
		ВесКода = ВесКода - 2;
	КонецЕсли;
	
	Если Лев(Строка, 1) = "=" Тогда
		ВесКода = ВесКода - 3;
	КонецЕсли;
	
	Если Прав(СтрокаВРег, 1) = ";" Тогда
		ВесКода = ВесКода + 1;
	КонецЕсли;
	
	Если Прав(СтрокаВРег, 1) = "-" Тогда
		ВесКода = ВесКода - 1;
	КонецЕсли;
	
	Если СтрокаСодержитОписаниеОбласти(СокрЛП(СтрокаМодуля)) Тогда
		ВесКода = ВесКода + 5;
	КонецЕсли;
	
	Если СтрокаМодуля = ВРег(СтрокаМодуля) Тогда
		ВесКода = ВесКода - 3;
	КонецЕсли;
	
	ЕстьСтрелка = (СтрНайти(СтрокаМодуля, "->") > 0);
	ЕстьТире = ЕстьСтрелка ИЛИ (СтрНайти(СтрокаМодуля, "-") > 0);
	ЕстьРавно = (СтрНайти(СтрокаМодуля, "=") > 0);
	ПервыйСимвол = Лев(СтрокаМодуля, 1);
	ПервыйСимволСокрЛ = Лев(СокрЛ(СтрокаМодуля), 1);
	ПоследнийСимвол = Прав(СокрП(СтрокаМодуля), 1);
	Если ЕстьТире И ЕстьРавно И (НЕ ЕстьСтрелка) Тогда
		ВесКода = ВесКода + 10;
	ИначеЕсли (ПервыйСимволСокрЛ = "-") И (ПоследнийСимвол <> ";") Тогда
		ВесКода = ВесКода - 10;
	ИначеЕсли (СтрЧислоВхождений(СтрокаМодуля, "-") >= 2) И (ПоследнийСимвол <> ";") Тогда
		ВесКода = ВесКода - 10;
	ИначеЕсли (СтрНайти(СтрокаМодуля, ", ") > 0)
			И (СтрНайти(СтрокаМодуля, ";") = 0)
			И (СтрНайти(СтрокаМодуля, "(") = 0)
			И (СтрНайти(СтрокаМодуля, ")") = 0)
			И (СтрНайти(СтрокаМодуля, "+") = 0)
			И (СтрНайти(СтрокаМодуля, "=") = 0) Тогда
			
			ВесКода = ВесКода - 10;
	КонецЕсли;
	
	Возврат ВесКода >= 0;
	
КонецФункции

// Получает массив строк из переданной строки по разделителю.
//
// Параметры:
//   Строка - Переданная строка со значениями.
//   Разделитель - Символ для разделения значений списка.
//   ВключатьПустые - Флаг указывающий, что будут включены пустые значения.
//
// Возвращаемое значение:
//   Массив
//
Функция апк_СтрРазделить(Знач Строка, Разделитель = ";", ВключатьПустые = Истина)
	
	МассивСлов = Новый Массив;
	Строка = СокрЛП(Строка);
	Если СтрНайти(Строка, Разделитель) = 0 Тогда
		Если НЕ ПустаяСтрока(Строка) Тогда
			МассивСлов.Добавить(Строка);
		КонецЕсли;
		Возврат МассивСлов;
	КонецЕсли;
	
	Строка = СтрЗаменить(Строка, Разделитель, Символы.ПС);
	ВсегоСтрок = СтрЧислоСтрок(Строка);
	
	Для НомерСтроки = 1 По ВсегоСтрок Цикл
		
		ТекущаяСтрока = СокрЛП(СтрПолучитьСтроку(Строка, НомерСтроки));
		Если ПустаяСтрока(ТекущаяСтрока) И (НомерСтроки = ВсегоСтрок) Тогда
			Прервать;
		КонецЕсли;
		
		Если ПустаяСтрока(ТекущаяСтрока) И (НЕ ВключатьПустые) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивСлов.Добавить(ТекущаяСтрока);
	КонецЦикла;
	
	Возврат МассивСлов;
	
КонецФункции

Функция апк_СтрЗаменить(Знач Текст, ТекстЗамены, НомерСимволаНачало, НомерСимволаКонец)
	
	ТекстДо = Лев(Текст, НомерСимволаНачало - 1);
	ТекстПосле = Сред(Текст, НомерСимволаКонец + 1);
	
	СтрокаПробелов = "";
	Для Счетчик = НомерСимволаНачало По НомерСимволаКонец Цикл
		СтрокаПробелов = СтрокаПробелов + ТекстЗамены;
	КонецЦикла;
	
	Возврат ТекстДо + СтрокаПробелов + ТекстПосле;
	
КонецФункции

// Возвращает Истину, если слово содержит кириллические буквы, иначе возвращает Ложь.
//
Функция апк_СловоСодержитКириллицу(Знач Слово)
	
	Если ПустаяСтрока(Слово) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Алфавит = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя";
	
	Слово = НРег(Слово);
	ВсегоБукв = СтрДлина(Слово);
	Для Счетчик = 1 По ВсегоБукв Цикл
		Буква = Сред(Слово, Счетчик, 1);
		Если СтрНайти(Алфавит, Буква) > 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Возвращает Истину, если слово содержит латинские буквы, иначе возвращает Ложь.
//
Функция апк_СловоСодержитЛатиницу(Знач Слово)
	
	Если ПустаяСтрока(Слово) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Алфавит = "abcdefghijklmnopqrstuvwxyz";
	
	Слово = НРег(Слово);
	ВсегоБукв = СтрДлина(Слово);
	Для Счетчик = 1 По ВсегоБукв Цикл
		Буква = Сред(Слово, Счетчик, 1);
		Если СтрНайти(Алфавит, Буква) > 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Возвращает Истину, если слово содержит кириллические или латинские буквы.
// Иначе - слово состоит только из цифр, точек, тире и др. знаков пунктуации - возвращает Ложь.
//
Функция апк_СловоСодержитБуквы(Знач Слово)
	
	Возврат апк_СловоСодержитКириллицу(Слово) ИЛИ апк_СловоСодержитЛатиницу(Слово);
	
КонецФункции

// Возвращает Истину, если слово содержит цифры, иначе возвращает Ложь.
//
Функция апк_СловоСодержитЦифры(Знач Слово)
	
	Если ПустаяСтрока(Слово) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстЦифры = "0123456789";
	
	ВсегоСимволов = СтрДлина(Слово);
	Для Счетчик = 1 По ВсегоСимволов Цикл
		Символ = Сред(Слово, Счетчик, 1);
		Если СтрНайти(ТекстЦифры, Символ) > 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Возвращает Истину, если слово содержит цифры, кириллические или латинские буквы.
// Иначе - слово состоит только из точек, тире и др. знаков пунктуации - возвращает Ложь.
//
Функция апк_СловоСодержитЗначимыеСимволы(Знач Слово)
	
	Возврат апк_СловоСодержитБуквы(Слово) ИЛИ апк_СловоСодержитЦифры(Слово) ИЛИ (СтрНайти(Слово, "_") > 0);
	
КонецФункции

// Возвращает Истину, если слово состоит только из кириллических букв
// иначе (латинские буквы, цифры, любые символы) возвращает Ложь.
Функция апк_СловоСодержитТолькоКириллицу(Слово)
	
	Если Слово = "" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РусскийАлфавит = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя";
	ВсегоБукв = СтрДлина(Слово);
	
	Для Счетчик = 1 По ВсегоБукв Цикл
		
		Буква = НРег(Сред(Слово, Счетчик, 1));
		Если СтрНайти(РусскийАлфавит, Буква) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Возвращает Истину, если слово состоит только из латинских букв
// иначе (кириллические буквы, цифры, любые символы) возвращает Ложь.
Функция апк_СловоСодержитТолькоЛатиницу(Слово)
	
	Если Слово = "" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	АнглийскийАлфавитНижнийРегистр = "qwertyuiopasdfghjklzxcvbnm";
	СловоНижнийРегистр = НРег(Слово);
	КоличествоБуквСлова = СтрДлина(Слово);
	
	Для Счетчик = 1 По КоличествоБуквСлова Цикл
		
		БукваНижнегоРегистра = Сред(СловоНижнийРегистр, Счетчик, 1);
		
		Если СтрНайти(АнглийскийАлфавитНижнийРегистр, БукваНижнегоРегистра) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Возвращает Истину, если переданный параметр - Число.
//
Функция апк_ЭтоЧисло(Строка)
	
	МассивЗнаковИсключений = Новый Массив;
	МассивЗнаковИсключений.Добавить(".");
	МассивЗнаковИсключений.Добавить("+");
	МассивЗнаковИсключений.Добавить("-");
	
	Если МассивЗнаковИсключений.Найти(Строка) <> Неопределено
		ИЛИ Строка = "" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Число = Число(Строка);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Возвращает Истину, если переданный параметр - Булево.
//
Функция апк_ЭтоБулево(Значение)
	
	Попытка
		Значение = Булево(Значение);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Значение;
	
КонецФункции

Функция СтрокаВВерхнемРегистре(Строка)
	
	Если Строка = """" ИЛИ Строка = "{" ИЛИ Строка = "(" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ВРег(Строка) = Строка;
	
КонецФункции

Функция ОбластьИспользованиеМодальностиОткрыта(Строка, ОбластьОткрыта)
	
	// Если текст "ИспользованиеМодальности" не найден, то возвращаем текущее состояние области.
	Если СтрНайти(Строка, ВРег("ИспользованиеМодальности")) = 0 Тогда
		Возврат ОбластьОткрыта;
	КонецЕсли;
	
	// Иначе возвращаем Истина, если слово "Конец" не найдено.
	// И возвращаем Ложь, если слово "Конец" найдено, т.е. область закрылась.
	Возврат (СтрНайти(Строка, ВРег("Конец")) = 0 ИЛИ СтрНайти(Строка, ВРег("End")) = 0);
	
КонецФункции

Функция ПолучитьНомерСтрокиМодуля(ТекстМодуля, НомерСимвола)
	
	ТекстДоСимвола = Лев(ТекстМодуля, НомерСимвола);
	НомерСтроки = СтрЧислоСтрок(ТекстДоСимвола);
	
	Возврат НомерСтроки;
	
КонецФункции

Функция ПолучитьТаблицуЭталоновКлючевыхСлов()
	
	МассивЭталонов = Новый Массив;
	// На русском языке.
	МассивЭталонов.Добавить("Если");
	МассивЭталонов.Добавить("Тогда");
	МассивЭталонов.Добавить("Иначе");
	МассивЭталонов.Добавить("ИначеЕсли");
	МассивЭталонов.Добавить("КонецЕсли");
	МассивЭталонов.Добавить("Для");
	МассивЭталонов.Добавить("Каждого");
	МассивЭталонов.Добавить("Цикл");
	МассивЭталонов.Добавить("КонецЦикла");
	МассивЭталонов.Добавить("Выполнить");
	МассивЭталонов.Добавить("По");
	МассивЭталонов.Добавить("Прервать");
	МассивЭталонов.Добавить("Продолжить");
	МассивЭталонов.Добавить("Из");
	МассивЭталонов.Добавить("Новый");
	МассивЭталонов.Добавить("Перейти");
	МассивЭталонов.Добавить("Перем");
	МассивЭталонов.Добавить("Пока");
	МассивЭталонов.Добавить("Попытка");
	МассивЭталонов.Добавить("Исключение");
	МассивЭталонов.Добавить("КонецПопытки");
	МассивЭталонов.Добавить("ВызватьИсключение");
	МассивЭталонов.Добавить("Процедура");
	МассивЭталонов.Добавить("КонецПроцедуры");
	МассивЭталонов.Добавить("Функция");
	МассивЭталонов.Добавить("КонецФункции");
	МассивЭталонов.Добавить("Возврат");
	МассивЭталонов.Добавить("ДобавитьОбработчик");
	МассивЭталонов.Добавить("УдалитьОбработчик");
	МассивЭталонов.Добавить("И");
	МассивЭталонов.Добавить("ИЛИ");
	МассивЭталонов.Добавить("НЕ");
	МассивЭталонов.Добавить("Или");
	МассивЭталонов.Добавить("Не");
	МассивЭталонов.Добавить("каждого");
	
	// На английском языке.
	МассивЭталонов.Добавить("If");
	МассивЭталонов.Добавить("Then");
	МассивЭталонов.Добавить("Else");
	МассивЭталонов.Добавить("ElsIf");
	МассивЭталонов.Добавить("EndIf");
	МассивЭталонов.Добавить("For");
	МассивЭталонов.Добавить("Each");
	МассивЭталонов.Добавить("Do");
	МассивЭталонов.Добавить("EndDo");
	МассивЭталонов.Добавить("Execute");
	МассивЭталонов.Добавить("By");
	МассивЭталонов.Добавить("Break");
	МассивЭталонов.Добавить("Continue");
	МассивЭталонов.Добавить("From");
	МассивЭталонов.Добавить("New");
	МассивЭталонов.Добавить("Goto");
	МассивЭталонов.Добавить("Var");
	МассивЭталонов.Добавить("While");
	МассивЭталонов.Добавить("Try");
	МассивЭталонов.Добавить("Except");
	МассивЭталонов.Добавить("EndTry");
	МассивЭталонов.Добавить("Raise");
	МассивЭталонов.Добавить("Procedure");
	МассивЭталонов.Добавить("EndProcedure");
	МассивЭталонов.Добавить("Function");
	МассивЭталонов.Добавить("EndFunction");
	МассивЭталонов.Добавить("Return");
	МассивЭталонов.Добавить("AddHandler");
	МассивЭталонов.Добавить("RemoveHandler");
	МассивЭталонов.Добавить("And");
	МассивЭталонов.Добавить("OR");
	МассивЭталонов.Добавить("NOT");
	МассивЭталонов.Добавить("Or");
	МассивЭталонов.Добавить("Not");
	МассивЭталонов.Добавить("each");
	
	ТаблицаКлючевыхСлов = Новый ТаблицаЗначений;
	ТаблицаКлючевыхСлов.Колонки.Добавить("Эталон");
	ТаблицаКлючевыхСлов.Колонки.Добавить("ДлинаЭталона");
	ТаблицаКлючевыхСлов.Колонки.Добавить("СловоДляПоиска");
	
	Для Каждого Эталон Из МассивЭталонов Цикл
		СтрокаТаблицы = ТаблицаКлючевыхСлов.Добавить();
		СтрокаТаблицы.Эталон = Эталон;
		СтрокаТаблицы.ДлинаЭталона = СтрДлина(Эталон);
		СтрокаТаблицы.СловоДляПоиска = " " + ВРег(Эталон) + " ";
	КонецЦикла;
	
	ТаблицаКлючевыхСлов.Индексы.Добавить("Эталон");
	
	Возврат ТаблицаКлючевыхСлов;
	
КонецФункции

Функция ПолучитьВыражениеПоискаКлючевыхСлов(ТаблицаКлючевыхСлов)
	
	МассивКлючевыхСлов = ТаблицаКлючевыхСлов.ВыгрузитьКолонку("Эталон");
	КлючевыеСловаСтрокой = СтрСоединить(МассивКлючевыхСлов, "\b|\b");
	ВыражениеПоиска = СтрШаблон("\b%1\b", КлючевыеСловаСтрокой);
	
	Возврат ВыражениеПоиска;
	
КонецФункции

Функция ПроверкаКаноническогоНаписанияКлючевыхСлов(ДокументТекст)
	
	ФайлИзменен = Ложь;
	
	ТекстМодуля = ДокументТекст.ПолучитьТекст();
	
	// Получаем таблицу ключевых слов.
	ТаблицаКлючевыхСлов = Контекст["ТаблицаКлючевыхСлов"];
	
	// Получаем регулярное выражения для поиска ключевых слов.
	ВыражениеПоиска = Контекст["ВыражениеПоискаКлючевыхСлов"];
	РезультатПоискаКлючевыхСлов = СтрНайтиВсеПоРегулярномуВыражению(ТекстМодуля, ВыражениеПоиска, Истина, Истина);
	
	Если РезультатПоискаКлючевыхСлов.Количество() = 0 Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	ОбластьОткрыта = Ложь;
	НомерПровереннойСтроки = 0;
	СтрокаМодуляИсходная = "";
	
	Для Каждого РезультатПоиска Из РезультатПоискаКлючевыхСлов Цикл
		
		НайденноеСловоИсходное = РезультатПоиска.Значение;
		Если ТаблицаКлючевыхСлов.Найти(НайденноеСловоИсходное, "Эталон") <> Неопределено Тогда
			// Слово найдено среди эталонов, пропускаем.
			Продолжить;
		КонецЕсли;
		
		ПозицияКлючевогоСлова = РезультатПоиска.НачальнаяПозиция;
		НомерСтроки = ПолучитьНомерСтрокиМодуля(ТекстМодуля, ПозицияКлючевогоСлова);
		
		// Несколько ключевых слов могут быть в одной строке.
		ЭтоНоваяПроверяемаяСтрока = (НомерСтроки <> НомерПровереннойСтроки);
		СтрокаМодуляИсходная  = ?(ЭтоНоваяПроверяемаяСтрока, ДокументТекст.ПолучитьСтроку(НомерСтроки), СтрокаМодуляИсходная);
		
		Если ПустаяСтрока(СтрокаМодуляИсходная) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоЗакомментированнаяСтрока = Ложь;
		
		// Дополнительную проверку проводим только для новой проверяемой строки.
		Если ЭтоНоваяПроверяемаяСтрока Тогда
			
			НомерПровереннойСтроки = НомерСтроки;
			
			// Если вся строка - это комментарий, то пропускаем.
			СтрокаМодуляСокрЛ = СокрЛ(СтрокаМодуляИсходная);
			ЭтоЗакомментированнаяСтрока = СтрНачинаетсяС(СтрокаМодуляСокрЛ, "//");
			Если ЭтоЗакомментированнаяСтрока Тогда
				Продолжить;
			КонецЕсли;
			
			ОбластьОткрыта = ОбластьИспользованиеМодальностиОткрыта(СтрокаМодуляИсходная, ОбластьОткрыта);
			Если ОбластьОткрыта Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаМодуля = СтрокаМодуляИсходная;
			// Если строка начинается с "|", значит, это текст в кавычках, заменяем на кавычку.
			Если СтрНачинаетсяС(СтрокаМодуляСокрЛ, "|") Тогда
				ПозицияСимвола = СтрНайти(СтрокаМодуля, "|");
				СтрокаМодуля = апк_СтрЗаменить(СтрокаМодуля, """", ПозицияСимвола, ПозицияСимвола);
			КонецЕсли;
			
			СтрокаМодуля = СтрЗаменить(СтрокаМодуля, """""", "  ");
			ДлинаСтроки = СтрДлина(СтрокаМодуля);
			
			// Заменяем весь текст в кавычках на пробелы.
			Пока Истина Цикл
				
				ПозицияКавычекНачало = СтрНайти(СтрокаМодуля, """");
				Если ПозицияКавычекНачало = 0 Тогда
					Прервать;
				КонецЕсли;
				
				ПозицияКавычекКонец = 0;
				
				// Если кавычка не в конце строки, то ищем закрывающую.
				Если ПозицияКавычекНачало < ДлинаСтроки Тогда
					ПозицияКавычекКонец = СтрНайти(СтрокаМодуля, """",, ПозицияКавычекНачало + 1);
				КонецЕсли;
				
				Если ПозицияКавычекКонец = 0 Тогда
					// Если закрывающая кавычка не найдена, то берем конец строки.
					ПозицияКавычекКонец = ДлинаСтроки;
				КонецЕсли;
				
				// Заменяем на пробелы весь текст в кавычках.
				СтрокаМодуля = апк_СтрЗаменить(СтрокаМодуля, " ", ПозицияКавычекНачало, ПозицияКавычекКонец);
				
			КонецЦикла;
			
			// Ищем комментарий в строке после текста кода.
			ПозицияКомментария = СтрНайти(СтрокаМодуля, "//");
			Если ПозицияКомментария > 0 Тогда
				// Удаляем все до конца строки.
				СтрокаМодуля = апк_СтрЗаменить(СтрокаМодуля, " ", ПозицияКомментария, СтрДлина(СтрокаМодуля));
			КонецЕсли;
			
			Если ПустаяСтрока(СтрокаМодуля) ИЛИ СтрНайти(СтрокаМодуля, НайденноеСловоИсходное) = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаМодуля = СтрЗаменить(СтрокаМодуля, Символы.Таб, " ");
			СтрокаМодуля = СтрЗаменить(СтрокаМодуля, "(", " ");
			СтрокаМодуля = СтрЗаменить(СтрокаМодуля, ")", " ");
			СтрокаМодуля = СтрЗаменить(СтрокаМодуля, ";", " ");
			
		ИначеЕсли ПустаяСтрока(СтрокаМодуля) ИЛИ СтрНайти(СтрокаМодуля, НайденноеСловоИсходное) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭтоЗакомментированнаяСтрока Тогда
			Продолжить;
		КонецЕсли;
		
		// Добавляем пробелы в начале и конце, чтобы поиск сработал корректно (например, "Процедура" пишется сначала строки)
		// и совпадал номер символа в строках.
		СтрокаМодуля = СтрШаблон(" %1 ", СтрокаМодуля);
		СтрокаМодуляВРег = ВРег(СтрокаМодуля);
		СтрокаМодуляИсправленная = СтрШаблон(" %1 ", СтрокаМодуляИсходная);
		
		// Получаем слово для поиска.
		СловоДляПоиска = СтрШаблон(" %1 ", ВРег(НайденноеСловоИсходное));
		
		СтрокаТаблицы = ТаблицаКлючевыхСлов.Найти(СловоДляПоиска, "СловоДляПоиска");
		Если СтрокаТаблицы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаИзменена = Ложь;
		
		ДлинаЭталона = СтрокаТаблицы.ДлинаЭталона;
		Эталон       = СтрокаТаблицы.Эталон;
		
		// Ищем вхождение ключевого слова в строке модуля.
		ПозицияПоиска = 0;
		Пока Истина Цикл
			
			ПозицияПоиска = СтрНайти(СтрокаМодуляВРег, СловоДляПоиска,, ПозицияПоиска + 1);
			Если ПозицияПоиска = 0 Тогда
				Прервать;
			КонецЕсли;
			
			ПозицияСловаНачало = ПозицияПоиска + 1;
			ПозицияСловаКонец = ПозицияСловаНачало + ДлинаЭталона;
			
			НайденноеСлово = Сред(СтрокаМодуля, ПозицияСловаНачало, ДлинаЭталона);
			Если НайденноеСлово = Эталон Тогда
				Продолжить;
			КонецЕсли;
			
			// Меняем исходное ключевое слово на эталон.
			СтрокаДо = Лев(СтрокаМодуляИсправленная, ?(ЭтоНоваяПроверяемаяСтрока, ПозицияПоиска, ПозицияПоиска - 1));
			СтрокаПосле = Сред(СтрокаМодуляИсправленная, ?(ЭтоНоваяПроверяемаяСтрока, ПозицияСловаКонец, ПозицияСловаКонец - 1));
			
			СтрокаМодуляИсправленная = СтрокаДо + Эталон + СтрокаПосле;
			
			СтрокаИзменена = Истина;
			
		КонецЦикла;
		
		Если СтрокаИзменена Тогда
			// Удаляем пробелы в начале и конце.
			НачальныйСимвол = ?(ЭтоНоваяПроверяемаяСтрока, 2, 1);
			КоличествоСимволовСКонца = ?(ЭтоНоваяПроверяемаяСтрока, 2, 0);
			
			СтрокаМодуляИсправленная = Сред(СтрокаМодуляИсправленная, НачальныйСимвол,
				СтрДлина(СтрокаМодуляИсправленная) - КоличествоСимволовСКонца);
			
			ДокументТекст.ЗаменитьСтроку(НомерСтроки, СтрокаМодуляИсправленная);
			ФайлИзменен = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ФайлИзменен;
	
КонецФункции

Функция ПолучитьМассивКлючевыхСловЗапроса()
	
	// Набор операторов для поиска кода, написанного на языке запросов.
	ОператорыЗапроса = Новый Массив;
	
	ОператорыЗапроса.Добавить("ВЫБРАТЬ");
	ОператорыЗапроса.Добавить("СГРУППИРОВАТЬ");
	ОператорыЗапроса.Добавить("АВТОУПОРЯДОЧИВАНИЕ");
	ОператорыЗапроса.Добавить("ИТОГИ");
	ОператорыЗапроса.Добавить("УПОРЯДОЧИТЬ");
	ОператорыЗапроса.Добавить("ПОМЕСТИТЬ");
	ОператорыЗапроса.Добавить("ОБЪЕДИНИТЬ");
	
	ОператорыЗапроса.Добавить("SELECT");
	ОператорыЗапроса.Добавить("GROUP");
	ОператорыЗапроса.Добавить("AUTOORDER");
	ОператорыЗапроса.Добавить("TOTALS");
	ОператорыЗапроса.Добавить("ORDER");
	ОператорыЗапроса.Добавить("INTO");
	ОператорыЗапроса.Добавить("UNION");
	
	Возврат ОператорыЗапроса;
	
КонецФункции

Функция ПолучитьТаблицуЭталоновКлючевыхСловЗапроса()
	
	// Составляем набор эталонов.
	МассивЭталонов = Новый Массив;
	
	// На русском языке.
	МассивЭталонов.Добавить("ВЫБРАТЬ");
	МассивЭталонов.Добавить("ГДЕ");
	МассивЭталонов.Добавить("ИЗ");
	МассивЭталонов.Добавить("КАК");
	МассивЭталонов.Добавить("ПО");
	МассивЭталонов.Добавить("ОБЪЕДИНИТЬ");
	МассивЭталонов.Добавить("ВСЕ");
	МассивЭталонов.Добавить("ПОМЕСТИТЬ");
	МассивЭталонов.Добавить("АВТОУПОРЯДОЧИВАНИЕ");
	МассивЭталонов.Добавить("ИЕРАРХИЯ");
	МассивЭталонов.Добавить("ВЫБОР");
	МассивЭталонов.Добавить("ТОГДА");
	МассивЭталонов.Добавить("КОГДА");
	МассивЭталонов.Добавить("ЕСЛИ");
	МассивЭталонов.Добавить("КОНЕЦ");
	МассивЭталонов.Добавить("ИНАЧЕ");
	МассивЭталонов.Добавить("МЕЖДУ");
	МассивЭталонов.Добавить("В");
	МассивЭталонов.Добавить("ИЕРАРХИИ");
	МассивЭталонов.Добавить("ПОДОБНО");
	МассивЭталонов.Добавить("ИМЕЮЩИЕ");
	МассивЭталонов.Добавить("УПОРЯДОЧИТЬ");
	МассивЭталонов.Добавить("ИСТИНА");
	МассивЭталонов.Добавить("ЛОЖЬ");
	МассивЭталонов.Добавить("ПЕРВЫЕ");
	МассивЭталонов.Добавить("РАЗРЕШЕННЫЕ");
	МассивЭталонов.Добавить("ВЫРАЗИТЬ");
	МассивЭталонов.Добавить("ИТОГИ");
	МассивЭталонов.Добавить("ПОЛНОЕ");
	МассивЭталонов.Добавить("СОЕДИНЕНИЕ");
	МассивЭталонов.Добавить("ЛЕВОЕ");
	МассивЭталонов.Добавить("ПРАВОЕ");
	МассивЭталонов.Добавить("ВНУТРЕННЕЕ");
	МассивЭталонов.Добавить("РАЗЛИЧНЫЕ");
	МассивЭталонов.Добавить("УБЫВ");
	МассивЭталонов.Добавить("ВОЗР");
	МассивЭталонов.Добавить("СГРУППИРОВАТЬ");
	МассивЭталонов.Добавить("ОБЩИЕ");
	МассивЭталонов.Добавить("НЕ");
	МассивЭталонов.Добавить("И");
	МассивЭталонов.Добавить("ИЛИ");
	МассивЭталонов.Добавить("ЕСТЬ");
	МассивЭталонов.Добавить("NULL");
	МассивЭталонов.Добавить("ЕСТЬNULL");
	
	// На английском языке.
	МассивЭталонов.Добавить("SELECT");
	МассивЭталонов.Добавить("WHERE");
	МассивЭталонов.Добавить("FROM");
	МассивЭталонов.Добавить("AS");
	МассивЭталонов.Добавить("BY");
	МассивЭталонов.Добавить("UNION");
	МассивЭталонов.Добавить("ALL");
	МассивЭталонов.Добавить("INTO");
	МассивЭталонов.Добавить("AUTOORDER");
	МассивЭталонов.Добавить("HIERARCHY");
	МассивЭталонов.Добавить("CASE");
	МассивЭталонов.Добавить("THEN");
	МассивЭталонов.Добавить("WHEN");
	МассивЭталонов.Добавить("IF");
	МассивЭталонов.Добавить("END");
	МассивЭталонов.Добавить("ELSE");
	МассивЭталонов.Добавить("BETWEEN");
	МассивЭталонов.Добавить("IN");
	МассивЭталонов.Добавить("LIKE");
	МассивЭталонов.Добавить("HAVING");
	МассивЭталонов.Добавить("ORDER");
	МассивЭталонов.Добавить("TRUE");
	МассивЭталонов.Добавить("FALSE");
	МассивЭталонов.Добавить("TOP");
	МассивЭталонов.Добавить("ALLOWED");
	МассивЭталонов.Добавить("CAST");
	МассивЭталонов.Добавить("TOTALS");
	МассивЭталонов.Добавить("FULL");
	МассивЭталонов.Добавить("LOIN");
	МассивЭталонов.Добавить("LEFT");
	МассивЭталонов.Добавить("RIGHT");
	МассивЭталонов.Добавить("INNER");
	МассивЭталонов.Добавить("DISTINCT");
	МассивЭталонов.Добавить("DESC");
	МассивЭталонов.Добавить("ASC");
	МассивЭталонов.Добавить("GROUP");
	МассивЭталонов.Добавить("OVERALL");
	МассивЭталонов.Добавить("NOT");
	МассивЭталонов.Добавить("AND");
	МассивЭталонов.Добавить("OR");
	МассивЭталонов.Добавить("IS");
	МассивЭталонов.Добавить("NULL");
	МассивЭталонов.Добавить("ISNULL");
	
	ТаблицаКлючевыхСловЗапроса = Новый ТаблицаЗначений;
	ТаблицаКлючевыхСловЗапроса.Колонки.Добавить("Эталон");
	ТаблицаКлючевыхСловЗапроса.Колонки.Добавить("ДлинаЭталона");
	ТаблицаКлючевыхСловЗапроса.Колонки.Добавить("СловоДляПоиска");
	
	Для Каждого Эталон Из МассивЭталонов Цикл
		СтрокаТаблицы = ТаблицаКлючевыхСловЗапроса.Добавить();
		СтрокаТаблицы.Эталон = Эталон;
		СтрокаТаблицы.ДлинаЭталона = СтрДлина(Эталон);
		СтрокаТаблицы.СловоДляПоиска = " " + ВРег(Эталон) + " ";
	КонецЦикла;
	
	ТаблицаКлючевыхСловЗапроса.Индексы.Добавить("Эталон");
	
	Возврат ТаблицаКлючевыхСловЗапроса;
	
КонецФункции

Функция ПолучитьМассивИсключенийСловЗапроса()
	
	// Набор строк-исключений, точно не встречающихся в запросах.
	МассивИсключений = Новый Массив;
	МассивИсключений.Добавить("RU");
	МассивИсключений.Добавить("EN");
	
	Возврат МассивИсключений;
	
КонецФункции

Функция ПроверкаКаноническогоНаписанияКлючевыхСловЗапроса(ДокументТекст)
	
	// Получаем массив ключевых слов запроса, по которым определяем, что это текст запроса.
	МассивКлючевыхСловЗапроса = Контекст["МассивКлючевыхСловЗапроса"];
	
	// Получаем таблицу ключевых слов запроса, которые необходимо заменить.
	ТаблицаКлючевыхСловЗапроса = Контекст["ТаблицаКлючевыхСловЗапроса"];
	
	// Получаем массив слов, которые точно не встречаются в запросах.
	МассивИсключенийСловЗапроса = Контекст["МассивИсключенийСловЗапроса"];
	
	ТекстКавычки = """";
	ТекстДвойныеКавычки = ТекстКавычки + ТекстКавычки;
	ТекстДвойныеКавычкиЗамена = "~~"; // берем такие знаки, чтобы сохранить длину замены.
	
	ФайлИзменен = Ложь;
	
	ТекстМодуля = ДокументТекст.ПолучитьТекст();
	
	// Заменяем в тексте модуля двойные кавычки на символы замены.
	ТекстМодуля = СтрЗаменить(ТекстМодуля, ТекстДвойныеКавычки, ТекстДвойныеКавычкиЗамена);
	
	// Формируем регулярное выражение для поиска текстов запросов.
	СловаИсключенияСтрокой = СтрСоединить(МассивИсключенийСловЗапроса, "\b\b");
	КлючевыеСловЗапросаСтрокой = СтрСоединить(МассивКлючевыхСловЗапроса, "\b|\b");
	ВыражениеПоискаТекстаВКавычках = СтрШаблон("""[^"".)\b%1\b]*?(\b%2\b)+[^\b%1\b]*?""", СловаИсключенияСтрокой, КлючевыеСловЗапросаСтрокой);
	РезультатПоискаТекстаВКавычках = СтрНайтиВсеПоРегулярномуВыражению(ТекстМодуля, ВыражениеПоискаТекстаВКавычках, Истина, Истина);
	
	Для Каждого РезультатПоиска Из РезультатПоискаТекстаВКавычках Цикл
		
		СтрокаМеждуКавычками = РезультатПоиска.Значение;
		
		СтрокаМеждуКавычкамиБезПереносовСтрок = СтрЗаменить(СтрокаМеждуКавычками, Символы.ПС, " ");
		СтрокаМеждуКавычкамиБезПереносовСтрок = СокрЛП(СтрокаМеждуКавычкамиБезПереносовСтрок);
		
		// Если в строке нет пробелов, это идентификатор, пропускаем.
		Если СтрНайти(СтрокаМеждуКавычкамиБезПереносовСтрок, " ") = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПозицияНачало = РезультатПоиска.НачальнаяПозиция;
		ПозицияКонец  = ПозицияНачало + СтрДлина(СтрокаМеждуКавычками);
		
		// Определяем номера первой и последней строк запроса для построчного обхода.
		НомерСтрокиМодуляНачало = ПолучитьНомерСтрокиМодуля(ТекстМодуля, ПозицияНачало);
		НомерСтрокиМодуляКонец  = ПолучитьНомерСтрокиМодуля(ТекстМодуля, ПозицияКонец);
		
		СтрокаМодуляИзмененная = "";
		
		Для НомерСтрокиМодуля = НомерСтрокиМодуляНачало По НомерСтрокиМодуляКонец Цикл
			
			СтрокаМодуляИсходная = ДокументТекст.ПолучитьСтроку(НомерСтрокиМодуля);
			Если СтрНачинаетсяС(СокрЛ(СтрокаМодуляИсходная), "//") Тогда
				// Пропускаем закомментированные строки.
				Продолжить;
			КонецЕсли;
			
			СтрокаМодуля = СтрокаМодуляИсходная;
			Если НомерСтрокиМодуля = НомерСтрокиМодуляНачало
			 ИЛИ НомерСтрокиМодуля = НомерСтрокиМодуляКонец Тогда
				// Заменяем на пробелы, чтобы не проверять лишнее:
				// в первой строке - все символы до первой кавычки;
				// в последней строке - все символы после последней кавычки.
				ЭтоПерваяСтрока = (НомерСтрокиМодуля = НомерСтрокиМодуляНачало);
				НаправлениеПоискаКавычек = ?(ЭтоПерваяСтрока, НаправлениеПоиска.СНачала, НаправлениеПоиска.СКонца);
				
				ПозицияКавычек = СтрНайти(СтрокаМодуля, ТекстКавычки, НаправлениеПоискаКавычек);
				
				Если ЭтоПерваяСтрока Тогда
					СтрокаМодуля = апк_СтрЗаменить(СтрокаМодуля, " ", 1, ПозицияКавычек - 1);
				Иначе
					СтрокаМодуля = апк_СтрЗаменить(СтрокаМодуля, " ", ПозицияКавычек, СтрДлина(СтрокаМодуля));
				КонецЕсли;
				
			КонецЕсли;
			
			// Очищаем строку для дальнейшего поиска ключевых слов запроса.
			СтрокаМодуля = СтрЗаменить(СтрокаМодуля, Символы.Таб, " ");
			СтрокаМодуля = СтрЗаменить(СтрокаМодуля, ТекстКавычки, " ");
			СтрокаМодуля = СтрЗаменить(СтрокаМодуля, "|", " ");
			СтрокаМодуля = СтрЗаменить(СтрокаМодуля, "(", " ");
			СтрокаМодуля = СтрЗаменить(СтрокаМодуля, ")", " ");
			СтрокаМодуля = СтрЗаменить(СтрокаМодуля, "{", " ");
			СтрокаМодуля = СтрЗаменить(СтрокаМодуля, "}", " ");
			СтрокаМодуля = ВРег(СтрокаМодуля);
			СтрокаМодуля = СтрШаблон(" %1 ", СтрокаМодуля);
			
			СтрокаИзменена = Ложь;
			
			// Проверяем правильное написание каждого ключевого слова запроса.
			Для Каждого СтрокаТаблицы Из ТаблицаКлючевыхСловЗапроса Цикл
				
				Эталон         = СтрокаТаблицы.Эталон;
				ДлинаЭталона   = СтрокаТаблицы.ДлинаЭталона;
				СловоДляПоиска = СтрокаТаблицы.СловоДляПоиска;
				
				// Ищем вхождение ключевого слова запроса в строке модуля.
				ПозицияПоиска = 0;
				Пока Истина Цикл
					
					ПозицияПоиска = СтрНайти(СтрокаМодуля, СловоДляПоиска,, ПозицияПоиска + 1);
					Если ПозицияПоиска = 0 Тогда
						Прервать;
					КонецЕсли;
					
					// Определяем написание из исходной строки.
					КлючевоеСловоИсходное = Сред(СтрокаМодуляИсходная, ПозицияПоиска, ДлинаЭталона);
					
					// Сравниваем исходное ключевое слово запроса с эталоном.
					Если Эталон = СокрЛП(КлючевоеСловоИсходное) Тогда
						Продолжить;
					КонецЕсли;
					
					// Найденное слово отличается от эталона - меняем исходное ключевое слово запроса на эталон.
					СтрокаДо = Лев(СтрокаМодуляИсходная, ПозицияПоиска - 1);
					СтрокаПосле = Сред(СтрокаМодуляИсходная, ПозицияПоиска + ДлинаЭталона);
					
					СтрокаМодуляИзмененная = СтрокаДо + Эталон + СтрокаПосле;
					
					СтрокаИзменена = Истина;
					
				КонецЦикла;
				
			КонецЦикла;
			
			Если СтрокаИзменена Тогда
				// Удаляем пробелы в начале и конце.
				СтрокаМодуляБуфер = Сред(СтрокаМодуляБуфер, 2, СтрДлина(СтрокаМодуляБуфер) - 2);
				ДокументТекст.ЗаменитьСтроку(НомерСтрокиМодуля, СтрокаМодуляИзмененная);
				ФайлИзменен = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
		
	Возврат ФайлИзменен;
	
КонецФункции

Функция ПроверкаФорматаКомментария(ДокументТекст)
	
	ФайлИзменен = Ложь;
	
	МассивСтрокИсключений = Новый Массив;
	МассивСтрокИсключений.Добавить("_Демо начало примера");
	МассивСтрокИсключений.Добавить("_Demo Example Start");
	МассивСтрокИсключений.Добавить("_Демо конец примера");
	МассивСтрокИсключений.Добавить("_Demo Example End");
	
	// Служебные теги не обрабатываем, только добавляем в начало пробел, если его нет.
	МассивСлужебныхТегов = Контекст["МассивСлужебныхТегов"];
	
	КоличествоСтрок = ДокументТекст.КоличествоСтрок();
	
	МногострочныйКомментарий = "";
	НомерСтрокиНачалаКомментария = 0;
	НадоПроверитьКомментарий = Ложь;
	
	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		
		Если НадоПроверитьКомментарий Тогда
			
			НадоПроверитьКомментарий = Ложь;
			
			// Комментарий кончился, проверяем накопленный многострочный комментарий.
			Если НЕ ПустаяСтрока(МногострочныйКомментарий) Тогда
				
				МногострочныйКомментарий = СокрЛП(МногострочныйКомментарий);
				
				// Определяем, является ли комментарий длинным, по критериям:
				//   однострочный комментарий - длинный, если его длина больше 80 символов;
				//   многострочный комментарий - длинный, если хотя бы 1 его строка длиннее 30-ти символов.
				КоличествоСтрокКомментария = СтрЧислоСтрок(МногострочныйКомментарий);
				Если КоличествоСтрокКомментария = 1 Тогда
					ЭтоДлинныйКомментарий = СтрДлина(МногострочныйКомментарий) > 80;
				Иначе
					ЭтоДлинныйКомментарий = Ложь;
					Для Счетчик = 1 По КоличествоСтрокКомментария Цикл
						СтрокаМногострочногоКомментария = СтрПолучитьСтроку(МногострочныйКомментарий, Счетчик);
						Если СтрДлина(СтрокаМногострочногоКомментария) > 30 Тогда
							ЭтоДлинныйКомментарий = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				Если ЗначениеФлагов.ДлинныеКомментарииСБольшойБуквы И ЭтоДлинныйКомментарий Тогда
					
					// Длинный комментарий должен начинаться с большой буквы.
					ПервыйСимвол = Лев(МногострочныйКомментарий, 1);
					Если ВРег(ПервыйСимвол) <> ПервыйСимвол Тогда
						// Проверим, что комментарий не начался в предыдущей строке.
						ПредыдущаяСтрока = ДокументТекст.ПолучитьСтроку(НомерСтрокиНачалаКомментария - 1);
						ПредыдущаяСтрока = СокрЛ(ПредыдущаяСтрока);
						
						Если СтрНайти(ПредыдущаяСтрока, "//") = 0 Тогда
							
							ИсходнаяСтрока = ДокументТекст.ПолучитьСтроку(НомерСтрокиНачалаКомментария);
							ПозицияКомментария = СтрНайти(ИсходнаяСтрока, "//");
							Если ПозицияКомментария > 0 Тогда
								
								НоваяСтрока = ИсходнаяСтрока;
								
								ДлинаСтроки = СтрДлина(ИсходнаяСтрока);
								Для Счетчик = 1 По ДлинаСтроки Цикл
									Символ = Сред(ИсходнаяСтрока, Счетчик, 1);
									Если Символ <> ВРег(Символ) Тогда
										НоваяСтрока = Лев(ИсходнаяСтрока, Счетчик - 1);
										НоваяСтрока = НоваяСтрока + ВРег(Символ);
										НоваяСтрока = НоваяСтрока + Сред(ИсходнаяСтрока, Счетчик + 1);
										Прервать;
									КонецЕсли;
								КонецЦикла;
								
								ДокументТекст.ЗаменитьСтроку(НомерСтрокиНачалаКомментария, НоваяСтрока);
								
								ФайлИзменен = Истина;
								
							КонецЕсли;
							
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
				МногострочныйКомментарий = "";
				
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаМодуляИсходная = ДокументТекст.ПолучитьСтроку(НомерСтроки);
		Если ПустаяСтрока(СтрокаМодуляИсходная) Тогда
			НадоПроверитьКомментарий = Истина;
			Продолжить;
		КонецЕсли;
		
		СтрокаМодуляИсходная = СокрЛП(СтрокаМодуляИсходная);
		
		// Если это не комментарий, тогда пропускаем.
		Если НЕ СтрНачинаетсяС(СтрокаМодуляИсходная, "//") Тогда
			НадоПроверитьКомментарий = Истина;
			Продолжить;
		КонецЕсли;
		
		// Проверяем наличие комментариев-аннотаций, начинающихся с "//@".
		Если СтрНачинаетсяС(СтрокаМодуляИсходная, "//@") Тогда
			// Для них пробелы не нужны, пропускаем.
			НадоПроверитьКомментарий = Истина;
			Продолжить;
		КонецЕсли;
		
		Строка = СтрокаМодуляИсходная;
		
		// Если после удаления символов "//" строка пустая, то пропускаем.
		Строка = СтрЗаменить(Строка, "/", "");
		Если ПустаяСтрока(Строка) Тогда
			НадоПроверитьКомментарий = Истина;
			Продолжить;
		КонецЕсли;
		
		СтрокаСокрЛ = СокрЛ(Строка);
		
		ЭтоСлужебныйТег = Ложь;
		Для Каждого СлужебныйТег Из МассивСлужебныхТегов Цикл
			Если СтрНачинаетсяС(СтрокаСокрЛ, СлужебныйТег) Тогда
				ЭтоСлужебныйТег = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЭтоСлужебныйТег Тогда
			// Добавляем пробел, если его нет, и пропускаем.
			Если СтрокаСокрЛ = Строка Тогда
				Если ЗначениеФлагов.ПробелВНачалеКомментариев Тогда
					ДобавитьПробелПослеЗнакаКомментария(ДокументТекст, НомерСтроки);
					ФайлИзменен = Истина;
				КонецЕсли;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		// Если строка состоит только из символов верхнего регистра, то это, например, объявление области, пропускаем.
		Если ВРег(Строка) = Строка Тогда
			// Пропускаем, если до этого комментарий пустой.
			// Возможно, перечисление параметров, тогда пропускать не нужно.
			Если ПустаяСтрока(МногострочныйКомментарий) Тогда
				Продолжить;
			КонецЕсли;
			
			// Проверим следующую строку.
			СледующаяСтрока = ДокументТекст.ПолучитьСтроку(НомерСтроки + 1);
			СледующаяСтрока = СтрЗаменить(СледующаяСтрока, "/", "");
			Если ПустаяСтрока(СледующаяСтрока) Тогда
				МногострочныйКомментарий = "";
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ЭтоИсключение = ЭтоКод(Строка);
		
		// Проверяем пробел (таб) в начале строки.
		Если СтрокаСокрЛ = Строка Тогда
			// Закомментированный код проверять не нужно.
			Если НЕ ЭтоИсключение Тогда
				Если ЗначениеФлагов.ПробелВНачалеКомментариев Тогда
					ДобавитьПробелПослеЗнакаКомментария(ДокументТекст, НомерСтроки);
					ФайлИзменен = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		НадоПроверитьКомментарий = Ложь;
		
		// Отдельно проверяем описание области.
		Если НЕ ЭтоИсключение Тогда
			ЭтоИсключение = СтрокаСодержитОписаниеОбласти(СокрЛП(Строка));
		КонецЕсли;
		
		// Проверяем исключения из массива.
		Если НЕ ЭтоИсключение Тогда
			Если СтрНайтиПоМассиву(Строка, МассивСтрокИсключений,, Истина).Успешно Тогда
				ЭтоИсключение = Истина;
			КонецЕсли;
		КонецЕсли;
		
		// Для комментариев вида:
		// Обработка входящих сообщений с типом {http://www.1c.ru/1cFresh/ApplicationExtensions/Management/a.b.c.d}InstallExtension
		// Делаем исключение по вхождению в комментарий гиперссылки "http://www.".
		// Если до конца строки пробелов нет, это исключение.
		Если НЕ ЭтоИсключение Тогда
			ПозицияГиперссылки = СтрНайти(СтрокаМодуляИсходная, "http://www.");
			Если ПозицияГиперссылки > 0 Тогда
				СтрокаГиперссылки = Сред(СтрокаМодуляИсходная, ПозицияГиперссылки);
				ЭтоИсключение = (СтрНайти(СтрокаГиперссылки, " ") = 0);
			КонецЕсли;
		КонецЕсли;
		
		// Если это исключение, проверяем следующую строку.
		Если ЭтоИсключение Тогда
			СледующаяСтрока = ДокументТекст.ПолучитьСтроку(НомерСтроки + 1);
			
			// Если следующая строка не содержит комментарий, то пропускаем.
			СледующаяСтрока = СокрЛ(СледующаяСтрока);
			Если НЕ СтрНачинаетсяС(СледующаяСтрока, "//") Тогда
				МногострочныйКомментарий = "";
				Продолжить;
			КонецЕсли;
			
			// Если следующая строка пустая, то пропускаем.
			СледующаяСтрока = СтрЗаменить(СледующаяСтрока, "/", "");
			Если ПустаяСтрока(СледующаяСтрока) Тогда
				МногострочныйКомментарий = "";
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если ПустаяСтрока(МногострочныйКомментарий) Тогда
			НомерСтрокиНачалаКомментария = НомерСтроки;
		КонецЕсли;
		
		МногострочныйКомментарий = МногострочныйКомментарий + Строка + Символы.ПС;
		
	КонецЦикла;
	
	Возврат ФайлИзменен;
	
КонецФункции

Функция ПолучитьОтступПослеЗнакаКомментария(Знач СтрокаМодуля, УчитыватьНезначимыеСимволы = Истина)
	
	СтрокаМодуля = СокрЛ(СтрокаМодуля);
	
	Если НЕ СтрНачинаетсяС(СтрокаМодуля, "//") Тогда
		Возврат "";
	КонецЕсли;
	
	СтрокаМодуля = СтрЗаменить(СтрокаМодуля, "/", "");
	
	Если ПустаяСтрока(СтрокаМодуля) Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ УчитыватьНезначимыеСимволы Тогда
		СтрокаНезначимыхСимволов = "*,-";
		МассивНезначимыхСимволов = СтрРазделить(СтрокаНезначимыхСимволов, ",");
		Для Каждого НезначимыйСимвол Из МассивНезначимыхСимволов Цикл
			СтрокаМодуля = СтрЗаменить(СтрокаМодуля, НезначимыйСимвол, " ");
		КонецЦикла;
	КонецЕсли;
	
	СтрокаМодуляСокрЛ = СокрЛ(СтрокаМодуля);
	ДлинаОтступа = СтрДлина(СтрокаМодуля) - СтрДлина(СтрокаМодуляСокрЛ);
	
	Отступ = Сред(СтрокаМодуля, 1, ДлинаОтступа);
	
	Возврат Отступ;
	
КонецФункции

Функция ПолучитьОтступДоЗнакаКомментария(Знач СтрокаМодуля)
	
	ПозицияКомментария = СтрНайти(СтрокаМодуля, "//");
	ОтступДоЗнакаКомментария = Лев(СтрокаМодуля, ПозицияКомментария - 1);
	
	Возврат ОтступДоЗнакаКомментария;
	
КонецФункции

// Объединяет комментарий текущей строки с комментарием следующей строки.
// Если результирующий комментарий меньше 120 символов,
// то заменяет текущую строку в документе новой получившейся строкой и удаляет следующую строку из документа.
//
Процедура ОбъединитьКомментарииСтрок(ДокументТекст, НомерСтроки)
	
	СледующаяСтрока = ДокументТекст.ПолучитьСтроку(НомерСтроки + 1);
	
	// В следующей строке нет комментария, не объединяем.
	Если СтрНайти(СледующаяСтрока, "//") = 0 Тогда
		
		СледующаяСтрока = СокрЛП(СледующаяСтрока);
		Если ПустаяСтрока(СледующаяСтрока) Тогда
			
			СтрокаПослеСледующейСтроки =  ДокументТекст.ПолучитьСтроку(НомерСтроки + 2);
			МассивТекстПроцедураФункция = Контекст["МассивТекстПроцедураФункция"];
			
			РезультатПроверки = СтрНачинаетсяСПоМассиву(ВРег(СтрокаПослеСледующейСтроки), МассивТекстПроцедураФункция);
			Если РезультатПроверки.Успешно Тогда
				НайденныйЭлемент = РезультатПроверки.НайденныйЭлемент;
				СледующийСимвол = Сред(СтрокаПослеСледующейСтроки, СтрДлина(НайденныйЭлемент) + 1, 1);
				Если апк_СловоСодержитЗначимыеСимволы(СледующийСимвол) Тогда
					Возврат;
				КонецЕсли;
				ДокументТекст.ЗаменитьСтроку(НомерСтроки + 1, "//");
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	// Пустые комментарии не переносим.
	Если СокрЛП(СледующаяСтрока) = "//" Тогда
		Возврат;
	КонецЕсли;
	
	// Комментарий в следующей строке расположен после кода, не объединяем.
	СледующаяСтрокаОтступДоКомментария = ПолучитьОтступДоЗнакаКомментария(СледующаяСтрока);
	Если НЕ ПустаяСтрока(СледующаяСтрокаОтступДоКомментария) Тогда
		Возврат;
	КонецЕсли;
	
	СледующаяСтрокаОтступПослеКомментария = ПолучитьОтступПослеЗнакаКомментария(СледующаяСтрока);
	СледующаяСтрокаОтступПослеКомментария = СтрЗаменить(СледующаяСтрокаОтступПослеКомментария, Символы.Таб, "  ");
	
	ТекущаяСтрока = ДокументТекст.ПолучитьСтроку(НомерСтроки);
	ТекущаяСтрокаОтступПослеКомментария = ПолучитьОтступПослеЗнакаКомментария(ТекущаяСтрока);
	
	// Если отступ после знака комментария в следующей строке меньше, чем в текущей, не объединяем.
	Если СтрДлина(СледующаяСтрокаОтступПослеКомментария) < СтрДлина(ТекущаяСтрокаОтступПослеКомментария) Тогда
		Возврат;
	КонецЕсли;
	
	КомментарийСледующейСтроки = ПолучитьКомментарийИзСтроки(СледующаяСтрока, Истина);
	КомментарийСледующейСтроки = СокрЛП(КомментарийСледующейСтроки);
	
	// Если следующая строка содержит описание параметра, не объединяем.
	Если КомментарийСодержитОписаниеПараметра(КомментарийСледующейСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	МассивСлужебныхТегов = Контекст["МассивСлужебныхТегов"];
	
	// Если следующая строка является служебным тегом (// ++ УТКА), то не объединяем.
	Для Каждого СлужебныйТег Из МассивСлужебныхТегов Цикл
		Если СтрНачинаетсяС(КомментарийСледующейСтроки, СлужебныйТег) Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	НоваяСтрока = СокрП(ТекущаяСтрока) + " " + КомментарийСледующейСтроки;
	
	ДокументТекст.ЗаменитьСтроку(НомерСтроки, НоваяСтрока);
	ДокументТекст.УдалитьСтроку(НомерСтроки + 1);
	
КонецПроцедуры

Процедура ДобавитьПробелПослеЗнакаКомментария(ДокументТекст, НомерСтроки)
	
	ИсходнаяСтрока = ДокументТекст.ПолучитьСтроку(НомерСтроки);
	ПозицияКомментария = СтрНайти(ИсходнаяСтрока, "//");
	Если ПозицияКомментария = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаПослеКомментария = Сред(ИсходнаяСтрока, ПозицияКомментария + 2);
	НоваяСтрока = Лев(ИсходнаяСтрока, ПозицияКомментария - 1) + "// " + СтрокаПослеКомментария;
	ДокументТекст.ЗаменитьСтроку(НомерСтроки, НоваяСтрока);
	
КонецПроцедуры

Функция КомментарийСодержитОписаниеПараметра(Знач Комментарий)
	
	Комментарий = ВРег(Комментарий);
	Комментарий = СтрЗаменить(Комментарий, Символы.Таб, " ");
	
	// Иногда в параметре указывают его обязательность, удалим этот текст из комментария.
	Комментарий = СтрЗаменить(Комментарий, ВРег("(обязательный)"), "");
	Комментарий = СтрЗаменить(Комментарий, ВРег("(необязательный)"), "");
	Комментарий = СтрЗаменить(Комментарий, ВРег("(mandatory)"), "");
	Комментарий = СтрЗаменить(Комментарий, ВРег("(optional)"), "");
	
	РазделительЭлементовОписанияПараметра = " - ";
	ДлинаРазделителяЭлементовОписанияПараметра = СтрДлина(РазделительЭлементовОписанияПараметра);
	
	// Иногда параметр начинается с тире, поэтому в цикле.
	Пока Истина Цикл
		
		ПозицияТире = СтрНайти(Комментарий, РазделительЭлементовОписанияПараметра);
		Если ПозицияТире = 0 Тогда
			// Иногда тип параметра указывают в скобках после имени параметра, поэтому дополнительно ищем скобку.
			ПозицияСкобки = СтрНайти(Комментарий, "(");
			Если ПозицияСкобки = 0 Тогда
				Возврат Ложь;
			Иначе
				ПозицияТире = ПозицияСкобки - 1;
			КонецЕсли;
		КонецЕсли;
		
		// Выделяем наименование параметра до тире.
		Параметр = Лев(Комментарий, ПозицияТире);
		Параметр = СтрЗаменить(Параметр, "/", "");
		// Иногда параметр начинается со звездочки, удаляем.
		Параметр = СтрЗаменить(Параметр, "*", "");
		// Иногда параметр начинается с тире, удаляем.
		Параметр = СтрЗаменить(Параметр, "-", "");
		
		// Если до тире пустая строка, ищем следующее тире.
		Если ПустаяСтрока(Параметр) Тогда
			Комментарий = Сред(Комментарий, ПозицияТире + ДлинаРазделителяЭлементовОписанияПараметра);
			Продолжить;
		КонецЕсли;
		
		// В строке может быть описание типов параметра, тогда считаем, что это тоже описание параметра.
		ПараметрСодержитПробел = Ложь;
		
		// Типы разделены через запятую, проверяем каждый элемент отдельно.
		МассивЭлементовПараметра = СтрРазделить(Параметр, ",");
		Для Каждого ЭлементПараметра Из МассивЭлементовПараметра Цикл
			ЭлементПараметра = СокрЛП(ЭлементПараметра);
			Если СтрНайти(ЭлементПараметра, " ") > 0 Тогда
				ПараметрСодержитПробел = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		// Если в параметре есть пробелы, то это не параметр.
		Возврат НЕ ПараметрСодержитПробел;
		
	КонецЦикла;
	
КонецФункции

Функция ПолучитьМассивСлужебныхТегов()
	
	// Примеры служебных тегов:
	// ++ УТКА
	// -- НЕ УТ
	МассивСлужебныхТегов = Новый Массив;
	МассивСлужебныхТегов.Добавить("--");
	МассивСлужебныхТегов.Добавить("++");
	
	Возврат МассивСлужебныхТегов;
	
КонецФункции

Функция ПроверкаКомментариевНаДопустимуюДлину(ДокументТекст)
	
	ФайлИзменен = Ложь;
	НомерСтроки = 0;
	
	КоличествоСимволовДляПереносаКомментария     = Контекст["КоличествоСимволовДляПереносаКомментария"];
	МассивТекстОкончанияСекцииОписанияПараметров = Контекст["МассивТекстОкончанияСекцииОписанияПараметров"];
	МассивТекстПроцедураФункция                  = Контекст["МассивТекстПроцедураФункция"];
	
	ЭтоСекцияПример = Ложь;
	
	Пока НомерСтроки < ДокументТекст.КоличествоСтрок() Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		СтрокаМодуляИсходная = ДокументТекст.ПолучитьСтроку(НомерСтроки);
		Если ПустаяСтрока(СтрокаМодуляИсходная) Тогда
			ЭтоСекцияПример = Ложь;
			Продолжить;
		КонецЕсли;
		
		СтрокаМодуля = СокрП(СтрокаМодуляИсходная);
		
		СтрокаМодуляБуфер = ВРег(СтрокаМодуля);
		СтрокаМодуляБуфер = СтрЗаменить(СтрокаМодуляБуфер, Символы.Таб, "");
		СтрокаМодуляБуфер = СтрЗаменить(СтрокаМодуляБуфер, " ", "");
		
		// Пропускаем строки, не содержащие комментарий.
		Если НЕ СтрНачинаетсяС(СтрокаМодуляБуфер, "//") Тогда
			ЭтоСекцияПример = Ложь;
			Продолжить;
		КонецЕсли;
		
		РезультатПроверкиСекцииПример = СтрНачинаетсяСПоМассиву(СтрокаМодуляБуфер, МассивТекстОкончанияСекцииОписанияПараметров);
		Если РезультатПроверкиСекцииПример.Успешно Тогда
			// Считаем, что секция пример до конца комментария.
			// Секцией "Пример" считаем любое начало кроме аннотаций-комментариев "@skip-warning".
			ЭтоСекцияПример = (РезультатПроверкиСекцииПример.НайденныйЭлемент <> "//@");
			Продолжить;
		КонецЕсли;
		
		// Секция "Пример" не форматируется.
		Если ЭтоСекцияПример Тогда
			Продолжить;
		КонецЕсли;
		
		// Строки с пустым комментарием не обрабатываем.
		СтрокаМодуляБуфер = СтрЗаменить(СтрокаМодуляБуфер, "/", "");
		Если ПустаяСтрока(СтрокаМодуляБуфер) Тогда
			Продолжить;
		КонецЕсли;
		
		// Пропускаем строки менее 120 символов.
		ДлинаСтроки = СтрДлина(СтрокаМодуля);
		Если ДлинаСтроки <= КоличествоСимволовДляПереносаКомментария Тогда
			Продолжить;
		КонецЕсли;
		
		Комментарий = ПолучитьКомментарийИзСтроки(СтрокаМодуля, Ложь);
		Комментарий = СокрП(Комментарий);
		
		// Пропускаем строки, содержащие таб.
		Если СтрНайти(Комментарий, Символы.Таб) > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Пропускаем строки с гиперссылками.
		Если СтрНайти(Комментарий, "{http://") > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Пропускаем комментарии, не содержащие ни одного пробела после 120 символов.
		Если СтрНайти(Сред(Комментарий, 121), " ") = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Получаем номер первого символа отличного от "/".
		КомментарийСокрЛ = СокрЛ(Комментарий);
		ДлинаКомментарияСокрЛ = СтрДлина(КомментарийСокрЛ);
		Для НомерСимвола = 3 По ДлинаКомментарияСокрЛ + 1 Цикл
			Символ = Сред(КомментарийСокрЛ, НомерСимвола, 1);
			Если Символ <> "/" Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		// Получаем комментарий без первых знаков комментария.
		КомментарийБезЗнаковКомментария = Сред(КомментарийСокрЛ, НомерСимвола);
		КомментарийБезЗнаковКомментария = СокрЛ(КомментарийБезЗнаковКомментария);
		
		// Если комментарий начинается со слов "процедура" или "функция" и содержит скобку "(",
		// то считаем его кодом, пропускаем.
		Если (СтрНайти(КомментарийБезЗнаковКомментария, "(") > 0) Тогда
			НайденныйЭлемент = СтрНайтиПоМассиву(КомментарийБезЗнаковКомментария, МассивТекстПроцедураФункция).НайденныйЭлемент;
			Если НЕ ПустаяСтрока(НайденныйЭлемент) Тогда
				Если ВРег(Лев(КомментарийБезЗнаковКомментария, СтрДлина(НайденныйЭлемент))) = НайденныйЭлемент Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Получим отступ до знака комментария.
		ОтступДоЗнакаКомментария = ПолучитьОтступДоЗнакаКомментария(СтрокаМодуля);
		
		// Если отступ до знака комментария не пустой (комментарий написан в строке кода),
		// то такие строки пропускаем, т.к. не понятно, как делать перенос.
		Если НЕ ПустаяСтрока(ОтступДоЗнакаКомментария) Тогда
			Продолжить;
		КонецЕсли;
		
		// Получим отступ после знака комментария.
		ОтступПослеЗнакаКомментария = ПолучитьОтступПослеЗнакаКомментария(Комментарий);
		
		// Если отступ после знака комментария отсутствует, и строка заканчивается на ";", считаем, что это код.
		Если (ОтступПослеЗнакаКомментария = "") И (Прав(СтрокаМодуля, 1) = ";") Тогда
			Продолжить;
		КонецЕсли;
		
		ДлинаОтступаПослеЗнакаКомментария = СтрДлина(ОтступПослеЗнакаКомментария);
		
		// Получим, что необходимо оставить в той же строке, а что перенести.
		НомерСимволаДляПереноса = 0;
		
		// 121-м символом может быть пробел, тогда на нем и надо перенести.
		Для НомерСимволаСКонца = 1 По КоличествоСимволовДляПереносаКомментария + 1 Цикл
			
			НомерСимвола = КоличествоСимволовДляПереносаКомментария + 1 - НомерСимволаСКонца + 1;
			
			Символ = Сред(СтрокаМодуля, НомерСимвола, 1);
			Если Символ <> " " Тогда
				Продолжить;
			КонецЕсли;
			
			// Проверяем следующий символ, если это тире или равно, то ищем дальше.
			СледующийСимвол = Сред(СтрокаМодуля, НомерСимвола + 1, 1);
			Если (СледующийСимвол = "-") ИЛИ (СледующийСимвол = "=") Тогда
				Продолжить;
			КонецЕсли;
			
			НомерСимволаДляПереноса = НомерСимвола;
			Прервать;
			
		КонецЦикла;
		
		ТекущаяСтрока = СокрП(Лев(СтрокаМодуля, НомерСимволаДляПереноса - 1));
		ПереносимаяСтрока = СокрЛ(Сред(СтрокаМодуля, НомерСимволаДляПереноса + 1));
		
		// Если не получается перенести строку по 120 символов,
		// т.е. в оставшейся строке (без переносимой) нет значимых символов, то пропускаем.
		Если ПустаяСтрока(СтрЗаменить(ТекущаяСтрока, "/", "")) Тогда
			Продолжить;
		КонецЕсли;
		
		// Если в текущей строке нет определения параметра, то следующую строку сдвигаем с тем же отступом.
		Если НЕ КомментарийСодержитОписаниеПараметра(КомментарийБезЗнаковКомментария) Тогда
			
			НовыйОтступ = ОтступДоЗнакаКомментария + "//" + ОтступПослеЗнакаКомментария;
			НоваяСтрока = НовыйОтступ + ПереносимаяСтрока;
			
			ДокументТекст.ЗаменитьСтроку(НомерСтроки, ТекущаяСтрока);
			ДокументТекст.ВставитьСтроку(НомерСтроки + 1, НоваяСтрока);
			
			ОбъединитьКомментарииСтрок(ДокументТекст, НомерСтроки + 1);
			
			ФайлИзменен = Истина;
			
			Продолжить;
			
		КонецЕсли;
		
		// Если в текущей строке есть описание параметра, проверим отступ в следующей строке.
		СледующаяСтрока = ДокументТекст.ПолучитьСтроку(НомерСтроки + 1);
		
		// Если в следующей строке нет табов, то проверяем ее отступ.
		Если СтрНайти(СледующаяСтрока, Символы.Таб) = 0 Тогда
			
			ОтступКомментарияСледующейСтроки = ПолучитьОтступПослеЗнакаКомментария(СледующаяСтрока);
			ДлинаОтступаКомментарияСледующейСтроки = СтрДлина(ОтступКомментарияСледующейСтроки);
			
			// Если в следующей строке после определения параметра есть большой отступ,
			Если ДлинаОтступаКомментарияСледующейСтроки > ДлинаОтступаПослеЗнакаКомментария Тогда
				// тогда сдвигаем новую строку на этот отступ.
				НовыйОтступ = ОтступДоЗнакаКомментария + "//" + ОтступКомментарияСледующейСтроки;
				НоваяСтрока = НовыйОтступ + ПереносимаяСтрока;
				
				ДокументТекст.ЗаменитьСтроку(НомерСтроки, ТекущаяСтрока);
				ДокументТекст.ВставитьСтроку(НомерСтроки + 1, НоваяСтрока);
				
				ОбъединитьКомментарииСтрок(ДокументТекст, НомерСтроки + 1);
				
				ФайлИзменен = Истина;
				
				Продолжить;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Если в следующей строке отступ такой же или меньше, то определяем новый отступ.
		// Для этого определяем, сколько тире в текущей строке, которая уже меньше 120 символов.
		КоличествоТире = СтрЧислоВхождений(ТекущаяСтрока, " - ");
		Если КоличествоТире = 0 Тогда
			// Если тире нет, то переносим с таким отступом + 4 пробела.
			НовыйОтступ = ОтступДоЗнакаКомментария + "//" + ОтступПослеЗнакаКомментария + "    ";
			НоваяСтрока = НовыйОтступ + ПереносимаяСтрока;
			
			ДокументТекст.ЗаменитьСтроку(НомерСтроки, ТекущаяСтрока);
			ДокументТекст.ВставитьСтроку(НомерСтроки + 1, НоваяСтрока);
			
			ОбъединитьКомментарииСтрок(ДокументТекст, НомерСтроки + 1);
			
			ФайлИзменен = Истина;
			
			Продолжить;
			
		КонецЕсли;
		
		// Тире есть, определяем позицию тире:
		// если тире одно, то его позицию; если их больше, то позицию второго тире.
		Если КоличествоТире = 1 Тогда
			ПозицияТире = СтрНайти(ТекущаяСтрока, " - ");
		Иначе
			ПозицияТире = СтрНайти(ТекущаяСтрока, " - ");
			ТекущаяСтрокаВтороеТире = Сред(ТекущаяСтрока, ПозицияТире + 3);
			
			СтрокаДоТире = Лев(ТекущаяСтрока, ПозицияТире);
			СтрокаДоТире = СтрЗаменить(СтрокаДоТире, "/", "");
			
			ПозицияТире = ПозицияТире + СтрНайти(ТекущаяСтрокаВтороеТире, " - ") + 2;
			
			// Иногда описание параметра начинается с тире, тогда надо определять позицию 3-го тире.
			Если (КоличествоТире >= 3) И (ПустаяСтрока(СтрокаДоТире)) Тогда
				ТекущаяСтрокаТретьеТире = Сред(ТекущаяСтрока, ПозицияТире + 3);
				ПозицияТире = ПозицияТире + СтрНайти(ТекущаяСтрокаТретьеТире, " - ") + 2;
			КонецЕсли;
		КонецЕсли;
		
		// Определяем номер значимого символа после тире.
		ДлинаСтроки = СтрДлина(ТекущаяСтрока);
		Для НомерСимвола = ПозицияТире + 3 По ДлинаСтроки Цикл
			Символ = Сред(ТекущаяСтрока, НомерСимвола, 1);
			Если Символ <> " " Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		// Подготовим новый отступ - заменим все символы, кроме "/" на пробелы.
		НовыйОтступ = "";
		СимволыБезЗамены = " /" + Символы.Таб;
		Для Счетчик = 1 По НомерСимвола - 1 Цикл
			Символ = Сред(ТекущаяСтрока, Счетчик, 1);
			Если СтрНайти(СимволыБезЗамены, Символ) > 0 Тогда
				НовыйОтступ = НовыйОтступ + Символ;
			Иначе
				НовыйОтступ = НовыйОтступ + " ";
			КонецЕсли;
		КонецЦикла;
		
		// Если переносимый текст полностью укладывается в 120 символов (без еще одного переноса), то переносим по тире.
		Если СтрДлина(НовыйОтступ) + СтрДлина(ПереносимаяСтрока) <= КоличествоСимволовДляПереносаКомментария Тогда
			НоваяСтрока = НовыйОтступ + ПереносимаяСтрока;
		Иначе
			// Если не укладывается, то новый отступ = текущему + 4 пробела слева.
			НовыйОтступ = ОтступДоЗнакаКомментария + "//" + ОтступПослеЗнакаКомментария + "    ";
			НоваяСтрока = НовыйОтступ + ПереносимаяСтрока;
		КонецЕсли;
		
		ДокументТекст.ЗаменитьСтроку(НомерСтроки, ТекущаяСтрока);
		ДокументТекст.ВставитьСтроку(НомерСтроки + 1, НоваяСтрока);
		
		ОбъединитьКомментарииСтрок(ДокументТекст, НомерСтроки + 1);
		
		ФайлИзменен = Истина;
		
	КонецЦикла;
	
	Возврат ФайлИзменен;
	
КонецФункции

Процедура ЗаписатьИзмененияВФайл(ДокументТекст, ПолноеИмяФайла)
	
	СтрокаРезультата = Результат.Найти(ПолноеИмяФайла, "ПолноеИмяФайла");
	Если СтрокаРезультата <> Неопределено Тогда
		СтрокаРезультата.Изменен = Истина;
	КонецЕсли;
	
	ТекстДляЗаписи = ДокументТекст.ПолучитьТекст();
	// Пустые файлы не перезаписываем.
	Если ПустаяСтрока(ТекстДляЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаписи = ПараметрыЗаписиДокументаDOM(ПолноеИмяФайла);
	ЗаписатьТекстовыйФайл(ПолноеИмяФайла, ТекстДляЗаписи, ПараметрыЗаписи);
	
КонецПроцедуры

// Процедура вызывается в том случае, когда невозможно исправить ошибку
// Параметры:
//  Объект      - Строка - обрабатываемый модуль
//  Описание    - Строка - описание ошибки
//  НомерСтроки - Число  - номер строки с ошибкой
//
Процедура ОбработатьИсключение(ПолноеИмяФайла, Описание, НомерСтроки)
	
	СтрокаРезультата = Результат.Найти(ПолноеИмяФайла, "ПолноеИмяФайла");
	Если СтрокаРезультата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаРезультата.ВозниклоИсключение = Истина;
	СтрокаРезультата.СчетчикПропущенных = СтрокаРезультата.СчетчикПропущенных + 1;
	СтрокаРезультата.Пропущено = НСтр("ru='Пропущено мест:'; en='Пропущено мест:'", КодОсновногоЯзыка) + " " + СтрокаРезультата.СчетчикПропущенных;
	
	Если СтрокаРезультата.СчетчикПропущенных > 1 Тогда
		СтрокаРезультата.УточнениеИсключения = СтрокаРезультата.УточнениеИсключения + Символы.ПС;
	КонецЕсли;
	
	СтрокаРезультата.УточнениеИсключения = СтрокаРезультата.УточнениеИсключения
		+ Строка(СтрокаРезультата.СчетчикПропущенных) + ". Строка " + Строка(НомерСтроки) + " - " + Описание;
	
КонецПроцедуры

Функция ПолучитьТипМодуляПоИмениФайла(ПолноеИмяФайла)
	
	ПолноеИмяФайлаВРег = ВРег(ПолноеИмяФайла);
	Если НЕ СтрЗаканчиваетсяНа(ПолноеИмяФайлаВРег, ВРег("Module.bsl")) Тогда
		Возврат "";
	КонецЕсли;
	
	КаталогВыгрузкиИсточник = КаталогВыгрузкиРезультат;
	Если НЕ ЭтоВыгрузкаXMLФайлов Тогда
		// Если это выгрузка EDT, тогда добавим каталог "src" в каталог выгрузки.
		КаталогВыгрузкиИсточник = КаталогВыгрузкиИсточник + "src" + РазделительПути;
	КонецЕсли;
	
	// Получим окончание пути файла.
	ПутьФайла = СтрЗаменить(ПолноеИмяФайлаВРег, ВРег(КаталогВыгрузкиИсточник), "");
	ПутьФайла = СокрЛП(ПутьФайла);
	
	Если СтрНачинаетсяС(ПутьФайла, ВРег("CommonModules") + РазделительПути) Тогда
		ТипМодуля = "ОбщийМодуль";
	ИначеЕсли СтрЗаканчиваетсяНа(ПутьФайла, РазделительПути + ВРег("ObjectModule.bsl")) Тогда
		ТипМодуля = "МодульОбъекта";
	ИначеЕсли СтрЗаканчиваетсяНа(ПутьФайла, РазделительПути + ВРег("RecordSetModule.bsl")) Тогда
		ТипМодуля = "МодульНабораЗаписей";
	ИначеЕсли СтрЗаканчиваетсяНа(ПутьФайла, РазделительПути + ВРег("ManagerModule.bsl")) Тогда
		ТипМодуля = "МодульМенеджера";
	ИначеЕсли СтрНачинаетсяС(ПутьФайла, ВРег("CommonForms") + РазделительПути) Тогда
		// Модуль общей формы.
		ТипМодуля = "МодульФормы";
	ИначеЕсли СтрЗаканчиваетсяНа(ПутьФайла, ВРег(СтрШаблон("%1Ext%1Form%1Module.bsl", РазделительПути))) Тогда
		// Модуль формы для выгрузки XML.
		ТипМодуля = "МодульФормы";
	ИначеЕсли СтрНайти(ПутьФайла, ВРег(СтрШаблон("%1Forms%1", РазделительПути))) > 0 Тогда
		// Модуль формы для проекта EDT.
		ТипМодуля = "МодульФормы";
	Иначе
		ТипМодуля = "";
	КонецЕсли;
	
	Возврат ТипМодуля;
	
КонецФункции

Функция ЗаменитьОбластиВВидеКомментариев(ДокументТекст, ПолноеИмяФайла, ТаблицаСтандартныхОбластей)
	
	МодульИзменен = Ложь;
	
	ШаблонОбластей82 = "////////////////////////////////////////////////////////////////////////////////";
	
	ТекстМодуля = ДокументТекст.ПолучитьТекст();
	Если СтрНайти(ТекстМодуля, ШаблонОбластей82) = 0 Тогда
		Возврат МодульИзменен;
	КонецЕсли;
	
	// Создаем копию текста модуля на случай, если будет необходимо отказаться от изменений в текстовом документе.
	ТекстМодуляИсходный = ТекстМодуля;
	
	// Удаляем пустые строки в конце текстового документа.
	ПоследняяСтрока = "";
	Пока ПустаяСтрока(ПоследняяСтрока) Цикл
		НомерПоследнейСтроки = ДокументТекст.КоличествоСтрок();
		ПоследняяСтрока = ДокументТекст.ПолучитьСтроку(НомерПоследнейСтроки);
		Если НЕ ПустаяСтрока(ПоследняяСтрока) Тогда
			Прервать;
		КонецЕсли;
		ДокументТекст.УдалитьСтроку(НомерПоследнейСтроки);
	КонецЦикла;
	
	ТекстОшибкиЗаменыОбластей = НСтр("ru='Невозможно заменить области формата 8.2 (комментарии) на формат 8.3 (#Область ...)';
		|en='Невозможно заменить области формата 8.2 (комментарии) на формат 8.3 (#Область ...)'", КодОсновногоЯзыка);
	
	ТекстОбласть = НСтр("ru='#Область '; en='#Region '", КодОсновногоЯзыка);
	ТекстОбластьВРег = ВРег(ТекстОбласть);
	
	МассивТекстНачалоМетода = Контекст.Получить("МассивТекстПроцедураФункция");
	МассивТекстКонецМетода  = Контекст.Получить("МассивТекстКонецПроцедурыФункции");
	МассивТекстЕсли         = Контекст.Получить("МассивТекстЕсли");
	МассивТекстКонецЕсли    = Контекст.Получить("МассивТекстКонецЕсли");
	МассивТекстКонецОбласти = Контекст.Получить("МассивТекстКонецОбласти");
	
	// Не обрабатываем строки, содержащие "Copyright (c)", например:
	///////////////////////////////////////////////////////////////////////////////////////////////////////
	// Copyright (c) 2024, ООО 1С-Софт
	МассивИсключенийОбластей = Новый Массив;
	МассивИсключенийОбластей.Добавить(ВРег("Copyright (c)"));
	
	ОткрытаОбластьВерхнегоУровня   = Ложь;
	ОткрытаОбластьВложенногоУровня = Ложь;
	ОткрытаОбласть                 = Ложь;
	ОткрытМетод                    = Ложь;
	ОткрытаИнструкция              = Ложь;
	ОбластьВнутриИнструкции        = Ложь;
	ЭтоОбласть82ВерхнегоУровня     = Ложь;
	
	ИмяОбласти83 = "";
	
	НомерСтрокиОбласти83             = 0;
	КоличествоОткрытыхОбластей       = 0;
	КоличествоЗакрытыхОбластей       = 0;
	НомерСтрокиНеобработаннойОбласти = 0;
	
	// Построчно обходим текстовый документ, начиная с первой строки.
	НомерСтроки = 0;
	Пока НомерСтроки <= ДокументТекст.КоличествоСтрок() Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		СтрокаМодуля = ДокументТекст.ПолучитьСтроку(НомерСтроки);
		Если ПустаяСтрока(СтрокаМодуля) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаМодуля = ВРег(СтрокаМодуля);
		
		СтрокаМодуля = СокрЛП(СтрокаМодуля);
		Если СтрНачинаетсяСПоМассиву(СтрокаМодуля, МассивТекстНачалоМетода).Успешно Тогда
			// Начало процедуры(функции).
			ОткрытМетод = Истина;
		КонецЕсли;
		
		Если СтрНачинаетсяСПоМассиву(СтрокаМодуля, МассивТекстКонецМетода).Успешно Тогда
			// Конец процедуры(функции).
			ОткрытМетод = Ложь;
		КонецЕсли;
		
		Если ОткрытМетод Тогда
			// Области внутри процедур(функций) не обрабатываем.
			Продолжить;
		КонецЕсли;
		
		Если СтрНачинаетсяСПоМассиву(СтрокаМодуля, МассивТекстЕсли).Успешно Тогда
			// Начало инструкции препроцессора - оставляем строку в исходном виде.
			ОткрытаИнструкция = Истина;
			Продолжить;
		КонецЕсли;
		
		Если СтрНайтиПоМассиву(СтрокаМодуля, МассивТекстКонецЕсли).Успешно Тогда
			// Конец инструкции препроцессора.
			ОткрытаИнструкция = Ложь;
			
			// Сравниваем количество открытых и закрытых областей.
			Если КоличествоОткрытыхОбластей > КоличествоЗакрытыхОбластей Тогда
				
				// Проверяем наличие области ниже.
				НижеЕстьОбласть = Ложь;
				Для НомерКонтрольнойСтроки = НомерСтроки По ДокументТекст.КоличествоСтрок() Цикл
					ПроверяемаяСтрока = ДокументТекст.ПолучитьСтроку(НомерКонтрольнойСтроки);
					Если СтрНайти(ПроверяемаяСтрока, ШаблонОбластей82) > 0 Тогда
						НижеЕстьОбласть = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				// Ниже есть область, закрываем все незакрытые области, расположенные выше.
				Если НижеЕстьОбласть Тогда
					ЗакрытьОткрытыеОбласти(ДокументТекст, НомерСтроки + 1, КоличествоОткрытыхОбластей, КоличествоЗакрытыхОбластей + 1);
				КонецЕсли;
				
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		// Нашли текст "#Область ".
		Если СтрНачинаетсяС(СтрокаМодуля, ТекстОбластьВРег) Тогда
			// Запоминаем имя области.
			ПозицияТекстОбласть = СтрНайти(СтрокаМодуля, ТекстОбластьВРег);
			ИмяОбласти83 = Сред(СтрокаМодуля, ПозицияТекстОбласть + СтрДлина(ТекстОбластьВРег) );
			НомерСтрокиОбласти83 = НомерСтроки;
			// Закрываем все ранее открытые области.
			Если КоличествоОткрытыхОбластей > КоличествоЗакрытыхОбластей Тогда
				НомерСтрокиЗакрытияОбласти = ?(НомерСтрокиНеобработаннойОбласти > 0, НомерСтрокиНеобработаннойОбласти, НомерСтроки);
				ЗакрытьОткрытыеОбласти(ДокументТекст, НомерСтрокиЗакрытияОбласти, КоличествоОткрытыхОбластей, КоличествоЗакрытыхОбластей);
				ОткрытаОбласть = Ложь;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		// Нашли "#КонецОбласти".
		Если СтрНачинаетсяСПоМассиву(СтрокаМодуля, МассивТекстКонецОбласти).Успешно Тогда
			// Очищаем значение переменной.
			ИмяОбласти83 = "";
			// Закрываем все ранее открытые области
			НомерСтрокиОбласти83 = 0;
			// Закрываем все ранее открытые области.
			Если КоличествоОткрытыхОбластей > КоличествоЗакрытыхОбластей
				И НЕ ЭтоОбласть82ВерхнегоУровня Тогда
				ЗакрытьОткрытыеОбласти(ДокументТекст, НомерСтроки, КоличествоОткрытыхОбластей, КоличествоЗакрытыхОбластей);
				ОткрытаОбласть = Ложь;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		Если НЕ СтрНачинаетсяС(СтрокаМодуля, ШаблонОбластей82) Тогда
			Продолжить;
		КонецЕсли;
		
		СледующаяСтрокаМодуля = ДокументТекст.ПолучитьСтроку(НомерСтроки + 1);
		Если ПустаяСтрока(СледующаяСтрокаМодуля) Тогда
			ОткрытаОбласть = ОткрытаОбластьВерхнегоУровня ИЛИ ОткрытаОбластьВложенногоУровня;
			Продолжить;
		КонецЕсли;
		
		Если СтрНачинаетсяС(СокрЛ(ВРег(СледующаяСтрокаМодуля)), ТекстОбластьВРег) Тогда
			// Ниже открывается область, переходим к следующей строке.
			Продолжить;
		КонецЕсли;
		
		СледующаяСтрокаМодуля = СтрЗаменить(СледующаяСтрокаМодуля, "//", "");
		СледующаяСтрокаМодуля = СокрЛП(СледующаяСтрокаМодуля);
		
		Если СтрНачинаетсяСПоМассиву(ВРег(СледующаяСтрокаМодуля), МассивИсключенийОбластей).Успешно Тогда
			ОткрытаОбласть = ОткрытаОбластьВерхнегоУровня ИЛИ ОткрытаОбластьВложенногоУровня;
			Продолжить;
		КонецЕсли;
		
		// Проверяем третью строку.
		// Считаем, что области, оформленные в несколько строк, - это комментарии.
		// Такие случаи не обрабатываем.
		Если ЭтоМногострочныйКомментарий(ДокументТекст, НомерСтроки, ШаблонОбластей82) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураОбласти = ПолучитьСтруктуруОбласти83ИзОбласти82(СледующаяСтрокаМодуля, ТаблицаСтандартныхОбластей);
		
		ИмяОбласти = СтруктураОбласти.Наименование;
		Если ПустаяСтрока(ИмяОбласти) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВРег(ИмяОбласти) = ИмяОбласти83 Тогда
			// Проверяем, что выше нет открытых областей, оформленных по стандарту 8.3
			// и имеющих такое же имя.
			// Если область с таким именем уже открыта,
			// то удаляем область, оформленную в виде комментария.
			УдалитьОбласть82(ДокументТекст, НомерСтроки, КоличествоОткрытыхОбластей);
			Продолжить;
		КонецЕсли;
		
		ЭтоОбласть82ВерхнегоУровня = СтруктураОбласти.ВерхнегоУровня;
		
		ЭтоПустаяОбласть = ЭтоПустаяОбласть(ДокументТекст, НомерСтроки, ТекстОбласть, ШаблонОбластей82, ЭтоОбласть82ВерхнегоУровня);
		Если ЭтоПустаяОбласть Тогда
			НомерСтрокиНеобработаннойОбласти = НомерСтроки;
			Если КоличествоОткрытыхОбластей > КоличествоЗакрытыхОбластей Тогда
				ЗакрытьОбласть(ДокументТекст, НомерСтроки);
				ОткрытаОбластьВложенногоУровня = Ложь;
				КоличествоЗакрытыхОбластей = КоличествоЗакрытыхОбластей + 1;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		// Проверяем наличие кода перед найденной областью.
		// Если перед областью есть код, то такую область можно преобразовать, независимо от количества вложенных областей.
		ПередОбластью82ЕстьКод = Ложь;
		Если НомерСтрокиОбласти83 > 0 Тогда
			ПередОбластью82ЕстьКод = ПередОбластью82ЕстьКод(ДокументТекст, НомерСтроки,
				НомерСтрокиОбласти83, МассивТекстКонецОбласти, МассивТекстКонецМетода, ТекстОбласть);
		КонецЕсли;
		
		ОбластьМожетБытьПреобразована = ПередОбластью82ЕстьКод;
		Если НЕ ПередОбластью82ЕстьКод Тогда
			// Перед областью нет кода.
			// Для области 8.2 верхнего уровня считаем количество вложенных областей.
			// Если вложенных областей больше одной, то такую область можно преобразовать.
			ОбластьМожетБытьПреобразована = ОбластьМожетБытьПреобразована(ДокументТекст,
				ШаблонОбластей82, НомерСтроки, ТекстОбластьВРег, МассивТекстКонецОбласти, ЭтоОбласть82ВерхнегоУровня, НомерСтрокиОбласти83);
		КонецЕсли;
		
		Если НЕ ОбластьМожетБытьПреобразована Тогда
			НомерСтрокиНеобработаннойОбласти = НомерСтроки;
			Продолжить;
		КонецЕсли;
		
		// Закрываем область, расположенную выше.
		// Можно закрыть область:
		// - после открытия которой не была открыта инструкция препроцессора;
		// - открытую внутри инструкции препроцессора.
		Если ЭтоОбласть82ВерхнегоУровня Тогда
			Если (ОткрытаОбластьВерхнегоУровня И НЕ ОткрытаИнструкция) ИЛИ ОбластьВнутриИнструкции Тогда
				ЗакрытьОбласть(ДокументТекст, НомерСтроки);
				ОткрытаОбластьВерхнегоУровня = Ложь;
				КоличествоЗакрытыхОбластей = КоличествоЗакрытыхОбластей + 1;
			КонецЕсли;
			// Закрываем все ранее открытые области, т.к. область верхнего уровня не может быть вложенной.
			Если КоличествоОткрытыхОбластей > КоличествоЗакрытыхОбластей Тогда
				ЗакрытьОткрытыеОбласти(ДокументТекст, НомерСтроки, КоличествоОткрытыхОбластей, КоличествоЗакрытыхОбластей);
			КонецЕсли;
		ИначеЕсли ((ОткрытаОбластьВложенногоУровня И НЕ ОткрытаИнструкция) И ОткрытаОбласть) ИЛИ ОбластьВнутриИнструкции Тогда
			// Закрываем ранее открытую область.
			// Если выше открыта область по стандарту 8.3, то такую область не закрываем,
			// т.к. по умолчанию считаем, что эта область уже закрыта ниже.
			Если КоличествоОткрытыхОбластей > КоличествоЗакрытыхОбластей Тогда
				ЗакрытьОбласть(ДокументТекст, НомерСтроки);
				ОткрытаОбластьВложенногоУровня = Ложь;
				КоличествоЗакрытыхОбластей = КоличествоЗакрытыхОбластей + 1;
			КонецЕсли;
		КонецЕсли;
		
		// Область открыта.
		КоличествоОткрытыхОбластей = КоличествоОткрытыхОбластей + 1;
		
		ПредыдущаяСтрока = ДокументТекст.ПолучитьСтроку(НомерСтроки - 1);
		Если ПустаяСтрока(ПредыдущаяСтрока) Тогда
			ДокументТекст.УдалитьСтроку(НомерСтроки);
		Иначе
			ДокументТекст.ЗаменитьСтроку(НомерСтроки, "");
			НомерСтроки = НомерСтроки + 1;
		КонецЕсли;
		
		ДокументТекст.ЗаменитьСтроку(НомерСтроки, ТекстОбласть + ИмяОбласти);
		
		// Удаляем лишние пустые строки после объявления области.
		УдалитьНезначащиеСтрокиПослеОпределенияОбласти(ДокументТекст, НомерСтроки);
		
		ОткрытаОбластьВерхнегоУровня     = ОткрытаОбластьВерхнегоУровня ИЛИ СтруктураОбласти.ВерхнегоУровня;
		ОткрытаОбластьВложенногоУровня   = НЕ СтруктураОбласти.ВерхнегоУровня;
		ОткрытаОбласть                   = Истина;
		ОбластьВнутриИнструкции          = ОткрытаОбласть И ОткрытаИнструкция;
		НомерСтрокиНеобработаннойОбласти = 0;
		НомерСтрокиОбласти83             = НомерСтроки;
		
		МодульИзменен = Истина;
		
	КонецЦикла;
	
	Если НЕ МодульИзменен Тогда
		ДокументТекст.УстановитьТекст(ТекстМодуляИсходный);
		Возврат МодульИзменен;
	КонецЕсли;
	
	// Получаем номер строки для вставки "#КонецОбласти" в конце текстового документа.
	НомерСтрокиДляЗакрытияОбласти = НомерСтрокиДляЗакрытияОбласти(ДокументТекст, МассивТекстНачалоМетода,
		МассивТекстКонецМетода, МассивТекстЕсли, МассивТекстКонецЕсли, НомерСтроки, ТекстОбластьВРег);
	
	// Закрываем все незакрытые области, добавляя необходимое количество "#КонецОбласти" в конце текстового документа.
	Если КоличествоОткрытыхОбластей > КоличествоЗакрытыхОбластей Тогда
		ЗакрытьОткрытыеОбласти(ДокументТекст, НомерСтрокиДляЗакрытияОбласти + 1, КоличествоОткрытыхОбластей, КоличествоЗакрытыхОбластей, Ложь);
	КонецЕсли;
	
	Если МодульИзменен Тогда
		// Проверяем наличие ошибок при замене областей.
		СтруктураРезультатаЗаменыОбластей = ПроверитьЗаменуОбластей82На83(ДокументТекст);
		Если НЕ СтруктураРезультатаЗаменыОбластей.ОбластиЗамененыКорректно Тогда
			// Если выявлены ошибки, файл не перезаписываем.
			ТекстОшибки = ТекстОшибкиЗаменыОбластей + СтруктураРезультатаЗаменыОбластей.ТекстОшибки;
			ОбработатьИсключение(ПолноеИмяФайла, ТекстОшибки, СтруктураРезультатаЗаменыОбластей.НомерСтрокиОшибки);
			МодульИзменен = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если МодульИзменен Тогда
		СокрТекстДокумента(ДокументТекст, Ложь);
	Иначе
		// Модуль не изменен, возвращаем текстовый документ в исходное состояние.
		ДокументТекст.УстановитьТекст(ТекстМодуляИсходный);
	КонецЕсли;
	
	Возврат МодульИзменен;
	
КонецФункции

Функция ЭтоПустаяОбласть(ДокументТекст, НомерСтроки, ТекстОбласть, ШаблонОбластей82, ЭтоОбласть82ВерхнегоУровня)
	
	ЭтоПустаяОбласть = Истина;
	
	Для НомерСтрокиМодуля = НомерСтроки + 2 По ДокументТекст.КоличествоСтрок() Цикл
		
		СтрокаМодуля = ДокументТекст.ПолучитьСтроку(НомерСтрокиМодуля);
		Если ПустаяСтрока(СтрокаМодуля) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрНачинаетсяС(СтрокаМодуля, ТекстОбласть) Тогда
			Прервать;
		КонецЕсли;
		
		Если СтрНачинаетсяС(СтрокаМодуля, ШаблонОбластей82) Тогда
			
			Если ЭтоМногострочныйКомментарий(ДокументТекст, НомерСтрокиМодуля, ШаблонОбластей82) Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ЭтоОбласть82ВерхнегоУровня Тогда
				Прервать;
			КонецЕсли;
			
			СледующаяСтрока = ДокументТекст.ПолучитьСтроку(НомерСтрокиМодуля + 1);
			Если СледующаяСтрока = ВРег(СледующаяСтрока) Тогда
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрНачинаетсяС(СтрокаМодуля, "//") Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоПустаяОбласть = Ложь;
		Прервать;
		
	КонецЦикла;
	
	Возврат ЭтоПустаяОбласть;
	
КонецФункции

Процедура УдалитьНезначащиеСтрокиПослеОпределенияОбласти(ДокументТекст, НомерСтроки)
	
	// После объявления области удаляем лишние пустые строки, а также строки, которые содержат только слеши.
	НомерСледующейСтроки = НомерСтроки;
	Пока Истина Цикл
		
		НомерСледующейСтроки = НомерСледующейСтроки + 1;
		СледующаяСтрокаМодуля = ДокументТекст.ПолучитьСтроку(НомерСледующейСтроки);
		СледующаяСтрокаМодуля = СтрЗаменить(СледующаяСтрокаМодуля, "//", "");
		
		Если НЕ ПустаяСтрока(СледующаяСтрокаМодуля) Тогда
			Прервать;
		КонецЕсли;
		
		НомерСтрокиПослеСледующейСтроки = НомерСледующейСтроки + 1;
		СтрокаМодуляПослеСледующейСтроки = ДокументТекст.ПолучитьСтроку(НомерСтрокиПослеСледующейСтроки);
		
		Если НЕ ПустаяСтрока(СтрокаМодуляПослеСледующейСтроки) Тогда
			ДокументТекст.ЗаменитьСтроку(НомерСледующейСтроки, СледующаяСтрокаМодуля);
			Прервать;
		КонецЕсли;
		
		ДокументТекст.УдалитьСтроку(НомерСледующейСтроки);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЭтоМногострочныйКомментарий(ДокументТекст, НомерСтроки, ШаблонОбластей82)
	
	НомерСледующейСтроки = НомерСтроки + 1;
	СледующаяСтрока = ДокументТекст.ПолучитьСтроку(НомерСледующейСтроки + 1);
	
	Если СтрНачинаетсяС(СледующаяСтрока, "//") Тогда
		
		Если СтрНачинаетсяС(СледующаяСтрока, ШаблонОбластей82) Тогда
			Возврат Истина;
		КонецЕсли;
		
		СледующаяСтрока = СтрЗаменить(СледующаяСтрока, "//", "");
		
		Если НЕ ПустаяСтрока(СледующаяСтрока) Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура УдалитьОбласть82(ДокументТекст, НомерСтроки, КоличествоОткрытыхОбластей)
	
	Если КоличествоОткрытыхОбластей > 0 Тогда
		КоличествоОткрытыхОбластей = КоличествоОткрытыхОбластей - 1;
	КонецЕсли;
	
	ДокументТекст.УдалитьСтроку(НомерСтроки);// Удаляем слеши.
	ДокументТекст.УдалитьСтроку(НомерСтроки);// Удаляем имя области.
	
	// Если в текущей области 8.3 уже была преобразована область, оформленная в виде комментария,
	// то эту область необходимо закрыть, иначе она может поглотить процедуры (функции),
	// не относящиеся к ней.
	Если КоличествоОткрытыхОбластей > 0 Тогда
		ЗакрытьОбласть(ДокументТекст, НомерСтроки);
		КоличествоОткрытыхОбластей = КоличествоОткрытыхОбластей - 1;
	КонецЕсли;
	
	// Определяем номер строки для удаления пустых строк ниже.
	НомерПроверяемойСтроки = НомерСтроки + 1;
	Пока Истина Цикл
		
		ПроверяемаяСтрока = ДокументТекст.ПолучитьСтроку(НомерПроверяемойСтроки);
		Если НЕ ПустаяСтрока(СокрЛП(ПроверяемаяСтрока)) Тогда
			Прервать;
		КонецЕсли;
		
		ДокументТекст.УдалитьСтроку(НомерПроверяемойСтроки);
		НомерПроверяемойСтроки = НомерПроверяемойСтроки + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПередОбластью82ЕстьКод(ДокументТекст, НомерСтроки, НомерСтрокиОбласти83,
		МассивТекстКонецОбласти, МассивТекстКонецПроцедурыФункции, ТекстОбласть)
	
	ПередОбластьюЕстьКод = Ложь;
	НомерПроверяемойСтроки = НомерСтроки;
	
	Пока НомерПроверяемойСтроки > 0 Цикл
		
		НомерПроверяемойСтроки = НомерПроверяемойСтроки - 1;
		
		// Если выше области 8.2 открыта область 8.3, то проверяем только до начала области 8.3.
		Если НомерПроверяемойСтроки = НомерСтрокиОбласти83 Тогда
			Возврат ПередОбластьюЕстьКод;
		КонецЕсли;
		
		ПроверяемаяСтрока = ДокументТекст.ПолучитьСтроку(НомерПроверяемойСтроки);
		Если ПустаяСтрока(ПроверяемаяСтрока) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрНачинаетсяС(ПроверяемаяСтрока, ТекстОбласть) Тогда
			Прервать;
		КонецЕсли;
		
		ПроверяемаяСтрока = ВРег(ПроверяемаяСтрока);
		
		// Нашли закрытие области 8.3, дальше не проверяем.
		Если СтрНачинаетсяСПоМассиву(ПроверяемаяСтрока, МассивТекстКонецОбласти).Успешно Тогда
			Прервать;
		КонецЕсли;
		
		ПередОбластьюЕстьКод = НЕ СтрНачинаетсяС(ПроверяемаяСтрока, "//");
		
		Если ПередОбластьюЕстьКод Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПередОбластьюЕстьКод;
	
КонецФункции

Функция ОбластьМожетБытьПреобразована(ДокументТекст, ШаблонОбластей82, НомерСтроки,
	ТекстОбластьВРег, МассивТекстКонецОбласти, ЭтоОбласть82ВерхнегоУровня, НомерСтрокиОбласти83)
	
	// Проверяем количество вложенных областей.
	КоличествоВложенныхОбластей = 0;
	ОткрытыхОбластей83          = 0;
	ЗакрытыхОбластей83          = 0;
	Область82СодержитКод        = Ложь;
	ПроверятьНаличиеКода        = Истина;
	
	// Определяем номер строки, начиная с которой будем проверять возможность преобразования проверяемой области.
	// Если выше открыта область 8.3, то проверять будем, начиная с нее.
	НомерПроверяемойСтроки = ?(НомерСтрокиОбласти83 > 0, НомерСтрокиОбласти83, НомерСтроки);
	
	Пока НомерПроверяемойСтроки <= ДокументТекст.КоличествоСтрок() Цикл
		
		НомерПроверяемойСтроки = НомерПроверяемойСтроки + 1;
		
		ПроверяемаяСтрока = ДокументТекст.ПолучитьСтроку(НомерПроверяемойСтроки);
		Если ПустаяСтрока(ПроверяемаяСтрока) Тогда
			Продолжить;
		КонецЕсли;
		
		ПроверяемаяСтрока = ВРег(ПроверяемаяСтрока);
		
		// Для областей 8.2 верхнего уровня или вложенных в область 8.3 проверяем:
		// 1. наличие кода после открытия области - если после открытия области есть код,
		// то проверяемую область можно преобразовать;
		// 2. если кода нет, то считаем количество вложенных областей - проверяемую область можно
		// преобразовать, если найдено больше одной вложенной области.
		Если ЭтоОбласть82ВерхнегоУровня ИЛИ НомерСтрокиОбласти83 > 0 Тогда
			
			// Вложенных областей на данной итерации не найдено, проверяем наличие кода.
			// Кодом считаем любую не пустую строку, которая начинается не с "//".
			// Например, это может быть инициализация переменной "Перем".
			Если КоличествоВложенныхОбластей = 0 И ПроверятьНаличиеКода Тогда
				// Если выше открыта область 8.3, то наличие кода проверяем только до текущей области 8.2.
				Если НомерСтрокиОбласти83 > 0 Тогда
					Если НомерПроверяемойСтроки = (НомерСтроки + 1) Тогда
						ПроверятьНаличиеКода = Ложь;
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				
				// Ищем незакомментированные строки до начала вложенной области.
				Если НЕ СтрНачинаетсяС(СокрЛ(ПроверяемаяСтрока), "//") Тогда
					Если СтрНачинаетсяС(СокрЛ(ПроверяемаяСтрока), ТекстОбластьВРег) Тогда
						Прервать;
					Иначе
						// Нашли код.
						Область82СодержитКод = Истина;
						Прервать;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
			// Нашли область 8.2.
			Если СтрНачинаетсяС(ПроверяемаяСтрока, ШаблонОбластей82) Тогда
				// Проверяем, что найденная область 8.2 не является многострочным комментарием.
				СледующаяПроверяемаяСтрока = ДокументТекст.ПолучитьСтроку(НомерПроверяемойСтроки + 1);
				Если СтрНачинаетсяС(СледующаяПроверяемаяСтрока, "//") Тогда
					//Если СтрНачинаетсяС(СтрокаПослеСледующейСтроки, "//") Тогда
					Если ЭтоМногострочныйКомментарий(ДокументТекст, НомерПроверяемойСтроки, ШаблонОбластей82) Тогда
						// Это многострочный комментарий, пропускаем.
						НомерПроверяемойСтроки = НомерПроверяемойСтроки;
						Продолжить;
					ИначеЕсли СледующаяПроверяемаяСтрока = ВРег(СледующаяПроверяемаяСтрока) Тогда
						//Если НомерСтрокиОбласти83 > 0 И НомерПроверяемойСтроки <= НомерСтроки Тогда
						Если НомерСтрокиОбласти83 > 0 Тогда
							// Поиск осуществляли, начиная с области 8.3, открытой выше, и нашли проверяемую область 8.2.
							КоличествоВложенныхОбластей = КоличествоВложенныхОбластей + 1;
							Продолжить;
						КонецЕсли;
						Если НЕ ЭтоОбласть82ВерхнегоУровня Тогда
							// Нашли область 8.2 верхнего уровня, дальше не проверяем.
							Прервать;
						КонецЕсли;
					Иначе
						// Это вложенная область.
						КоличествоВложенныхОбластей = КоличествоВложенныхОбластей + 1;
						НомерПроверяемойСтроки = НомерПроверяемойСтроки + 1;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если СтрНачинаетсяС(ПроверяемаяСтрока, ТекстОбластьВРег) Тогда
				// Также могут быть вложенные области 8.3.
				ОткрытыхОбластей83 = ОткрытыхОбластей83 + 1;
			КонецЕсли;
			
			Если СтрНачинаетсяСПоМассиву(ПроверяемаяСтрока, МассивТекстКонецОбласти).Успешно Тогда
				ЗакрытыхОбластей83 = ЗакрытыхОбластей83 + 1;
				Если ОткрытыхОбластей83 > ЗакрытыхОбластей83 Тогда
					// Вложенные области 8.3 не учитываем.
					ОткрытыхОбластей83 = ОткрытыхОбластей83 - 1;
				ИначеЕсли ЗакрытыхОбластей83 > ОткрытыхОбластей83 Тогда
					// Нашли "#КонецОбласти" для области 8.3, открытой до области 8.2.
					Прервать;
				Иначе
					КоличествоВложенныхОбластей = КоличествоВложенныхОбластей + 1;
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			// Для области 8.2, не являющейся областью верхнего уровня и не входящую в состав области 8.3
			// останавливаем поиск, если нашли область 8.2 или область 8.3.
			Если СтрНачинаетсяС(ПроверяемаяСтрока, ТекстОбластьВРег)
			 ИЛИ СтрНачинаетсяС(ПроверяемаяСтрока, ШаблонОбластей82) Тогда
				Если НомерСтрокиОбласти83 > 0 Тогда
					КоличествоВложенныхОбластей = КоличествоВложенныхОбластей + 1;
					Продолжить;
				Иначе
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ СтрНачинаетсяС(СокрЛ(ПроверяемаяСтрока), "//") Тогда
				// Нашли начало процедуры (функции).
				Область82СодержитКод = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
		
		// Считаем, что область может быть преобразована, если содержит минимум 2 вложенных области.
		Если КоличествоВложенныхОбластей = 2 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЭтоОбласть82ВерхнегоУровня ИЛИ НомерСтрокиОбласти83 > 0 Тогда
		ОбластьМожетБытьПреобразована = (Область82СодержитКод ИЛИ (КоличествоВложенныхОбластей > 1));
	Иначе
		ОбластьМожетБытьПреобразована = Область82СодержитКод;
	КонецЕсли;
	
	Возврат ОбластьМожетБытьПреобразована;
	
КонецФункции

Функция НомерСтрокиДляЗакрытияОбласти(ДокументТекст, МассивТекстНачалоМетода, МассивТекстКонецМетода,
		МассивТекстЕсли, МассивТекстКонецЕсли, НомерСтроки, ТекстОбласть)
	
	ТекстДокумента = ДокументТекст.ПолучитьТекст();
	ТекстДокумента = СтрЗаменить(ТекстДокумента, " ", "");
	ТекстДокумента = ВРег(ТекстДокумента);
	
	// Получаем номер строки "КонецПроцедуры" или "КонецФункции" с конца текстового документа.
	ПозицияТекстКонецМетода = СтрНайтиПоМассиву(ТекстДокумента, МассивТекстКонецМетода, НаправлениеПоиска.СКонца).Позиция;
	НомерСтрокиТекстКонецМетода = ПолучитьНомерСтрокиМодуля(ТекстДокумента, ПозицияТекстКонецМетода);
	
	// Определяем позицию "#КонецЕсли" поиском с конца текстового документа.
	РезультатПоиска = СтрНайтиПоМассиву(ТекстДокумента, МассивТекстКонецЕсли, НаправлениеПоиска.СКонца);
	ПозицияТекстКонецЕсли = РезультатПоиска.Позиция;
	НайденныйЭлемент = ?(ПозицияТекстКонецЕсли > 0, РезультатПоиска.НайденныйЭлемент, "");
	
	НомерСтрокиТекстКонецЕсли = 0;
	Если ПозицияТекстКонецЕсли > 0 Тогда
		
		// Получаем текст после "#КонецЕсли".
		ТекстПослеКонецЕсли = Сред(ТекстДокумента, ПозицияТекстКонецЕсли + СтрДлина(НайденныйЭлемент));
		Если НЕ СтрНайтиПоМассиву(ТекстПослеКонецЕсли, МассивТекстНачалоМетода).Успешно Тогда
			// В тексте после "#КонецЕсли" нет процедур(функций), получаем номер строки, содержащей "#КонецЕсли".
			НомерСтрокиТекстКонецЕсли = ПолучитьНомерСтрокиМодуля(ТекстДокумента, ПозицияТекстКонецЕсли);
		КонецЕсли;
		
	КонецЕсли;
	
	МассивТекстКонецОбласти = Контекст["МассивТекстКонецОбласти"];
	
	// Определяем позицию "#КонецОбласти" с конца текстового документа.
	РезультатПоискаТекстКонецОбласти = СтрНайтиПоМассиву(ТекстДокумента, МассивТекстКонецОбласти, НаправлениеПоиска.СКонца,, Истина);
	ПозицияТекстКонецОбласти = РезультатПоискаТекстКонецОбласти.Позиция;
	ТекстКонецОбласти = РезультатПоискаТекстКонецОбласти.НайденныйЭлемент;
	
	// Определяем позицию слова после строк "#КонецОбласти" или "#КонецЕсли".
	ПозицияПослеЗакрывающейКонструкции = ?(ПозицияТекстКонецОбласти > 0, ПозицияТекстКонецОбласти + СтрДлина(ТекстКонецОбласти), ПозицияТекстКонецЕсли + СтрДлина(НайденныйЭлемент));
	
	// Получаем текст после закрывающей конструкции.
	ТекстПослеЗакрывающейКонструкции = Сред(ТекстДокумента, ПозицияПослеЗакрывающейКонструкции);
	ТекстПослеЗакрывающейКонструкции = СокрЛП(ТекстПослеЗакрывающейКонструкции);
	
	Если СтрЗаканчиваетсяНаПоМассиву(СокрП(ТекстДокумента), МассивТекстКонецЕсли).Успешно Тогда
		// В конце текста модуля содержится "#КонецЕсли".
		Если СтрНайтиПоМассиву(ТекстПослеЗакрывающейКонструкции, МассивТекстЕсли).Успешно Тогда
			// Проверяем, что открытие инструкции препроцессора происходит в тексте после закрывающей конструкции.
			// В этом случае необходимо закрыть область после "#КонецЕсли".
			ДокументТекст.ДобавитьСтроку("");
			НомерСтроки = НомерСтрокиТекстКонецЕсли + 1;
		Иначе
			// Ниже нет открытия инструкции препроцессора, значит инструкция препроцессора открыта выше.
			// В этом случае необходимо закрыть область до "#КонецЕсли".
			// Проверяем, что выше "#КонецЕсли" есть "#Иначе" - если есть, то необходимо закрыть область до "#Иначе".
			МассивТекстИначе = Контекст["МассивТекстИначе"];
			ПозицияИначе = СтрНайтиПоМассиву(СокрП(ТекстДокумента), МассивТекстИначе, НаправлениеПоиска.СКонца).Позиция;
			Если ПозицияИначе > 0 Тогда
				НомерСтроки = ПолучитьНомерСтрокиМодуля(ТекстДокумента, ПозицияИначе);
			КонецЕсли;
			
			НомерСтроки = НомерСтроки - 2;
		КонецЕсли;
		
	КонецЕсли;
	
	// Если строка "#КонецЕсли" находится в конце текста модуля, то необходимо закрыть область до нее.
	// Если строки "#КонецЕсли" нет в конце текста модуля, то закрыть область необходимо после окончания процедуры(функции).
	НомерСтрокиДляЗакрытияОбласти = ?(НомерСтрокиТекстКонецЕсли > 0, Мин(НомерСтрокиТекстКонецМетода, НомерСтрокиТекстКонецЕсли), НомерСтрокиТекстКонецМетода);
	// Определяем позицию "#Область " в проверяемом тексте.
	ПозицияТекстОбласть = СтрНайти(ТекстПослеЗакрывающейКонструкции, СокрП(ВРег(ТекстОбласть)));
	// Если в проверяемом тексте есть продолжение текста модуля и при этом нет открытия области, то оставляем номер строки для закрытия области без изменений.
	// Иначе в проверяемом тексте есть открытие области - переопределяем номер строки для закрытия области.
	НомерСтрокиДляЗакрытияОбласти = ?((ПозицияТекстОбласть = 0) И (НЕ ПустаяСтрока(ТекстПослеЗакрывающейКонструкции)), НомерСтрокиДляЗакрытияОбласти, НомерСтроки);
	
	ПредыдущаяСтрока = ДокументТекст.ПолучитьСтроку(НомерСтрокиДляЗакрытияОбласти - 1);
	Если НЕ ПустаяСтрока(ПредыдущаяСтрока) Тогда
		ДокументТекст.ВставитьСтроку(НомерСтрокиДляЗакрытияОбласти, "");
		НомерСтрокиДляЗакрытияОбласти = НомерСтрокиДляЗакрытияОбласти + 1;
	КонецЕсли;
	
	Возврат НомерСтрокиДляЗакрытияОбласти;
	
КонецФункции

Процедура ЗакрытьОткрытыеОбласти(ДокументТекст, НомерСтроки, КоличествоОткрытыхОбластей,
		КоличествоЗакрытыхОбластей, УчитыватьЗакрытиеОбласти = Истина)
	
	Если КоличествоОткрытыхОбластей < КоличествоЗакрытыхОбластей Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоНезакрытыхОбластей = КоличествоОткрытыхОбластей - КоличествоЗакрытыхОбластей;
	Для Счетчик = 1 По КоличествоНезакрытыхОбластей Цикл
		ЗакрытьОбласть(ДокументТекст, НомерСтроки);
		Если УчитыватьЗакрытиеОбласти Тогда
			КоличествоЗакрытыхОбластей = КоличествоЗакрытыхОбластей + 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСтруктуруОбласти83ИзОбласти82(Знач СтрокаМодуля, ТаблицаСтандартныхОбластей)
	
	СтруктураОбласти = Новый Структура;
	СтруктураОбласти.Вставить("ВерхнегоУровня", Ложь);
	СтруктураОбласти.Вставить("Наименование", "");
	
	СтрокаМодуляБуфер = СтрокаМодуля;
	СтрокаМодуляБуфер = СтрЗаменить(СтрокаМодуляБуфер, "/", " ");
	СтрокаМодуляБуфер = СтрЗаменить(СтрокаМодуляБуфер, Символы.Таб, " ");
	Если ПустаяСтрока(СтрокаМодуляБуфер) Тогда
		Возврат СтруктураОбласти;
	КонецЕсли;
	
	СтрокаМодуляБуфер = СокрЛП(СтрокаМодуляБуфер);
	
	// Удаляем двойные пробелы для поиска.
	Пока СтрНайти(СтрокаМодуляБуфер, "  ") > 0 Цикл
		СтрокаМодуляБуфер = СтрЗаменить(СтрокаМодуляБуфер, "  ", " ");
	КонецЦикла;
	
	СтрокаСтандартнойОбласти = ТаблицаСтандартныхОбластей.Найти(ВРег(СтрокаМодуляБуфер), "Область82");
	Если СтрокаСтандартнойОбласти <> Неопределено Тогда
		СтруктураОбласти.ВерхнегоУровня = Истина;
		СтруктураОбласти.Наименование = СтрокаСтандартнойОбласти.Область83;
		Возврат СтруктураОбласти;
	КонецЕсли;
	
	СтруктураОтбораПоНеполномуИмени = Новый Структура;
	СтруктураОтбораПоНеполномуИмени.Вставить("ИмяОбластиПолное", Ложь);
	ТаблицаСтандартныхОбластейСНеполнымИменем = ТаблицаСтандартныхОбластей.Скопировать(СтруктураОтбораПоНеполномуИмени);
	Для Каждого СтрокаСтандартнойОбласти Из ТаблицаСтандартныхОбластейСНеполнымИменем Цикл
		
		ИмяОбласти = СтрокаСтандартнойОбласти.Область82;
		Если СтрНачинаетсяС(ВРег(СтрокаМодуляБуфер), ИмяОбласти) Тогда
			
			// Выделяем наименование таблицы формы.
			ИмяТаблицыФормы = Сред(СтрокаМодуляБуфер, СтрДлина(ИмяОбласти) + 1);
			ИмяТаблицыФормы = СтрЗаменить(ИмяТаблицыФормы, " ", "");
			ИмяТаблицыФормы = СтрЗаменить(ИмяТаблицыФормы, """", "");
			ИмяТаблицыФормы = СтрЗаменить(ИмяТаблицыФормы, ".", "");
			
			СтруктураОбласти.ВерхнегоУровня = Истина;
			СтруктураОбласти.Наименование = СтрокаСтандартнойОбласти.Область83 + ИмяТаблицыФормы;
			
			Возврат СтруктураОбласти;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ИмяОбласти = "";
	Для НомерСимвола = 1 По СтрДлина(СтрокаМодуля) Цикл
		Символ = Сред(СтрокаМодуля, НомерСимвола, 1);
		ДобавляемыйСимвол = ?(апк_СловоСодержитЗначимыеСимволы(Символ), Символ, " ");
		ИмяОбласти = ИмяОбласти + ДобавляемыйСимвол;
	КонецЦикла;
	
	МассивИсключенийИменОбласти = Контекст["МассивИсключенийИменОбласти"];
	Если МассивИсключенийИменОбласти.Найти(ВРег(ИмяОбласти)) <> Неопределено Тогда
		// Имя области не может совпадать с ключевыми словами встроенного языка.
		Возврат СтруктураОбласти;
	КонецЕсли;
	
	Если ИмяОбласти = ВРег(ИмяОбласти) Тогда
		// Если имя области полностью написано в верхнем регистре,
		// то переводим все слова в имени области в титульный регистр.
		ИмяОбласти = ТРег(ИмяОбласти);
		ИмяОбласти = СтрЗаменить(ИмяОбласти, " ", "");
		СтруктураОбласти.Наименование = ИмяОбласти;
		СтруктураОбласти.ВерхнегоУровня = Истина;
		Возврат СтруктураОбласти;
	КонецЕсли;
	
	// Обрабатываем каждое слово в имени области отдельно.
	МассивСловОбласти = СтрРазделить(ИмяОбласти, " ", Ложь);
	ИмяОбласти = "";
	Для Каждого СловоОбласти Из МассивСловОбласти Цикл
		// Если отдельное слово в имени области написано в нижнем регистре,
		// то переводим все слова в имени области в титульный регистр.
		// При этом будут сохранены аббревиатуры, написанные в верхнем регистре.
		СловоОбласти = ?((СловоОбласти = НРег(СловоОбласти)) ИЛИ (СловоОбласти = ВРег(СловоОбласти) И СтрДлина(СловоОбласти) > 4), ТРег(СловоОбласти), СловоОбласти);
		ИмяОбласти = ИмяОбласти + СловоОбласти;
	КонецЦикла;
	
	СтруктураОбласти.Наименование = ИмяОбласти;
	
	Возврат СтруктураОбласти;
	
КонецФункции

Процедура ЗакрытьОбласть(ДокументТекст, НомерСтроки)
	
	ТекстКонецОбласти = НСтр("ru='#КонецОбласти'; en='#EndRegion'", КодОсновногоЯзыка);
	
	СтрокаМодуля = ДокументТекст.ПолучитьСтроку(НомерСтроки - 1);
	Если НЕ ПустаяСтрока(СтрокаМодуля) Тогда
		ДокументТекст.ВставитьСтроку(НомерСтроки, "");
		НомерСтроки = НомерСтроки + 1;
	КонецЕсли;
	
	ДокументТекст.ВставитьСтроку(НомерСтроки, ТекстКонецОбласти);
	НомерСтроки = НомерСтроки + 1;
	
	СтрокаМодуля = ДокументТекст.ПолучитьСтроку(НомерСтроки);
	Если НЕ ПустаяСтрока(СтрокаМодуля) Тогда
		ДокументТекст.ВставитьСтроку(НомерСтроки, "");
		НомерСтроки = НомерСтроки + 1;
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьЗаменуОбластей82На83(ДокументТекст)
	
	СтруктураРезультатаЗаменыОбластей = Новый Структура;
	СтруктураРезультатаЗаменыОбластей.Вставить("ОбластиЗамененыКорректно", Истина);
	СтруктураРезультатаЗаменыОбластей.Вставить("НомерСтрокиОшибки", 0);
	СтруктураРезультатаЗаменыОбластей.Вставить("ТекстОшибки", "");
	
	ШаблонОшибкиНеСовпадаетКоличествоНачалаИКонцаОбластей = НСтр("ru='
		|Ошибка: Не совпадает количество начала и конца областей после вставки
		|Наименование области: %1
		|Номер строки начала области: %2
		|Номер строки конца области: %3';
		|en='Ошибка: Не совпадает количество начала и конца областей после вставки
		|Наименование области: %1
		|Номер строки начала области: %2
		|Номер строки конца области: %3'", КодОсновногоЯзыка);
	
	ШаблонОшибкиПересечениеОбластейИИнструкций = НСтр("ru='
		|Ошибка: Инструкция препроцессору пересекается со вставкой области
		|Наименование области: %1
		|Номер строки начала области: %2
		|Номер строки конца области: %3
		|Текст инструкции: %4
		|Номер строки начала инструкции: %5
		|Номер строки конца инструкции: %6';
		|en='Ошибка: Инструкция препроцессору пересекается со вставкой области
		|Наименование области: %1
		|Номер строки начала области: %2
		|Номер строки конца области: %3
		|Текст инструкции: %4
		|Номер строки начала инструкции: %5
		|Номер строки конца инструкции: %6'", КодОсновногоЯзыка);
	
	ШаблонОшибкиНеОпределеныГраницыИнструкцийПрепроцессору = НСтр("ru='
		|Ошибка: Не определены границы инструкций препроцессору
		|Текст инструкции: %1
		|Номер строки начала инструкции: %2
		|Номер строки конца инструкции: %3';
		|en='Ошибка: Не определены границы инструкций препроцессору
		|Текст инструкции: %1
		|Номер строки начала инструкции: %2
		|Номер строки конца инструкции: %3'", КодОсновногоЯзыка);
	
	ТекстМодуля = ДокументТекст.ПолучитьТекст();
	ТаблицаИнструкцийПрепроцессора = ПолучитьТаблицуИнструкцийПрепроцессора(ТекстМодуля);
	ТаблицаОбластейМодуля = ПолучитьТаблицуОбластейМодуля83(ТекстМодуля);
	
	ТекстОшибки = "";
	НомерСтрокиОшибки = 0;
	Для Каждого СтрокаТаблицыОбластей Из ТаблицаОбластейМодуля Цикл
		
		НомерСтрокиНачалаОбласти = СтрокаТаблицыОбластей.НомерСтрокиНачало;
		НомерСтрокиКонцаОбласти = СтрокаТаблицыОбластей.НомерСтрокиКонец;
		
		Если (НомерСтрокиНачалаОбласти = Неопределено) ИЛИ (НомерСтрокиКонцаОбласти = Неопределено) Тогда
			НомерСтрокиОшибки = ?(НомерСтрокиНачалаОбласти = Неопределено, НомерСтрокиНачалаОбласти, НомерСтрокиКонцаОбласти);
			ТекстОшибки = СтрШаблон(ШаблонОшибкиНеСовпадаетКоличествоНачалаИКонцаОбластей,
				СтрокаТаблицыОбластей.Наименование,
				НомерСтрокиНачалаОбласти,
				НомерСтрокиКонцаОбласти);
			Прервать;
		КонецЕсли;
		
		Для Каждого СтрокаТаблицыИнструкцийПрепроцессора Из ТаблицаИнструкцийПрепроцессора Цикл
			
			ТекстИнструкции = СтрокаТаблицыИнструкцийПрепроцессора.ТекстИнструкции;
			
			ПозицияНачалаИнструкции = СтрокаТаблицыИнструкцийПрепроцессора.ПозицияЕсли;
			Если ПозицияНачалаИнструкции = Неопределено Тогда
				НомерСтрокиОшибки = НомерСтрокиНачалаОбласти;
				ТекстОшибки = СтрШаблон(ШаблонОшибкиНеОпределеныГраницыИнструкцийПрепроцессору,
					ТекстИнструкции,
					"",
					"");
				Прервать;
			КонецЕсли;
			
			ПозицияКонцаИнструкции = СтрокаТаблицыИнструкцийПрепроцессора.ПозицияКонецЕсли;
			Если ПозицияКонцаИнструкции = Неопределено Тогда
				НомерСтрокиОшибки = НомерСтрокиНачалаОбласти;
				ТекстОшибки = СтрШаблон(ШаблонОшибкиНеОпределеныГраницыИнструкцийПрепроцессору,
					ТекстИнструкции,
					"",
					"");
				Прервать;
			КонецЕсли;
			
			НомерСтрокиНачалаИнструкции = ПолучитьНомерСтрокиМодуля(ТекстМодуля, ПозицияНачалаИнструкции);
			НомерСтрокиКонцаИнструкции = ПолучитьНомерСтрокиМодуля(ТекстМодуля, ПозицияКонцаИнструкции);
			
			// Если вся инструкция лежит до области, то проверяем дальше.
			Если НомерСтрокиКонцаИнструкции < НомерСтрокиНачалаОбласти Тогда
				Продолжить;
			КонецЕсли;
			
			// Если вся инструкция лежит после области, то прерываем и проверяем следующую инструкцию.
			Если НомерСтрокиНачалаИнструкции > НомерСтрокиКонцаОбласти Тогда
				Прервать;
			КонецЕсли;
			
			// Иначе - если пересечение областей и инструкций, то регистрируем ошибку.
			Если ((НомерСтрокиНачалаИнструкции < НомерСтрокиНачалаОбласти) И (НомерСтрокиКонцаИнструкции < НомерСтрокиКонцаОбласти))
			 ИЛИ ((НомерСтрокиНачалаИнструкции > НомерСтрокиНачалаОбласти) И (НомерСтрокиКонцаИнструкции > НомерСтрокиКонцаОбласти)) Тогда
				НомерСтрокиОшибки = НомерСтрокиНачалаИнструкции;
				ТекстОшибки = СтрШаблон(ШаблонОшибкиПересечениеОбластейИИнструкций,
					СтрокаТаблицыОбластей.Наименование,
					НомерСтрокиНачалаОбласти,
					НомерСтрокиКонцаОбласти,
					ТекстИнструкции,
					НомерСтрокиНачалаИнструкции,
					НомерСтрокиКонцаИнструкции);
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		СтруктураРезультатаЗаменыОбластей.Вставить("ОбластиЗамененыКорректно", Ложь);
		СтруктураРезультатаЗаменыОбластей.Вставить("НомерСтрокиОшибки", НомерСтрокиОшибки);
		СтруктураРезультатаЗаменыОбластей.Вставить("ТекстОшибки", ТекстОшибки);
	КонецЕсли;
	
	Возврат СтруктураРезультатаЗаменыОбластей;
	
КонецФункции

// Функция добавляет область "ОписаниеПеременных".
//
Функция ДобавитьОбластьОписаниеПеременных(ПолноеИмяФайла, ДокументТекст)
	
	НаименованиеОбласти     = Контекст["ОбластьОписаниеПеременных"];
	НаименованиеОбластиВРег = ВРег(НаименованиеОбласти);
	НаименованиеОбластиВРег = СтрЗаменить(НаименованиеОбластиВРег, " ", "");
	
	ТекстМодуля = ДокументТекст.ПолучитьТекст();
	ТекстМодуля = ВРег(ТекстМодуля);
	ТекстМодуля = СтрЗаменить(ТекстМодуля, Символы.Таб, "");
	ТекстМодуля = СтрЗаменить(ТекстМодуля, " ", "");
	
	// Проверяем наличие области в модуле, если есть, выходим.
	Если СтрНайти(ТекстМодуля, НаименованиеОбластиВРег + Символы.ПС) > 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Проверяем раздел объявления переменных, если нет, то выходим.
	ТекстПерем = Контекст["ТекстПерем"];
	Если СтрНайти(ТекстМодуля, ТекстПерем) = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
#Область ПроверкаСуществующейОбластиОписанияПеременных
	
	// Проверим существующие области инициализации.
	ТаблицаОбластей = Новый ТаблицаЗначений;
	ТаблицаОбластей.Колонки.Добавить("Область");
	ТаблицаОбластей.Колонки.Добавить("Найдена");
	ТаблицаОбластей.Колонки.Добавить("НомерСтроки");
	
	ТаблицаОбластей.Добавить().Область = "#Область СостояниеОбъекта";
	ТаблицаОбластей.Добавить().Область = НСтр("ru='#Область ЛокальныеПеременные'; en='#Region LocalVariables'", КодОсновногоЯзыка);
	ТаблицаОбластей.Добавить().Область = "#Область ВнутреннееСостояние";
	ТаблицаОбластей.Добавить().Область = НСтр("ru='#Область ОбъявлениеПеременных'; en='#Region Variables'", КодОсновногоЯзыка);
	
	ТаблицаОбластей.ЗаполнитьЗначения(Ложь, "Найдена");
	ТаблицаОбластей.ЗаполнитьЗначения(0, "НомерСтроки");
	
	Для Каждого СтрокаОбласти Из ТаблицаОбластей Цикл
		
		ОбластьИнициализации = СтрокаОбласти.Область;
		ОбластьИнициализации = СтрЗаменить(ОбластьИнициализации, " ", "");
		ОбластьИнициализации = ВРег(ОбластьИнициализации);
		
		// Если не найдена, продолжаем.
		НомерСимвола = СтрНайти(ТекстМодуля, ОбластьИнициализации + Символы.ПС);
		Если НомерСимвола = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Получаем номер строки.
		ТекстДоСимвола = Лев(ТекстМодуля, НомерСимвола);
		НомерСтроки = СтрЧислоСтрок(ТекстДоСимвола);
		
		СтрокаОбласти.Найдена = Истина;
		СтрокаОбласти.НомерСтроки = НомерСтроки;
		
	КонецЦикла;
	
	// Если найдена только 1 область из таблицы, то заменяем ее и выходим.
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Найдена", Истина);
	
	МассивОбластей = ТаблицаОбластей.НайтиСтроки(СтруктураОтбора);
	Если МассивОбластей.Количество() = 1 Тогда
		НомерСтроки = МассивОбластей[0].НомерСтроки;
		ДокументТекст.ЗаменитьСтроку(НомерСтроки, НаименованиеОбласти);
		
		Возврат Истина;
	КонецЕсли;
	
#КонецОбласти
	
#Область ДобавлениеОбластиОписаниеПеременных
	
	ТекстОбласть      = Контекст["ТекстОбласть"];
	ТекстКонецОбласти = Контекст["ТекстКонецОбласти"];
	
	КоличествоСтрок = ДокументТекст.КоличествоСтрок();
	
	ОбластьОткрыта = Ложь;
	НайденоОписаниеПеременных = Ложь;
	МногострочноеОпределениеПеременных = Ложь;
	
	СтруктураНомераСтрок = Новый Структура;
	СтруктураНомераСтрок.Вставить("НачалоОписания", 0);
	СтруктураНомераСтрок.Вставить("ДирективаПеременной", 0);
	СтруктураНомераСтрок.Вставить("ДирективаМетода", 0);
	СтруктураНомераСтрок.Вставить("ПервыйКомментарий", 0);
	СтруктураНомераСтрок.Вставить("НачалоМетода", 0);
	СтруктураНомераСтрок.Вставить("ПерваяОбласть", 0);
	СтруктураНомераСтрок.Вставить("ПоследняяОбласть", 0);
	
	СтруктураНомераСтрок.Вставить("ПустаяСтрокаПередПеременной", 0);
	СтруктураНомераСтрок.Вставить("ПустаяСтрокаПослеПеременной", 0);
	
	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		
		СтрокаМодуляИсходная = ДокументТекст.ПолучитьСтроку(НомерСтроки);
		
		Если ПустаяСтрока(СтрокаМодуляИсходная) Тогда
			// Описание переменных найдено, запоминаем первую пустую строку.
			Если НайденоОписаниеПеременных Тогда
				Если СтруктураНомераСтрок.ПустаяСтрокаПослеПеременной = 0 Тогда
					// Номер строки увеличен на 1, чтобы вставлять конец область ниже пустой строки.
					СтруктураНомераСтрок.ПустаяСтрокаПослеПеременной = НомерСтроки + 1;
				КонецЕсли;
			Иначе
				// Номер строки увеличен на 1, чтобы вставлять область ниже пустой строки.
				СтруктураНомераСтрок.ПустаяСтрокаПередПеременной = НомерСтроки + 1;
				// Если не было переменных и появилась пустая строка, то сбрасываем номер строки с комментарием.
				СтруктураНомераСтрок.ПервыйКомментарий = 0;
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		СтрокаМодуля = СокрЛП(СтрокаМодуляИсходная);
		СтрокаМодуля = ВРег(СтрокаМодуля);
		СтрокаМодуля = СтрЗаменить(СтрокаМодуля, Символы.Таб, " ");
		// Добавляем пробел в конец строки, чтобы искать конструкции с пробелом, например, "Перем ".
		// Иначе это может быть, например, наименование переменной "Переменная1" на следующей строке.
		СтрокаМодуля = СтрокаМодуля + " ";
		
		// Над переменной могут быть директивы.
		Если СтрНачинаетсяС(СтрокаМодуля, "&") Тогда
			// Если описание переменных уже было, то вероятнее всего это директива от следующего метода.
			Если НайденоОписаниеПеременных Тогда
				СтруктураНомераСтрок.ДирективаМетода = НомерСтроки;
			КонецЕсли;
			
			// Если директив еще не было, то запоминаем номер строки первой директивы.
			Если СтруктураНомераСтрок.ДирективаПеременной = 0 Тогда
				СтруктураНомераСтрок.ДирективаПеременной = НомерСтроки;
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		// Если строка начинается с описания переменной, запоминаем.
		Если СтрНачинаетсяС(СтрокаМодуля, ТекстПерем) Тогда
			// Если переменных еще не было, то запоминаем номер строки начала описания.
			Если НЕ НайденоОписаниеПеременных Тогда
				СтруктураНомераСтрок.НачалоОписания = НомерСтроки;
				НайденоОписаниеПеременных = Истина;
			КонецЕсли;
			
			// Если в строке нет ";", то это многострочное описание переменных.
			Если СтрНайти(СтрокаМодуля, ";") = 0 Тогда
				МногострочноеОпределениеПеременных = Истина;
			КонецЕсли;
			
			// Если найдена очередная переменная, сбрасываем пустую строку после предыдущей переменной.
			СтруктураНомераСтрок.ПустаяСтрокаПослеПеременной = 0;
			
			Продолжить;
		КонецЕсли;
		
		// Запоминаем номера строк комментариев.
		Если СтрНачинаетсяС(СтрокаМодуля, "//") Тогда
			// Запоминаем номер строки комментария, относящегося к самой первой переменной.
			// Если после комментария идет пустая строка, то номер строки первого комментария сбрасывается (в начале цикла).
			Если СтруктураНомераСтрок.ПервыйКомментарий = 0 Тогда
				СтруктураНомераСтрок.ПервыйКомментарий = НомерСтроки;
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		// Области обрабатываем, инструкции препроцессору пропускаем.
		Если СтрНачинаетсяС(СтрокаМодуля, "#") Тогда
			// Если это область, установим некоторые значения.
			Если СтрНачинаетсяС(СтрокаМодуля, ТекстОбласть) Тогда
				// Запомним, что область открыта.
				Если НЕ НайденоОписаниеПеременных Тогда
					ОбластьОткрыта = Истина;
				КонецЕсли;
				
				// Если переменных не было, и началась область, запомним.
				Если СтруктураНомераСтрок.ПерваяОбласть = 0 Тогда
					СтруктураНомераСтрок.ПерваяОбласть = НомерСтроки;
				КонецЕсли;
				
				// Запоминаем номер строки области.
				СтруктураНомераСтрок.ПоследняяОбласть = НомерСтроки;
			КонецЕсли;
			
			// Если это конец области, закроем область.
			Если СтрНачинаетсяС(СтрокаМодуля, ВРег(ТекстКонецОбласти)) Тогда
				ОбластьОткрыта = Ложь;
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		// Если это многострочное определение переменных, то проверим, что оно закончилось.
		Если МногострочноеОпределениеПеременных Тогда
			Если СтрНайти(СтрокаМодуля, ";") > 0 Тогда
				МногострочноеОпределениеПеременных = Ложь;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		// Встретили начало метода или код, тогда выходим из цикла.
		СтруктураНомераСтрок.НачалоМетода = НомерСтроки;
		Прервать;
		
	КонецЦикла;
	
	// Не найдено описание переменных в начале модуля, выходим.
	Если НЕ НайденоОписаниеПеременных Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Если в области есть переменные и методы, то это ошибка, не обрабатываем.
	Если ОбластьОткрыта Тогда
		ТекстИсключения = НСтр("ru='Объявление переменной находится в одной области с процедурой, функцией или кодом: %Строка%';
			|en='Объявление переменной находится в одной области с процедурой, функцией или кодом: %Строка%'", КодОсновногоЯзыка);
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%Строка%", СтрокаМодуляИсходная);
		ОбработатьИсключение(ПолноеИмяФайла, ТекстИсключения, НомерСтроки);
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого Элемент Из СтруктураНомераСтрок Цикл
		Если Элемент.Значение = 0 Тогда
			СтруктураНомераСтрок.Вставить(Элемент.Ключ, КоличествоСтрок + 1);
		КонецЕсли;
	КонецЦикла;
	
	// Вычисляем номер строки начала описания.
	// Выбираем между началом области переменных, комментарием и директивой перед первой переменной и первой областью.
	НомерСтрокиНачалаОбласти = Мин(
		СтруктураНомераСтрок.НачалоОписания,
		СтруктураНомераСтрок.ПустаяСтрокаПередПеременной,
		СтруктураНомераСтрок.ПервыйКомментарий,
		СтруктураНомераСтрок.ДирективаПеременной,
		СтруктураНомераСтрок.ПерваяОбласть);
	
	// Вычисляем номер строки конца описания.
	// Выбираем между пустой строкой и областью после последней переменной, директивой и началом метода.
	НомерСтрокиКонцаОбласти = Мин(
		СтруктураНомераСтрок.ПустаяСтрокаПослеПеременной,
		СтруктураНомераСтрок.ПоследняяОбласть,
		СтруктураНомераСтрок.ДирективаМетода,
		СтруктураНомераСтрок.НачалоМетода);
	
	ДокументТекст.ВставитьСтроку(НомерСтрокиКонцаОбласти, ТекстКонецОбласти);
	ДокументТекст.ВставитьСтроку(НомерСтрокиКонцаОбласти + 1, "");
	
	ДокументТекст.ВставитьСтроку(НомерСтрокиНачалаОбласти, НаименованиеОбласти);
	ДокументТекст.ВставитьСтроку(НомерСтрокиНачалаОбласти + 1, "");
	
#КонецОбласти
	
	Возврат Истина;
	
КонецФункции

// Функция добавляет область "Инициализация".
//
Функция ДобавитьОбластьИнициализация(ДокументТекст)
	
	НаименованиеОбласти     = Контекст["ОбластьИнициализация"];
	НаименованиеОбластиВРег = ВРег(НаименованиеОбласти);
	НаименованиеОбластиВРег = СтрЗаменить(НаименованиеОбластиВРег, " ", "");
	
	ТекстМодуля = ДокументТекст.ПолучитьТекст();
	ТекстМодуля = ВРег(ТекстМодуля);
	ТекстМодуля = СтрЗаменить(ТекстМодуля, Символы.Таб, "");
	ТекстМодуля = СтрЗаменить(ТекстМодуля, " ", "");
	
	// Проверяем наличие области в модуле, если есть, выходим.
	Если СтрНайти(ТекстМодуля, НаименованиеОбластиВРег + Символы.ПС) > 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
#Область ПроверкаСуществующейОбластиИнициализации
	
	// Проверим существующие области инициализации.
	МассивОбластейИнициализации = Новый Массив;
	МассивОбластейИнициализации.Добавить("#Область ОператорыОсновнойПрограммы");
	МассивОбластейИнициализации.Добавить("#Область НачальнаяИнициализация");
	МассивОбластейИнициализации.Добавить("#Область Инициализации");
	МассивОбластейИнициализации.Добавить("#Область ИнициализацияОбъекта");
	
	НайденаСуществующаяОбласть = Ложь;
	
	Для Каждого ЭлементОбласти Из МассивОбластейИнициализации Цикл
		
		ОбластьИнициализации = ЭлементОбласти;
		ОбластьИнициализации = СтрЗаменить(ОбластьИнициализации, " ", "");
		ОбластьИнициализации = ВРег(ОбластьИнициализации);
		
		// Если не найдена, продолжаем.
		НомерСимвола = СтрНайти(ТекстМодуля, ОбластьИнициализации);
		Если НомерСимвола = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Если нашли область, проверяем, что это действительно область, т.е. выделена в отдельную строку.
		ТекстДоСимвола = Лев(ТекстМодуля, НомерСимвола);
		НомерСтроки = СтрЧислоСтрок(ТекстДоСимвола);
		
		СтрокаМодуля = ДокументТекст.ПолучитьСтроку(НомерСтроки);
		СтрокаМодуля = ВРег(СтрокаМодуля);
		СтрокаМодуля = СтрЗаменить(СтрокаМодуля, " ", "");
		СтрокаМодуля = СтрЗаменить(СтрокаМодуля, Символы.Таб, "");
		
		Если ОбластьИнициализации = СтрокаМодуля Тогда
			ДокументТекст.ЗаменитьСтроку(НомерСтроки, НаименованиеОбласти);
			НайденаСуществующаяОбласть = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НайденаСуществующаяОбласть Тогда
		Возврат Истина;
	КонецЕсли;
	
#КонецОбласти
	
#Область ДобавлениеОбластиИнициализация
	
	ТекстПерем                       = Контекст["ТекстПерем"];
	МассивТекстКонецПроцедурыФункции = Контекст["МассивТекстКонецПроцедурыФункции"];
	ТекстОбласть                     = Контекст["ТекстОбласть"];
	ТекстКонецОбласти                = Контекст["ТекстКонецОбласти"];
	
	// Здесь перечисляем операторы по одной строке, которые допустимо писать вне области "#Инициализация".
	МассивИсключенийОператоров = Новый Массив;
	
	// Этот вызов исключения должен быть написан в конце каждого модуля объекта в виде кода с инструкцией препроцессора,
	// область "#Инициализация" при этом добавлять не обязательно.
	//#Иначе
	//ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	//#КонецЕсли
	МассивИсключенийОператоров.Добавить("ВызватьИсключение НСтр(""ru = 'Недопустимый вызов объекта на клиенте.'"");");
	МассивИсключенийОператоров.Добавить("Raise NStr(""en = 'Invalid object call on the client.'"");");
	МассивИсключенийОператоров.Добавить("ВызватьИсключение НСтр(""ru = 'Недопустимый вызов объекта на клиенте.';");
	МассивИсключенийОператоров.Добавить("|en = 'Nedopustimiy vizov obyekta na kliente.'"")");
	
	ИндексИсключения = -1;
	Для Каждого ИсключениеОператора Из МассивИсключенийОператоров Цикл
		
		// Уберем лишние символы.
		ИсключениеОператора = ВРег(ИсключениеОператора);
		ИсключениеОператора = СтрЗаменить(ИсключениеОператора, " ", "");
		ИсключениеОператора = СтрЗаменить(ИсключениеОператора, Символы.Таб, "");
		ИсключениеОператора = СтрЗаменить(ИсключениеОператора, ";", "");
		
		ИндексИсключения = ИндексИсключения + 1;
		МассивИсключенийОператоров[ИндексИсключения] = ИсключениеОператора;
		
	КонецЦикла;
	
	КоличествоСтрок = ДокументТекст.КоличествоСтрок();
	
	ОбластьОткрыта = Ложь;
	НайденыОператоры = Ложь;
	СчетчикОбластей = 0;
	
	СтруктураНомераСтрок = Новый Структура;
	СтруктураНомераСтрок.Вставить("НачалоОператоров", 0);
	СтруктураНомераСтрок.Вставить("КонецОператоров", 0);
	СтруктураНомераСтрок.Вставить("ПервыйКомментарий", 0);
	
	СтруктураНомераСтрок.Вставить("НачалоОбласти", 0);
	
	Для НомерСтрокиСНачала = 1 По КоличествоСтрок Цикл
		
		НомерСтроки = КоличествоСтрок - НомерСтрокиСНачала + 1;
		СтрокаМодуляИсходная = ДокументТекст.ПолучитьСтроку(НомерСтроки);
		
		Если ПустаяСтрока(СтрокаМодуляИсходная) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаМодуля = СокрЛП(СтрокаМодуляИсходная);
		СтрокаМодуля = ВРег(СтрокаМодуля);
		СтрокаМодуля = СтрЗаменить(СтрокаМодуля, Символы.Таб, " ");
		// Добавляем пробел в конец строки, чтобы искать конструкции с пробелом, например, "Перем ".
		// Иначе это может быть, например, наименование переменной "Переменная1" на следующей строке.
		СтрокаМодуля = СтрокаМодуля + " ";
		
		// Если встретилось описание переменной, то прерываем.
		Если СтрНачинаетсяС(СтрокаМодуля, ТекстПерем) Тогда
			Прервать;
		КонецЕсли;
		
		// Обрабатываем комментарий.
		Если СтрНачинаетсяС(СтрокаМодуля, "//") Тогда
			// Если операторы найдены, запоминаем самый первый комментарий.
			Если НайденыОператоры Тогда
				СтруктураНомераСтрок.ПервыйКомментарий = НомерСтроки;
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		// Области обрабатываем, инструкции препроцессору пропускаем.
		Если СтрНачинаетсяС(СтрокаМодуля, "#") Тогда
			// Т.к. строки обрабатываются с конца, если это начало области, то уменьшим счетчик областей.
			Если СтрНачинаетсяС(СтрокаМодуля, ТекстОбласть) Тогда
				СчетчикОбластей = СчетчикОбластей - 1;
				СтруктураНомераСтрок.НачалоОбласти = НомерСтроки;
				
				Если СчетчикОбластей = 0 Тогда
					ОбластьОткрыта = Ложь;
				КонецЕсли;
			КонецЕсли;
			
			// Если это конец области, то увеличим счетчик областей.
			Если СтрНачинаетсяС(СтрокаМодуля, ВРег(ТекстКонецОбласти)) Тогда
				СчетчикОбластей = СчетчикОбластей + 1;
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		Если СтрНачинаетсяСПоМассиву(СтрокаМодуля, МассивТекстКонецПроцедурыФункции).Успешно Тогда
			Прервать;
		КонецЕсли;
		
		// Проверяем среди исключений операторов.
		ЭтоИсключениеОператора = Ложь;
		СтрокаМодуляДляПроверкиИсключения = СтрокаМодуля;
		СтрокаМодуляДляПроверкиИсключения = СтрЗаменить(СтрокаМодуляДляПроверкиИсключения, " ", "");
		СтрокаМодуляДляПроверкиИсключения = СтрЗаменить(СтрокаМодуляДляПроверкиИсключения, ";", "");
		
		Для Каждого ИсключениеОператора Из МассивИсключенийОператоров Цикл
			Если ИсключениеОператора = СтрокаМодуляДляПроверкиИсключения Тогда
				ЭтоИсключениеОператора = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЭтоИсключениеОператора Тогда
			Продолжить;
		КонецЕсли;
		
		// Встретили код, тогда запоминаем номер строки.
		Если НЕ НайденыОператоры Тогда
			НайденыОператоры = Истина;
			СтруктураНомераСтрок.КонецОператоров = НомерСтроки;
		КонецЕсли;
		
		СтруктураНомераСтрок.НачалоОператоров = НомерСтроки;
		ОбластьОткрыта = (СчетчикОбластей <> 0);
		
	КонецЦикла;
	
	// Не найдены операторы в конце модуля, выходим.
	Если НЕ НайденыОператоры Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Если в области есть операторы и методы, то это ошибка, не обрабатываем.
	Если ОбластьОткрыта Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого Элемент Из СтруктураНомераСтрок Цикл
		Если Элемент.Значение = 0 Тогда
			СтруктураНомераСтрок.Вставить(Элемент.Ключ, КоличествоСтрок + 1);
		КонецЕсли;
	КонецЦикла;
	
	// Вычисляем номер строки начала операторов.
	НомерСтрокиНачалаОбласти = Мин(
		СтруктураНомераСтрок.НачалоОператоров,
		СтруктураНомераСтрок.НачалоОбласти,
		СтруктураНомераСтрок.ПервыйКомментарий);
	
	// Вычисляем номер строки конца операторов.
	НомерСтрокиКонцаОбласти = СтруктураНомераСтрок.КонецОператоров;
	
	ДокументТекст.ВставитьСтроку(НомерСтрокиКонцаОбласти + 1, "");
	ДокументТекст.ВставитьСтроку(НомерСтрокиКонцаОбласти + 2, ТекстКонецОбласти);
	
	ДокументТекст.ВставитьСтроку(НомерСтрокиНачалаОбласти, НаименованиеОбласти);
	ДокументТекст.ВставитьСтроку(НомерСтрокиНачалаОбласти + 1, "");
	
#КонецОбласти
	
#Область УдалениеОбластиИнициализацияВВидеКомментария
	
	ТекстМодуля = ДокументТекст.ПолучитьТекст();
	ТекстМодуля = ВРег(ТекстМодуля);
	ТекстМодуля = СтрЗаменить(ТекстМодуля, Символы.Таб, "");
	ТекстМодуля = СтрЗаменить(ТекстМодуля, " ", "");
	
	МассивКомментариев = Новый Массив;
	МассивКомментариев.Добавить("// Операторы основной программы");
	МассивКомментариев.Добавить("// Раздел инициализации");
	
	Для Каждого ЭлементМассива Из МассивКомментариев Цикл
		
		СтрокаКомментария = ВРег(ЭлементМассива);
		СтрокаКомментария = СтрЗаменить(СтрокаКомментария, " ", "");
		
		НомерСимвола = СтрНайти(ТекстМодуля, СтрокаКомментария);
		Если НомерСимвола = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Если нашли комментарий, проверяем его.
		ТекстДоСимвола = Лев(ТекстМодуля, НомерСимвола);
		НомерСтроки = СтрЧислоСтрок(ТекстДоСимвола);
		
		СтрокаМодуля = ДокументТекст.ПолучитьСтроку(НомерСтроки);
		СтрокаМодуля = ВРег(СтрокаМодуля);
		СтрокаМодуля = СтрЗаменить(СтрокаМодуля, " ", "");
		СтрокаМодуля = СтрЗаменить(СтрокаМодуля, Символы.Таб, "");
		СтрокаМодуля = СтрЗаменить(СтрокаМодуля, ".", "");
		
		Если СтрокаКомментария <> СтрокаМодуля Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументТекст.УдалитьСтроку(НомерСтроки);
		НомерСтроки = НомерСтроки - 1;
		
		// Проверим предыдущую строку, если она состоит только их символов "/", тогда удалим ее.
		СтрокаМодуля = ДокументТекст.ПолучитьСтроку(НомерСтроки);
		СтрокаМодуля = СтрЗаменить(СтрокаМодуля, "/", "");
		Если НЕ ПустаяСтрока(СтрокаМодуля) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументТекст.УдалитьСтроку(НомерСтроки);
		
		// Как правило остается несколько пустых строк подряд, оставим только одну пустую строку.
		СтрокаМодуля = ДокументТекст.ПолучитьСтроку(НомерСтроки);
		Если НЕ ПустаяСтрока(СтрокаМодуля) Тогда
			Продолжить;
		КонецЕсли;
		
		Пока Истина Цикл
			
			НомерСтроки = НомерСтроки - 1;
			СтрокаМодуля = ДокументТекст.ПолучитьСтроку(НомерСтроки);
			
			Если НЕ ПустаяСтрока(СтрокаМодуля) Тогда
				Прервать;
			КонецЕсли;
			
			ДокументТекст.УдалитьСтроку(НомерСтроки);
			
		КонецЦикла;
		
	КонецЦикла;
	
#КонецОбласти
	
	Возврат Истина;
	
КонецФункции

Функция ПроверкаОператоровСКрайнейЛевойПозиции(ДокументТекст)
	
	ФайлИзменен = Ложь;
	
	МассивОператоров = Новый Массив;
	МассивОператоров.Добавить("КонецПроцедуры");
	МассивОператоров.Добавить("КонецФункции");
	МассивОператоров.Добавить("Процедура");
	МассивОператоров.Добавить("Функция");
	МассивОператоров.Добавить("EndProcedure");
	МассивОператоров.Добавить("EndFunction");
	МассивОператоров.Добавить("Procedure");
	МассивОператоров.Добавить("Function");
	
	МассивДирективИнструкций = Новый Массив;
	МассивДирективИнструкций.Добавить("#");
	МассивДирективИнструкций.Добавить("&");
	
	МассивТекстПерем = Новый Массив;
	МассивТекстПерем.Добавить("Перем");
	МассивТекстПерем.Добавить("Var");
	
	ДлинаСловаКонец = ?(КодОсновногоЯзыка = "ru", 5, 3);
	
	ЗакончилсяБлокПеременных = Ложь;
	КоличествоСтрок = ДокументТекст.КоличествоСтрок();
	ПозицияНеВнутриМетода = Истина;
	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		
		СтрокаМодуляИсходная = ДокументТекст.ПолучитьСтроку(НомерСтроки);
		
		// Пропускаем пустые строки.
		Если ПустаяСтрока(СтрокаМодуляИсходная) Тогда
			Продолжить;
		КонецЕсли;
		
		// Пропускаем комментарии.
		СтрокаМодуля = СокрЛП(СтрокаМодуляИсходная);
		Если СтрНачинаетсяС(СтрокаМодуля, "//") Тогда
			Продолжить;
		КонецЕсли;
		
		// Проверяем операторы "Процедура", "КонецПроцедуры", "Функция", "КонецФункции".
		СтрокаМодуля = ВРег(СтрокаМодуляИсходная);
		УбратьСимволыВНачалеСтроки = Ложь;
		ВхождениеНайдено = Ложь;
		
		Для Каждого ТекущийОператор Из МассивОператоров Цикл
			
			ПозицияОператора = СтрНайти(СтрокаМодуля, ТекущийОператор);
			
			// Если текста оператора нет в строке, пропускаем.
			Если ПозицияОператора = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СловоКонец = Лев(ТекущийОператор, ДлинаСловаКонец);
			ФлагКонецМетода = (СловоКонец = "КОНЕЦ") ИЛИ (СловоКонец = "END");
			
			// Проверяем первый символ после текста оператора.
			СимволПослеОператора = Сред(СтрокаМодуля, ПозицияОператора + СтрДлина(ТекущийОператор), 1);
			
			// Если строка не пустая, то это вхождение текста не является оператором.
			// Для операторов "КонецФункции" и "КонецПроцедуры" следующим символом может быть ";".
			Если ФлагКонецМетода Тогда
				Если НЕ ПустаяСтрока(СимволПослеОператора) И СимволПослеОператора <> ";" Тогда
					Продолжить;
				КонецЕсли;
			Иначе
				Если НЕ ПустаяСтрока(СимволПослеОператора) Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			// Проверяем строку перед текстом оператора.
			СтрокаДо = Лев(СтрокаМодуля, ПозицияОператора - 1);
			
			// Если строка не пустая, то это вхождение текста не является оператором.
			Если НЕ ПустаяСтрока(СтрокаДо) Тогда
				Продолжить;
			КонецЕсли;
			
			
			// Если строка начинается с оператора, сдвигать влево не нужно.
			Если ПозицияОператора > 1 Тогда
				УбратьСимволыВНачалеСтроки = Истина;
			КонецЕсли;
			
			// Проставляем флаг того, что мы находимся внутри функции для корректного сдвига областей.
			Если ФлагКонецМетода Тогда
				ПозицияНеВнутриМетода = Истина;
			Иначе
				ПозицияНеВнутриМетода = Ложь;
			КонецЕсли;
			
			ЗакончилсяБлокПеременных = Истина;
			ВхождениеНайдено = Истина;
			Прервать;
			
		КонецЦикла;
		
		Если УбратьСимволыВНачалеСтроки Тогда
			НоваяСтрока = СокрЛ(СтрокаМодуляИсходная);
			ДокументТекст.ЗаменитьСтроку(НомерСтроки, НоваяСтрока);
			ФайлИзменен = Истина;
			Продолжить;
		КонецЕсли;
		
		Если ВхождениеНайдено Тогда
			Продолжить;
		КонецЕсли;
		
		
		// Проверяем объявление переменных модуля Перем.
		Если НЕ ЗакончилсяБлокПеременных Тогда
			
			УбратьСимволыВНачалеСтроки = Ложь;
			ВхождениеНайдено = Ложь;
			
			РезультатПоиска = СтрНайтиПоМассиву(СтрокаМодуля, МассивТекстПерем,,,Истина);
			ПозицияОператора = РезультатПоиска.Позиция;
			ТекстПерем = РезультатПоиска.НайденныйЭлемент;
			
			Если ПозицияОператора = 1 Тогда
				
				// Если строка начинается с оператора Перем, ничего менять не нужно.
				ВхождениеНайдено = Истина;
				
			ИначеЕсли ПозицияОператора > 1 Тогда
				
				// Проверяем строку перед текстом оператора и символ после.
				СтрокаДо = Лев(СтрокаМодуля, ПозицияОператора - 1);
				СимволПослеОператора = Сред(СтрокаМодуля, ПозицияОператора + СтрДлина(ТекстПерем), 1);
				
				// Если строка до текста оператора пустая и первый символ после него незначащий, то это вхождение оператора.
				Если ПустаяСтрока(СтрокаДо) Тогда
					ВхождениеНайдено = Истина;
					Если ПустаяСтрока(СимволПослеОператора) Тогда
						УбратьСимволыВНачалеСтроки = Истина;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
			Если УбратьСимволыВНачалеСтроки Тогда
				НоваяСтрока = СокрЛ(СтрокаМодуляИсходная);
				ДокументТекст.ЗаменитьСтроку(НомерСтроки, НоваяСтрока);
				ФайлИзменен = Истина;
				Продолжить;
			КонецЕсли;
			
			Если ВхождениеНайдено Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		
		// Проверяем директивы компилятора (&НаКлиенте, &НаСервере и т.д.)
		// и инструкции препроцессора (#Область, #КонецОбласти).
		ИзмененнаяСтрока = СтрокаМодуляИсходная;
		СтрокаИзменена = Ложь;
		
		Для Каждого ТекущийСимвол Из МассивДирективИнструкций Цикл
			
			ПозицияСимвола = СтрНайти(СтрокаМодуля, ТекущийСимвол);
			
			// Если символа нет в строке, пропускаем.
			Если ПозицияСимвола = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			// Проверяем строку перед текстом оператора.
			СтрокаДо = Лев(СтрокаМодуля, ПозицияСимвола - 1);
			// Если строка не пустая, то это вхождение текста не является директивой или инструкцией.
			Если НЕ ПустаяСтрока(СтрокаДо) Тогда
				Продолжить;
			КонецЕсли;
			
			// Проверяем незначащие символы после искомого текста.
			ПозицияТекущегоСимвола = ПозицияСимвола + 1;
			НуженСдвигВлево = Ложь;
			
			Пока Истина Цикл
				
				// Если дошли до конца строки, выходим из цикла.
				Если ПозицияТекущегоСимвола > СтрДлина(СтрокаМодуля) Тогда
					Прервать;
				КонецЕсли;
				
				СимволВСтроке = Сред(СтрокаМодуля, ПозицияТекущегоСимвола, 1);
				ПозицияТекущегоСимвола = ПозицияТекущегоСимвола + 1;
				
				// Если встретили значащий символ или дошли до конца строки, прерываем цикл.
				Если НЕ ПустаяСтрока(СимволВСтроке) Тогда
					Прервать;
				КонецЕсли;
				
				ИзмененнаяСтрока = СтрокаДо + ТекущийСимвол + Прав(ИзмененнаяСтрока, СтрДлина(ИзмененнаяСтрока) - 2 - СтрДлина(СтрокаДо));
				
				СтрокаИзменена = Истина;
				
			КонецЦикла;
			
			// Убираем незначащие символы слева, если это необходимо.
			Если ПозицияСимвола > 1 Тогда
				
				Если ТекущийСимвол = "#" Тогда
					
					НуженСдвигВлево = ПозицияНеВнутриМетода;
					
				ИначеЕсли ТекущийСимвол = "&" Тогда
					
					НуженСдвигВлево = Истина;
					
				КонецЕсли;
				
				Если НуженСдвигВлево Тогда
					ИзмененнаяСтрока = СокрЛ(ИзмененнаяСтрока);
					СтрокаИзменена = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если СтрокаИзменена Тогда
			ДокументТекст.ЗаменитьСтроку(НомерСтроки, ИзмененнаяСтрока);
			ФайлИзменен = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ФайлИзменен;
	
КонецФункции

Функция УдалитьПустыеОбластиНижнегоУровня(ДокументТекст)
	
	ФайлИзменен = Ложь;
	
	КоличествоСтрок = ДокументТекст.КоличествоСтрок();
	Если КоличествоСтрок = 0 Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	ДеревоОбластей = Новый ДеревоЗначений;
	ДеревоОбластей.Колонки.Добавить("ЭтоОбласть");
	ДеревоОбластей.Колонки.Добавить("НомерСтрокиНачало");
	ДеревоОбластей.Колонки.Добавить("НомерСтрокиКонец");
	
	МассивТекстОбласть      = Контекст["МассивТекстОбласть"];
	МассивТекстКонецОбласти = Контекст["МассивТекстКонецОбласти"];
	
	ТекущаяОбласть = ДеревоОбластей.Строки.Добавить();
	ТекущаяОбласть.ЭтоОбласть = Ложь;
	ТекущаяОбласть.НомерСтрокиНачало = 0;
	ТекущаяОбласть.НомерСтрокиКонец = 0;
	
	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		
		СтрокаМодуля = ДокументТекст.ПолучитьСтроку(НомерСтроки);
		
		// Пропускаем пустые строки.
		Если ПустаяСтрока(СтрокаМодуля) Тогда
			Продолжить;
		КонецЕсли;
		
		// Пропускаем комментарии.
		СтрокаМодуля = СокрЛ(СтрокаМодуля);
		Если СтрНачинаетсяС(СтрокаМодуля, "//") Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаМодуля = СтрЗаменить(СтрокаМодуля, " ", "");
		СтрокаМодуля = СтрЗаменить(СтрокаМодуля, Символы.Таб, "");
		СтрокаМодуля = ВРег(СтрокаМодуля);
		
		// Проверяем, что находится в начале строки.
		Если СтрНачинаетсяСПоМассиву(СтрокаМодуля, МассивТекстОбласть).Успешно Тогда
			// Если область, то добавляем строку в дерево областей.
			ТекущаяОбласть = ТекущаяОбласть.Строки.Добавить();
			ТекущаяОбласть.ЭтоОбласть = Истина;
			ТекущаяОбласть.НомерСтрокиНачало = НомерСтроки;
		ИначеЕсли СтрНачинаетсяСПоМассиву(СтрокаМодуля, МассивТекстКонецОбласти).Успешно Тогда
			// Если конец области, то закрываем текущую область в дереве областей.
			ТекущаяОбласть.НомерСтрокиКонец = НомерСтроки;
			
			// Переопределяем текущую область как родителя области.
			СтрокаРодителя = ТекущаяОбласть.Родитель;
			Если СтрокаРодителя <> Неопределено Тогда
				// Устанавливаем родителя, если это не корень дерева значений.
				ТекущаяОбласть = СтрокаРодителя;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДеревоОбластей.Строки.Количество() = 0 Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	// Получим таблицу областей из дерева значений.
	ТаблицаОбластей = Новый ТаблицаЗначений;
	ТаблицаОбластей.Колонки.Добавить("НомерСтрокиНачало");
	ТаблицаОбластей.Колонки.Добавить("НомерСтрокиКонец");
	
	// Заполним массив всеми строками дерева значений.
	ПараметрыОтбора = Новый Структура("ЭтоОбласть", Истина);
	МассивСтрокОбластей = ДеревоОбластей.Строки.НайтиСтроки(ПараметрыОтбора, Истина);
	
	// Заполним таблицу областей по массиву строк дерева значений.
	Для Каждого СтрокаОбласти Из МассивСтрокОбластей Цикл
		НоваяОбласть = ТаблицаОбластей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяОбласть, СтрокаОбласти);
		
		Если НЕ ЗначениеЗаполнено(НоваяОбласть.НомерСтрокиКонец) Тогда
			НоваяОбласть.НомерСтрокиКонец = КоличествоСтрок;
		КонецЕсли;
	КонецЦикла;
	
	// Добавим колонку - флаг пустоты области.
	ТаблицаОбластей.Колонки.Добавить("ОбластьПустая");
	
	// Заполним колонку "ОбластьПустая" по тексту документа.
	Для Каждого СтрокаОбласти Из ТаблицаОбластей Цикл
		
		НомерСтрокиНачало = СтрокаОбласти.НомерСтрокиНачало;
		НомерСтрокиКонец = СтрокаОбласти.НомерСтрокиКонец;
		
		ОбластьПустая = Истина;
		Для НомерСтроки = НомерСтрокиНачало + 1 По НомерСтрокиКонец - 1 Цикл
			
			СтрокаМодуляИсходная = ДокументТекст.ПолучитьСтроку(НомерСтроки);
			
			// Пропускаем пустые строки.
			Если ПустаяСтрока(СтрокаМодуляИсходная) Тогда
				Продолжить;
			КонецЕсли;
			
			// Пропускаем комментарии.
			СтрокаМодуля = СокрЛ(СтрокаМодуляИсходная);
			Если СтрНачинаетсяС(СтрокаМодуля, "//") Тогда
				Продолжить;
			КонецЕсли;
			
			ОбластьПустая = Ложь;
			Прервать;
			
		КонецЦикла;
		
		СтрокаОбласти.ОбластьПустая = ОбластьПустая;
		
	КонецЦикла;
	
	// Делаем отбор по пустым областям.
	ПараметрыОтбора = Новый Структура("ОбластьПустая", Истина);
	ТаблицаПустыхОбластей = ТаблицаОбластей.Скопировать(ПараметрыОтбора);
	
	Если ТаблицаПустыхОбластей.Количество() = 0 Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	ФайлИзменен = Истина;
	
	ТаблицаПустыхОбластей.Сортировать("НомерСтрокиКонец Убыв, НомерСтрокиНачало Убыв");
	Для Каждого СтрокаОбласти Из ТаблицаПустыхОбластей Цикл
		
		НомерСтрокиНачало = СтрокаОбласти.НомерСтрокиНачало;
		НомерСтрокиКонец = СтрокаОбласти.НомерСтрокиКонец;
		
		Для НомерСтроки = НомерСтрокиНачало По НомерСтрокиКонец Цикл
			// Удаляем одну и ту же строку, т.к. номер строки будет сдвигаться.
			ДокументТекст.УдалитьСтроку(НомерСтрокиНачало);
		КонецЦикла;
		
		// Остается лишняя пустая строка.
		СтрокаМодуля = ДокументТекст.ПолучитьСтроку(НомерСтрокиНачало - 1);
		Если ПустаяСтрока(СтрокаМодуля) И (НомерСтрокиНачало > 1) Тогда
			// Если пустая строка до начала области, то удалим ее.
			ДокументТекст.УдалитьСтроку(НомерСтрокиНачало - 1);
		Иначе
			// Иначе удалим строку после конца области.
			СтрокаМодуля = ДокументТекст.ПолучитьСтроку(НомерСтрокиНачало);
			Если ПустаяСтрока(СтрокаМодуля) Тогда
				ДокументТекст.УдалитьСтроку(НомерСтрокиНачало);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ФайлИзменен;
	
КонецФункции

Функция УдалитьПустыеОбласти(ДокументТекст)
	
	ФайлИзменен = Ложь;
	
	Пока Истина Цикл
		
		Если УдалитьПустыеОбластиНижнегоУровня(ДокументТекст) Тогда
			ФайлИзменен = Истина;
			Продолжить;
		КонецЕсли;
		
		Прервать;
		
	КонецЦикла;
	
	Возврат ФайлИзменен;
	
КонецФункции

Функция ЗаключитьМодульВИнструкциюПрепроцессора(ДокументТекст, ПолноеИмяФайла)
	
	ФайлИзменен = Ложь;
	
	ТекстМодуля = ДокументТекст.ПолучитьТекст();
	Если ПустаяСтрока(ТекстМодуля) Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	// Если модуль не содержит кода, кроме инструкции и комментариев, то очищаем модуль.
	Если НЕ МодульСодержитКод(ТекстМодуля) Тогда
		ДокументТекст.Очистить();
		ФайлИзменен = Истина;
		Возврат ФайлИзменен;
	КонецЕсли;
	
	МассивОбрабатываемыхМодулей = Новый Массив;
	МассивОбрабатываемыхМодулей.Добавить("ManagerModule");
	МассивОбрабатываемыхМодулей.Добавить("ObjectModule");
	МассивОбрабатываемыхМодулей.Добавить("RecordSetModule");
	МассивОбрабатываемыхМодулей.Добавить("ValueManagerModule");
	МассивОбрабатываемыхМодулей.Добавить("SessionModule");
	
	ИмяФайла = ПолучитьИмяФайлаБезРасширения(ПолноеИмяФайла);
	
	Если МассивОбрабатываемыхМодулей.Найти(ИмяФайла) = Неопределено Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	Если ИмяФайла = "ManagerModule" Тогда
		ФайлИзменен = ЗаключитьМодульМенеджераВИнструкциюПрепроцессора(ДокументТекст);
	ИначеЕсли ИмяФайла = "SessionModule" Тогда
		ФайлИзменен = ЗаключитьМодульСеансаВИнструкциюПрепроцессора(ДокументТекст);
	Иначе
		ФайлИзменен = ЗаключитьМодульОбъектаВИнструкциюПрепроцессора(ДокументТекст);
	КонецЕсли;
	
	Возврат ФайлИзменен;
	
КонецФункции

Функция ДобавитьИнструкциюПрепроцессора(ДокументТекст, ДобавитьИсключение = Ложь)
	
	ФайлИзменен = Ложь;
	
	ТекстМодуля = СокрЛП(ДокументТекст.ПолучитьТекст());
	ДокументТекст.УстановитьТекст(ТекстМодуля);
	
	ИскомаяИнструкция = НСтр("ru='#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда';
		|en='#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then'", КодОсновногоЯзыка);
	ИскомаяИнструкцияВРег = ВРег(ИскомаяИнструкция);
	ИскомаяИнструкцияВРег = СтрЗаменить(ИскомаяИнструкцияВРег, " ", "");
	
	ТаблицаИнструкций = ПолучитьТаблицуИнструкцийПрепроцессора(ТекстМодуля, Истина);
	
	// Ищем инструкцию в таблице всех инструкций.
	СтрокаИнструкции = ТаблицаИнструкций.Найти(ИскомаяИнструкцияВРег);
	Если СтрокаИнструкции <> Неопределено Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	// Если инструкции нет, то оборачиваем в нее весь модуль. Для этого ищем первую непустую строку, комментарии пропускаем.
	НомерСтроки = 1;
	МодульСодержитКод = Ложь;
	КоличествоСтрок = ДокументТекст.КоличествоСтрок();
	Для Счетчик = 1 По КоличествоСтрок Цикл
		
		СтрокаМодуля = ДокументТекст.ПолучитьСтроку(Счетчик);
		Если ПустаяСтрока(СтрокаМодуля) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрНачинаетсяС(СокрЛ(СтрокаМодуля), "//") Тогда
			Продолжить;
		КонецЕсли;
		
		МодульСодержитКод = Истина;
		НомерСтроки = Счетчик;
		Прервать;
		
	КонецЦикла;
	
	Если МодульСодержитКод Тогда
		// Добавляем инструкцию в первую непустую строку.
		ДокументТекст.ВставитьСтроку(НомерСтроки, ИскомаяИнструкция);
		ДокументТекст.ВставитьСтроку(НомерСтроки + 1, "");
	Иначе
		// Если в модуле кода нет, то добавляем в конец модуля.
		ДокументТекст.ДобавитьСтроку("");
		ДокументТекст.ДобавитьСтроку(ИскомаяИнструкция);
	КонецЕсли;
	
	ДокументТекст.ДобавитьСтроку("");
	
	Если ДобавитьИсключение Тогда
		ДокументТекст.ДобавитьСтроку(НСтр("ru='#Иначе'; en='#Else'", КодОсновногоЯзыка));
		ДокументТекст.ДобавитьСтроку(НСтр("ru='ВызватьИсключение НСтр(""ru = 'Недопустимый вызов объекта на клиенте.'"");';
			|en='Raise NStr(""en = 'Invalid object call on the client."");'", КодОсновногоЯзыка));
	КонецЕсли;
	
	ДокументТекст.ДобавитьСтроку(НСтр("ru='#КонецЕсли'; en='#EndIf'", КодОсновногоЯзыка));
	
	ТекстМодуля = СокрЛП(ДокументТекст.ПолучитьТекст());
	ДокументТекст.УстановитьТекст(ТекстМодуля);
	
	ФайлИзменен = Истина;
	
	Возврат ФайлИзменен;
	
КонецФункции

Функция ЗаключитьМодульМенеджераВИнструкциюПрепроцессора(ДокументТекст)
	
	// В модуле менеджера только добавляем инструкцию, если ее не было.
	ФайлИзменен = Ложь;
	
	ТекстМодуля = СокрЛП(ДокументТекст.ПолучитьТекст());
	ДокументТекст.УстановитьТекст(ТекстМодуля);
	
	ИскомаяИнструкция = НСтр("ru='#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда';
		|en='#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then'", КодОсновногоЯзыка);
	ИскомаяИнструкцияВРег = ВРег(ИскомаяИнструкция);
	ИскомаяИнструкцияВРег = СтрЗаменить(ИскомаяИнструкцияВРег, " ", "");
	
	ТаблицаИнструкций = ПолучитьТаблицуИнструкцийПрепроцессора(ТекстМодуля, Истина);
	
	// Ищем инструкцию в таблице всех инструкций.
	СтрокаИнструкции = ТаблицаИнструкций.Найти(ИскомаяИнструкцияВРег);
	Если СтрокаИнструкции <> Неопределено Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	// Если в модуле нет других процедур, кроме ОбработкаПолученияПредставления и ОбработкаПолученияПолейПредставления,
	// то инструкцию препроцессора не добавляем.
	ТекстОбработкаПолученияПредставления = ВРег(НСтр("ru='ОбработкаПолученияПредставления';
		|en='PresentationGetProcessing'", КодОсновногоЯзыка));
	ТекстОбработкаПолученияПолейПредставления = ВРег(НСтр("ru='ОбработкаПолученияПолейПредставления';
		|en='PresentationFieldsGetProcessing'", КодОсновногоЯзыка));
	
	ТаблицаМетодов = ПолучитьТаблицуПроцедурИФункций(ТекстМодуля);
	СтрокаОбработкиПолученияПредставления = ТаблицаМетодов.Найти(ТекстОбработкаПолученияПредставления, "ИмяМетодаВРег");
	СтрокаОбработкиПолученияПолейПредставления = ТаблицаМетодов.Найти(ТекстОбработкаПолученияПолейПредставления, "ИмяМетодаВРег");
	
	Если (ТаблицаМетодов.Количество() = 1
		И (СтрокаОбработкиПолученияПредставления <> Неопределено ИЛИ СтрокаОбработкиПолученияПолейПредставления <> Неопределено))
		ИЛИ (ТаблицаМетодов.Количество() = 2
		И СтрокаОбработкиПолученияПредставления <> Неопределено И СтрокаОбработкиПолученияПолейПредставления <> Неопределено) Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	ТекстКонецЕсли = НСтр("ru='#КонецЕсли'; en='#EndIf'", КодОсновногоЯзыка);
	
	// Если модуль не содержит кода, то добавляем инструкцию в конец модуля.
	Если ТаблицаМетодов.Количество() = 0 Тогда
		ДокументТекст.ДобавитьСтроку("");
		ДокументТекст.ДобавитьСтроку(ИскомаяИнструкция);
		ДокументТекст.ДобавитьСтроку("");
		ДокументТекст.ДобавитьСтроку(ТекстКонецЕсли);
	КонецЕсли;
	
	МассивМетодовИсключений = Новый Массив;
	Если СтрокаОбработкиПолученияПредставления <> Неопределено Тогда
		МассивМетодовИсключений.Добавить(СтрокаОбработкиПолученияПредставления.ИмяМетодаВРег);
	КонецЕсли;
	
	Если СтрокаОбработкиПолученияПолейПредставления <> Неопределено Тогда
		МассивМетодовИсключений.Добавить(СтрокаОбработкиПолученияПолейПредставления.ИмяМетодаВРег);
	КонецЕсли;
	
	// Строим дерево областей и методов модуля.
	// Данное дерево необходимо для анализа мест, в которые необходимо добавить инструкции,
	// избежав оборачивание в инструкции исключаемых методов.
	ДеревоОбластейИМетодов = Новый ДеревоЗначений;
	ДеревоОбластейИМетодов.Колонки.Добавить("ТипЭлемента");
	ДеревоОбластейИМетодов.Колонки.Добавить("НомерСтрокиНачало");
	ДеревоОбластейИМетодов.Колонки.Добавить("НомерСтрокиКонец");
	ДеревоОбластейИМетодов.Колонки.Добавить("ЭтоМетодИсключение");
	ДеревоОбластейИМетодов.Колонки.Добавить("НачалоИнструкции");
	ДеревоОбластейИМетодов.Колонки.Добавить("КонецИнструкции");
	
	МассивТекстПроцедураФункция      = Контекст["МассивТекстПроцедураФункция"];
	МассивТекстКонецПроцедурыФункции = Контекст["МассивТекстКонецПроцедурыФункции"];
	МассивТекстОбласть               = Контекст["МассивТекстОбласть"];
	МассивТекстКонецОбласти          = Контекст["МассивТекстКонецОбласти"];
	
	ТекущаяСтрокаДерева = ДеревоОбластейИМетодов;
	ТекущаяСтрокаМетода = Неопределено;
	
	КоличествоСтрок = ДокументТекст.КоличествоСтрок();
	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		
		СтрокаМодуля = ДокументТекст.ПолучитьСтроку(НомерСтроки);
		Если ПустаяСтрока(СтрокаМодуля) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаМодуляВРег = ВРег(СокрЛ(СтрокаМодуля));
		СтрокаМодуляВРег = СтрЗаменить(СтрокаМодуляВРег, "	", " ");
		
		Если СтрНачинаетсяС(СтрокаМодуляВРег, "//") Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрНачинаетсяСПоМассиву(СтрокаМодуляВРег, МассивТекстОбласть).Успешно Тогда
			ТекущаяСтрокаДерева = ТекущаяСтрокаДерева.Строки.Добавить();
			ТекущаяСтрокаДерева.ТипЭлемента = "Область";
			ТекущаяСтрокаДерева.НомерСтрокиНачало = НомерСтроки;
			ТекущаяСтрокаДерева.ЭтоМетодИсключение = Ложь;
		ИначеЕсли СтрНачинаетсяСПоМассиву(СтрокаМодуляВРег, МассивТекстКонецОбласти).Успешно Тогда
			Если ТекущаяСтрокаДерева = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ТекущаяСтрокаДерева.НомерСтрокиКонец = НомерСтроки;
			ТекущаяСтрокаДерева = ТекущаяСтрокаДерева.Родитель;
			Если ТекущаяСтрокаДерева = Неопределено Тогда
				ТекущаяСтрокаДерева = ДеревоОбластейИМетодов;
			КонецЕсли;
		ИначеЕсли СтрНачинаетсяСПоМассиву(СтрокаМодуляВРег, МассивТекстПроцедураФункция).Успешно Тогда
			НайденныйЭлемент = СтрНачинаетсяСПоМассиву(СтрокаМодуляВРег, МассивТекстПроцедураФункция).НайденныйЭлемент;
			ИмяМетода = Сред(СтрокаМодуляВРег, СтрДлина(НайденныйЭлемент) + 1);
			ПозицияСкобки = СтрНайти(ИмяМетода, "(");
			Если ПозицияСкобки > 0 Тогда
				ИмяМетода = Лев(ИмяМетода, ПозицияСкобки - 1);
			КонецЕсли;
			
			ТекущаяСтрокаМетода = ТекущаяСтрокаДерева.Строки.Добавить();
			ТекущаяСтрокаМетода.ТипЭлемента = "Метод";
			ТекущаяСтрокаМетода.НомерСтрокиНачало = НомерСтроки;
			ТекущаяСтрокаМетода.ЭтоМетодИсключение = (МассивМетодовИсключений.Найти(ИмяМетода) <> Неопределено);
		ИначеЕсли СтрНачинаетсяСПоМассиву(СтрокаМодуляВРег, МассивТекстКонецПроцедурыФункции).Успешно Тогда
			Если ТекущаяСтрокаМетода = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ТекущаяСтрокаМетода.НомерСтрокиКонец = НомерСтроки;
		КонецЕсли;
	КонецЦикла;
	
	// Определим области, которые включают в себя исключаемые методы.
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ЭтоМетодИсключение", Истина);
	
	МассивСтрокИсключений = ДеревоОбластейИМетодов.Строки.НайтиСтроки(СтруктураОтбора, Истина);
	Для Каждого СтрокаИсключения Из МассивСтрокИсключений Цикл
		ТекущаяСтрока = СтрокаИсключения;
		Пока Истина Цикл
			Если ТекущаяСтрока = Неопределено Тогда
				Прервать;
			КонецЕсли;
			ТекущаяСтрока.ЭтоМетодИсключение = Истина;
			ТекущаяСтрока = ТекущаяСтрока.Родитель;
		КонецЦикла;
	КонецЦикла;
	
	// Рекурсивная определение мест, в которые необходимо установить инструкции.
	ЗаполнитьМестаДляИнструкций(ДеревоОбластейИМетодов.Строки);
	
	// Добавление строк инструкций в текст модуля.
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("НачалоИнструкции", Истина);
	МассивСтрокДерева = ДеревоОбластейИМетодов.Строки.НайтиСтроки(СтруктураОтбора, Истина);
	КоличествоДобавленныхИнструкций = 0;
	Для Каждого СтрокаДерева Из МассивСтрокДерева Цикл
		НомерСтроки = СтрокаДерева.НомерСтрокиНачало + КоличествоДобавленныхИнструкций;
		ДокументТекст.ВставитьСтроку(НомерСтроки, ИскомаяИнструкция);
		ДокументТекст.ВставитьСтроку(НомерСтроки + 1, "");
		
		КоличествоДобавленныхИнструкций = КоличествоДобавленныхИнструкций + 2;
		
		СтрокаРодителя = СтрокаДерева.Родитель;
		Если СтрокаРодителя = Неопределено Тогда
			СтрокаРодителя = ДеревоОбластейИМетодов;
		КонецЕсли;
		
		// Ищем ближайшую строку, после которой необходимо закрыть установленную инструкцию.
		НайденаТекущаяСтрока = Ложь;
		Для Каждого Строка Из СтрокаРодителя.Строки Цикл
			Если СтрокаДерева = Строка Тогда
				НайденаТекущаяСтрока = Истина;
			КонецЕсли;
			
			Если НЕ НайденаТекущаяСтрока Тогда
				Продолжить;
			КонецЕсли;
			
			Если Строка.КонецИнструкции = Истина Тогда
				НомерСтроки = Строка.НомерСтрокиКонец + КоличествоДобавленныхИнструкций;
				ДокументТекст.ВставитьСтроку(НомерСтроки + 1, "");
				ДокументТекст.ВставитьСтроку(НомерСтроки + 2, ТекстКонецЕсли);
				КоличествоДобавленныхИнструкций = КоличествоДобавленныхИнструкций + 2;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если КоличествоДобавленныхИнструкций > 0 Тогда
		ФайлИзменен = Истина;
	КонецЕсли;
	
	Возврат ФайлИзменен;
	
КонецФункции

// Выполняет рекурсивное заполнение колонок "НачалоИнструкции" и "КонецИнструкции" дерева областей и методов.
//
Процедура ЗаполнитьМестаДляИнструкций(КоллекцияСтрокДерева)
	
	МассивОбластейБезИсключений = Новый Массив;
	Для Каждого СтрокаДерева Из КоллекцияСтрокДерева Цикл
		Если СтрокаДерева.ЭтоМетодИсключение Тогда
			Если МассивОбластейБезИсключений.Количество() > 0 Тогда
				МассивОбластейБезИсключений[0].НачалоИнструкции = Истина;
				МассивОбластейБезИсключений[МассивОбластейБезИсключений.ВГраница()].КонецИнструкции = Истина;
				
				МассивОбластейБезИсключений.Очистить();
			КонецЕсли;
			
			ЗаполнитьМестаДляИнструкций(СтрокаДерева.Строки)
		Иначе
			МассивОбластейБезИсключений.Добавить(СтрокаДерева);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивОбластейБезИсключений.Количество() > 0 Тогда
		МассивОбластейБезИсключений[0].НачалоИнструкции = Истина;
		МассивОбластейБезИсключений[МассивОбластейБезИсключений.ВГраница()].КонецИнструкции = Истина;
		
		МассивОбластейБезИсключений.Очистить();
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаключитьМодульСеансаВИнструкциюПрепроцессора(ДокументТекст)
	
	ФайлИзменен = ДобавитьИнструкциюПрепроцессора(ДокументТекст);
	Если ФайлИзменен Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	ТекстМодуля = СокрП(ДокументТекст.ПолучитьТекст());
	ДокументТекст.УстановитьТекст(ТекстМодуля);
	
	// Удаляем комментарии из модуля.
	ТекстМодуля = ПолучитьТекстМодуляБезКомментариев(ТекстМодуля);
	
	ИскомаяИнструкция = НСтр("ru='#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда';
		|en='#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then'", КодОсновногоЯзыка);
	ИскомаяИнструкцияВРег = ВРег(ИскомаяИнструкция);
	ИскомаяИнструкцияВРег = СтрЗаменить(ИскомаяИнструкцияВРег, " ", "");
	
	ТаблицаИнструкций = ПолучитьТаблицуИнструкцийПрепроцессора(ТекстМодуля, Истина);
	
	// Ищем инструкцию в таблице всех инструкций.
	// Добавляли раньше, поэтому инструкция должна быть.
	СтрокаИнструкции = ТаблицаИнструкций.Найти(ИскомаяИнструкцияВРег);
	Если СтрокаИнструкции = Неопределено Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	// Если инструкция есть, то проверяем, что она начинается в начале и заканчивается в конце модуля.
	// Сначала проверяем текст после окончания инструкции, чтобы не слетели позиции начала и окончания.
	ПозицияКонецЕсли = СтрокаИнструкции.ПозицияКонецЕсли;
	ТекстКонецЕсли = СтрокаИнструкции.ТекстКонецЕсли;
	ТекстПосле = Сред(ТекстМодуля, ПозицияКонецЕсли + СтрДлина(ТекстКонецЕсли));
	Если НЕ ПустаяСтрока(ТекстПосле) Тогда
		
		// Если после инструкции есть какой-либо текст, то переносим окончание инструкции в конец модуля.
		НомерСтроки = ПолучитьНомерСтрокиМодуля(ТекстМодуля, ПозицияКонецЕсли);
		ДокументТекст.УдалитьСтроку(НомерСтроки);
		
		// Проверяем следующую строку, если пустая, то удаляем.
		Если ПустаяСтрока(ДокументТекст.ПолучитьСтроку(НомерСтроки)) Тогда
			ДокументТекст.УдалитьСтроку(НомерСтроки);
		КонецЕсли;
		
		// Добавляем окончание инструкции в конец модуля.
		СтрокаМодуля = ДокументТекст.ПолучитьСтроку(ДокументТекст.КоличествоСтрок());
		Если НЕ ПустаяСтрока(СтрокаМодуля) Тогда
			ДокументТекст.ДобавитьСтроку("");
		КонецЕсли;
		ДокументТекст.ДобавитьСтроку(НСтр("ru='#КонецЕсли'; en='#EndIf'", КодОсновногоЯзыка));
		
		ФайлИзменен = Истина;
		
	КонецЕсли;
	
	ПозицияЕсли = СтрокаИнструкции.ПозицияЕсли;
	ТекстДо = Лев(ТекстМодуля, ПозицияЕсли - 1);
	Если НЕ ПустаяСтрока(ТекстДо) Тогда
		
		// Если до инструкции есть какой-либо текст, то переносим инструкцию в начало модуля.
		НомерСтроки = ПолучитьНомерСтрокиМодуля(ТекстМодуля, ПозицияЕсли);
		ДокументТекст.УдалитьСтроку(НомерСтроки);
		
		// Проверяем следующую строку, если пустая, то удаляем.
		Если ПустаяСтрока(ДокументТекст.ПолучитьСтроку(НомерСтроки)) Тогда
			ДокументТекст.УдалитьСтроку(НомерСтроки);
		КонецЕсли;
		
		// Ищем первую непустую строку, комментарии пропускаем.
		КоличествоСтрок = ДокументТекст.КоличествоСтрок();
		Для Счетчик = 1 По КоличествоСтрок Цикл
			
			СтрокаМодуля = ДокументТекст.ПолучитьСтроку(Счетчик);
			Если ПустаяСтрока(СтрокаМодуля) Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрНачинаетсяС(СокрЛ(СтрокаМодуля), "//") Тогда
				Продолжить;
			КонецЕсли;
			
			НомерСтроки = Счетчик;
			Прервать;
			
		КонецЦикла;
		
		ДокументТекст.ВставитьСтроку(НомерСтроки, "");
		ДокументТекст.ВставитьСтроку(НомерСтроки, ИскомаяИнструкция);
		
		ФайлИзменен = Истина;
		
	КонецЕсли;
	
	Возврат ФайлИзменен;
	
КонецФункции

Функция ЗаключитьМодульОбъектаВИнструкциюПрепроцессора(ДокументТекст)
	
	ФайлИзменен = ДобавитьИнструкциюПрепроцессора(ДокументТекст, Истина);
	Если ФайлИзменен Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	ТекстМодуля = СокрП(ДокументТекст.ПолучитьТекст());
	ДокументТекст.УстановитьТекст(ТекстМодуля);
	
	// Удаляем комментарии из модуля.
	ТекстМодуля = ПолучитьТекстМодуляБезКомментариев(ТекстМодуля);
	
	ИскомаяИнструкция = НСтр("ru='#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда';
		|en='#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then'", КодОсновногоЯзыка);
	ИскомаяИнструкцияВРег = ВРег(ИскомаяИнструкция);
	ИскомаяИнструкцияВРег = СтрЗаменить(ИскомаяИнструкцияВРег, " ", "");
	
	ТекстИсключения = НСтр("ru='ВызватьИсключение НСтр(""ru = 'Недопустимый вызов объекта на клиенте.'"");';
		|en='Raise NStr(""en = 'Invalid object call on the client."");'", КодОсновногоЯзыка);
	ТекстИсключенияВРег = ВРег(ТекстИсключения);
	ТекстИсключенияВРег = СтрЗаменить(ТекстИсключенияВРег, " ", "");
	ТекстИсключенияВРег = СтрЗаменить(ТекстИсключенияВРег, ";", "");
	
	ТаблицаИнструкций = ПолучитьТаблицуИнструкцийПрепроцессора(ТекстМодуля, Истина);
	
	// Ищем инструкцию в таблице всех инструкций.
	// Добавляли раньше, поэтому инструкция должна быть.
	СтрокаИнструкции = ТаблицаИнструкций.Найти(ИскомаяИнструкцияВРег);
	Если СтрокаИнструкции = Неопределено Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	// Если инструкция есть, то проверяем, что она начинается в начале и заканчивается в конце модуля.
	// Сначала проверяем текст после окончания инструкции, чтобы не слетели позиции начала и окончания.
	ПозицияКонецЕсли = СтрокаИнструкции.ПозицияКонецЕсли;
	ТекстКонецЕсли = СтрокаИнструкции.ТекстКонецЕсли;
	ТекстПосле = Сред(ТекстМодуля, ПозицияКонецЕсли + СтрДлина(ТекстКонецЕсли));
	Если НЕ ПустаяСтрока(ТекстПосле) Тогда
		
		// Если после инструкции есть какой-либо текст, то переносим окончание инструкции в конец модуля.
		НомерСтроки = ПолучитьНомерСтрокиМодуля(ТекстМодуля, ПозицияКонецЕсли);
		ДокументТекст.УдалитьСтроку(НомерСтроки);
		
		// Добавляем окончание инструкции в конец модуля.
		СтрокаМодуля = ДокументТекст.ПолучитьСтроку(ДокументТекст.КоличествоСтрок());
		Если НЕ ПустаяСтрока(СтрокаМодуля) Тогда
			ДокументТекст.ДобавитьСтроку("");
		КонецЕсли;
		ДокументТекст.ДобавитьСтроку(ТекстКонецЕсли);
		
		ФайлИзменен = Истина;
		
	КонецЕсли;
	
	// Проверяем, было ли условие "#Иначе" в искомой инструкции.
	ДобавитьИсключение = Истина;
	ПозицияИначе = СтрокаИнструкции.ПозицияИначе;
	Если ПозицияИначе <> Неопределено Тогда
		ТекстПослеИначе = Сред(ТекстМодуля, ПозицияИначе);
		ТекстПослеИначе = ВРег(ТекстПослеИначе);
		ТекстПослеИначе = СтрЗаменить(ТекстПослеИначе, " ", "");
		ТекстПослеИначе = СтрЗаменить(ТекстПослеИначе, Символы.Таб, "");
		
		// Если исключение после "#Иначе" не найдено, то устанавливаем флаг.
		ДобавитьИсключение = (СтрНайти(ТекстПослеИначе, ТекстИсключенияВРег) = 0);
	КонецЕсли;
	
	Если ДобавитьИсключение Тогда
		
		НомерСтрокиКонецЕсли = ПолучитьНомерСтрокиМодуля(ТекстМодуля, ПозицияКонецЕсли);
		
		// Добавляем исключение.
		ДокументТекст.ВставитьСтроку(НомерСтрокиКонецЕсли, ТекстИсключения);
		
		// Если "#Иначе" не было, то добавляем.
		Если ПозицияИначе = Неопределено Тогда
			ДокументТекст.ВставитьСтроку(НомерСтрокиКонецЕсли, СтрокаИнструкции.ТекстИначе);
		КонецЕсли;
		
		ФайлИзменен = Истина;
		
	КонецЕсли;
	
	ПозицияЕсли = СтрокаИнструкции.ПозицияЕсли;
	ТекстДо = Лев(ТекстМодуля, ПозицияЕсли - 1);
	Если НЕ ПустаяСтрока(ТекстДо) Тогда
		
		// Если до инструкции есть какой-либо текст, то переносим инструкцию в начало модуля.
		НомерСтрокиЕсли = ПолучитьНомерСтрокиМодуля(ТекстМодуля, ПозицияЕсли);
		ДокументТекст.УдалитьСтроку(НомерСтрокиЕсли);
		
		// Проверяем следующую строку, если пустая, то удаляем.
		Если ПустаяСтрока(ДокументТекст.ПолучитьСтроку(НомерСтрокиЕсли)) Тогда
			ДокументТекст.УдалитьСтроку(НомерСтрокиЕсли);
		КонецЕсли;
		
		// Ищем первую непустую строку, комментарии пропускаем.
		КоличествоСтрок = ДокументТекст.КоличествоСтрок();
		Для Счетчик = 1 По КоличествоСтрок Цикл
			
			СтрокаМодуля = ДокументТекст.ПолучитьСтроку(Счетчик);
			Если ПустаяСтрока(СтрокаМодуля) Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрНачинаетсяС(СокрЛ(СтрокаМодуля), "//") Тогда
				Продолжить;
			КонецЕсли;
			
			НомерСтрокиЕсли = Счетчик;
			Прервать;
			
		КонецЦикла;
		
		ДокументТекст.ВставитьСтроку(НомерСтрокиЕсли, "");
		ДокументТекст.ВставитьСтроку(НомерСтрокиЕсли, ИскомаяИнструкция);
		
		ФайлИзменен = Истина;
		
	КонецЕсли;
	
	Возврат ФайлИзменен;
	
КонецФункции

// Удаляет преамбулу и инструкцию препроцессору.
// Возвращает Истину, если модуль содержит еще какой-либо код или другие комментарии.
//
Функция МодульСодержитКод(Знач ТекстМодуля)
	
	Если ПустаяСтрока(ТекстМодуля) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстМодуля = ВРег(ТекстМодуля);
	ТекстМодуля = СтрЗаменить(ТекстМодуля, Символы.Таб, "");
	ТекстМодуля = СтрЗаменить(ТекстМодуля, " ", "");
	
	МассивИнструкций = Новый Массив;
	МассивИнструкций.Добавить("#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда");
	МассивИнструкций.Добавить("#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then");
	МассивИнструкций.Добавить("#Иначе");
	МассивИнструкций.Добавить("#Else");
	МассивИнструкций.Добавить("ВызватьИсключение НСтр(""ru = 'Недопустимый вызов объекта на клиенте.");
	МассивИнструкций.Добавить("Raise NStr(""en = 'Invalid object call on the client.");
	МассивИнструкций.Добавить("#КонецЕсли");
	МассивИнструкций.Добавить("#EndIf");
	
	Для Каждого ТекстИнструкции Из МассивИнструкций Цикл
		ТекстИнструкции = ВРег(ТекстИнструкции);
		ТекстИнструкции = СтрЗаменить(ТекстИнструкции, Символы.Таб, "");
		ТекстИнструкции = СтрЗаменить(ТекстИнструкции, " ", "");
		
		ТекстМодуля = СтрЗаменить(ТекстМодуля, ТекстИнструкции, "");
	КонецЦикла;
	
	Если ПустаяСтрока(ТекстМодуля) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Проверяем преамбулу.
	ТекстМодуля = СокрЛ(ТекстМодуля);
	
	// Если текст модуля не начинается с длинного комментария, тогда он не содержит преамбулу.
	ТекстСимволыНачалаПреамбулы = Контекст["ТекстСимволыНачалаПреамбулы"];
	Если НЕ СтрНачинаетсяС(ТекстМодуля, ТекстСимволыНачалаПреамбулы) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ДокументТекст = Новый ТекстовыйДокумент;
	ДокументТекст.УстановитьТекст(ТекстМодуля);
	
	КоличествоСтрок = ДокументТекст.КоличествоСтрок();
	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		
		СтрокаМодуля = ДокументТекст.ПолучитьСтроку(НомерСтроки);
		Если ПустаяСтрока(СтрокаМодуля) Тогда
			Прервать;
		КонецЕсли;
		
		СтрокаМодуля = СокрЛ(СтрокаМодуля);
		Если НЕ СтрНачинаетсяС(СтрокаМодуля, "//") Тогда
			Прервать;
		КонецЕсли;
		
		ДокументТекст.ЗаменитьСтроку(НомерСтроки, "");
		
	КонецЦикла;
	
	ТекстМодуля = ДокументТекст.ПолучитьТекст();
	
	Возврат НЕ ПустаяСтрока(ТекстМодуля);
	
КонецФункции

Функция УдалитьПроверкуПараметраАвтоТест(ДокументТекстИсходный, ПолноеИмяФайла)
	
	ФайлИзменен = Ложь;
	
	ТипМодуля = ПолучитьТипМодуляПоИмениФайла(ПолноеИмяФайла);
	
	// Проверяем только модули форм, объектов и наборов записей.
	МассивКонструкцийАвтоТест = Новый Массив;
	Если ТипМодуля = "МодульФормы" Тогда
		МассивКонструкцийАвтоТест.Добавить(ВРег("Если Параметры.Свойство(""АвтоТест"") Тогда"));
		МассивКонструкцийАвтоТест.Добавить(ВРег("If Parameters.Property(""AutoTest"") Then"));
		МассивКонструкцийАвтоТест.Добавить(ВРег("If Parameters.Property(""AutoTest_2"") Then"));
	ИначеЕсли (ТипМодуля = "МодульОбъекта")
		  ИЛИ (ТипМодуля = "МодульНабораЗаписей") Тогда
		МассивКонструкцийАвтоТест.Добавить(ВРег("Если ДанныеЗаполнения = ""АвтоТест"" Тогда"));
		МассивКонструкцийАвтоТест.Добавить(ВРег("If FillingData = ""AutoTest"" Then"));
	Иначе
		Возврат ФайлИзменен;
	КонецЕсли;
	
	ТекстВозврат   = Контекст["ТекстВозврат"];
	ТекстКонецЕсли = Контекст["ТекстКонецЕсли"];
	ТекстАвтоТест  = Контекст["ТекстАвтоТест"];
	
	ТекстМодуля = ДокументТекстИсходный.ПолучитьТекст();
	ТекстМодуля = СтрЗаменить(ТекстМодуля, Символы.Таб, "");
	ТекстМодуля = СтрЗаменить(ТекстМодуля, " ", "");
	ТекстМодуля = СтрЗаменить(ТекстМодуля, ";", "");
	ТекстМодуля = ВРег(ТекстМодуля);
	
	ДокументТекст = Новый ТекстовыйДокумент;
	ДокументТекст.УстановитьТекст(ТекстМодуля);
	КоличествоСтрок = ДокументТекст.КоличествоСтрок();
	
	МассивНомеровСтрокКУдалению = Новый Массив;
	
	Для Каждого КонструкцияАвтоТест Из МассивКонструкцийАвтоТест Цикл
		
		КонструкцияАвтоТест = СтрЗаменить(КонструкцияАвтоТест, " ", "");
		
		ПозицияПоиска = 0;
		Пока Истина Цикл
			
			ПозицияПоиска = СтрНайти(ТекстМодуля, КонструкцияАвтоТест,, ПозицияПоиска + 1);
			Если ПозицияПоиска = 0 Тогда
				Прервать;
			КонецЕсли;
			
			НомерСтрокиАвтоТест = ПолучитьНомерСтрокиМодуля(ТекстМодуля, ПозицияПоиска);
			СтрокаМодуляАвтоТест = ДокументТекст.ПолучитьСтроку(НомерСтрокиАвтоТест);
			
			// Если строка не начинается с искомой конструкции, пропускаем.
			Если НЕ СтрНачинаетсяС(СтрокаМодуляАвтоТест, КонструкцияАвтоТест) Тогда
				Продолжить;
			КонецЕсли;
			
			НомерСтрокиНачалоКонструкции = НомерСтрокиАвтоТест;
			
			// После конструкции может быть несколько пустых строк или строк с комментарием, ищем первую непустую.
			СтрокаМодуляВозврат = "";
			НомерСтрокиВозврат = 0;
			Для НомерСтроки = НомерСтрокиНачалоКонструкции + 1 По КоличествоСтрок Цикл
				СтрокаМодуля = ДокументТекст.ПолучитьСтроку(НомерСтроки);
				Если ПустаяСтрока(СтрокаМодуля) ИЛИ СтрНачинаетсяС(СтрокаМодуля, "//") Тогда
					Продолжить;
				КонецЕсли;
				
				НомерСтрокиВозврат = НомерСтроки;
				СтрокаМодуляВозврат = СтрокаМодуля;
				Прервать;
			КонецЦикла;
			
			Если НомерСтрокиВозврат = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			// Если строка не начинается с "Возврат", пропускаем.
			Если НЕ СтрНачинаетсяС(СтрокаМодуляВозврат, ТекстВозврат) Тогда
				Продолжить;
			КонецЕсли;
			
			// После "Возврат" может быть несколько пустых строк или строк с комментарием, ищем первую непустую.
			СтрокаМодуляКонецЕсли = "";
			НомерСтрокиКонецЕсли = 0;
			Для НомерСтроки = НомерСтрокиВозврат + 1 По КоличествоСтрок Цикл
				СтрокаМодуля = ДокументТекст.ПолучитьСтроку(НомерСтроки);
				Если ПустаяСтрока(СтрокаМодуля) ИЛИ СтрНачинаетсяС(СтрокаМодуля, "//") Тогда
					Продолжить;
				КонецЕсли;
				
				НомерСтрокиКонецЕсли = НомерСтроки;
				СтрокаМодуляКонецЕсли = СтрокаМодуля;
				Прервать;
			КонецЦикла;
			
			Если НомерСтрокиКонецЕсли = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			// Если строка не начинается с "КонецЕсли", пропускаем.
			Если НЕ СтрНачинаетсяС(СтрокаМодуляКонецЕсли, ТекстКонецЕсли) Тогда
				Продолжить;
			КонецЕсли;
			
			НомерСтрокиКонецКонструкции = НомерСтрокиКонецЕсли;
			
			// Проверяем предыдущую строку перед искомой конструкцией.
			НомерСтрокиКомментарий = НомерСтрокиАвтоТест - 1;
			СтрокаМодуляКомментарий = ДокументТекст.ПолучитьСтроку(НомерСтрокиКомментарий);
			СтрокаМодуляПередКомментарием = ДокументТекст.ПолучитьСтроку(НомерСтрокиКомментарий - 1);
			
			// Если строка модуля перед конструкцией содержит комментарий про параметр АвтоТест, то записываем строку с комментарием в массив удаляемых.
			ЕстьКомментарийПроАвтоТест = (СтрНачинаетсяС(СтрокаМодуляКомментарий, "//") И (СтрНайти(СтрокаМодуляКомментарий, ТекстАвтоТест) > 0));
			Если ЕстьКомментарийПроАвтоТест Тогда
				НомерСтрокиНачалоКонструкции = НомерСтрокиКомментарий;
			КонецЕсли;
			
			ЕстьКомментарийПроАвтоТестИПредыдущаяСтрокаПустая = (ЕстьКомментарийПроАвтоТест И ПустаяСтрока(СтрокаМодуляПередКомментарием));
			
			НомерСтрокиПослеКонецЕсли = НомерСтрокиКонецЕсли + 1;
			СтрокаМодуляПослеКонецЕсли = ДокументТекст.ПолучитьСтроку(НомерСтрокиПослеКонецЕсли);
			
			// Если до и после конструкции пустые строки, то удалим пустую строку после "КонецЕсли".
			Если ПустаяСтрока(СтрокаМодуляПослеКонецЕсли) Тогда
				Если ЕстьКомментарийПроАвтоТестИПредыдущаяСтрокаПустая ИЛИ ПустаяСтрока(СтрокаМодуляКомментарий) Тогда
					НомерСтрокиКонецКонструкции = НомерСтрокиПослеКонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Для НомерСтроки = НомерСтрокиНачалоКонструкции По НомерСтрокиКонецКонструкции Цикл
				МассивНомеровСтрокКУдалению.Добавить(НомерСтроки);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если МассивНомеровСтрокКУдалению.Количество() = 0 Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	ФайлИзменен = Истина;
	
	// Загрузим номера строк в таблицу, свернем и упорядочим по убыванию для правильного удаления строк из текстового документа.
	ТаблицаНомеровСтрокКУдалению = Новый ТаблицаЗначений;
	ТаблицаНомеровСтрокКУдалению.Колонки.Добавить("Номер");
	Для Каждого НомерСтроки Из МассивНомеровСтрокКУдалению Цикл
		ТаблицаНомеровСтрокКУдалению.Добавить().Номер = НомерСтроки;
	КонецЦикла;
	
	ТаблицаНомеровСтрокКУдалению.Свернуть("Номер");
	ТаблицаНомеровСтрокКУдалению.Сортировать("Номер Убыв");
	
	Для Каждого СтрокаТаблицы Из ТаблицаНомеровСтрокКУдалению Цикл
		ДокументТекстИсходный.УдалитьСтроку(СтрокаТаблицы.Номер);
	КонецЦикла;
	
	// Если файл был изменен, то проверяем и удаляем пустые процедуры и функции.
	МассивУдаленныхМетодов = УдалитьПустыеПроцедурыИФункции(ДокументТекстИсходный);
	Если МассивУдаленныхМетодов.Количество() > 0 Тогда
		ЗаписатьИзмененияВФайл(ДокументТекстИсходный, ПолноеИмяФайла);
	КонецЕсли;
	
	// Если это форма, то необходимо дополнительно удалить обработчики событий на форме в XML.
	Если ТипМодуля = "МодульФормы" Тогда
		
		// Ищем путь объекта по файлу его модуля.
		ПутьОбъекта = ПолучитьЗначениеОбъекта(ПолноеИмяФайла);
		Если НЕ ПустаяСтрока(ПутьОбъекта) Тогда
			
			ПолноеИмяФайлаОкончание = ?(ЭтоВыгрузкаXMLФайлов, СтрШаблон("%1Ext%1Form.xml", РазделительПути), РазделительПути + "Form.form");
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Выбран", Истина);
			ПараметрыОтбора.Вставить("ЗахваченВХранилище", Истина);
			ПараметрыОтбора.Вставить("РедактированиеРазрешено", Истина);
			ПараметрыОтбора.Вставить("ПолноеИмяФайлаОкончание", ПолноеИмяФайлаОкончание);
			
			ПолноеИмяФайлаXML = ПолучитьЗначениеОбъекта(ПутьОбъекта, "Объект", "ПолноеИмяФайла", ПараметрыОтбора);
			Если НЕ ПустаяСтрока(ПолноеИмяФайлаXML) Тогда
				Если ЭтоВыгрузкаXMLФайлов Тогда
					УдалитьОтсутствующиеОбработчикиИзСобытийФормыXML(ПолноеИмяФайлаXML, МассивУдаленныхМетодов);
				Иначе
					УдалитьОтсутствующиеОбработчикиИзСобытийФормыEDT(ПолноеИмяФайлаXML, МассивУдаленныхМетодов);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УдалитьПустыеОбласти(ДокументТекстИсходный);
	
	// Если модуль не содержит кода, кроме инструкции и комментариев, то очищаем модуль.
	Если НЕ МодульСодержитКод(ДокументТекстИсходный.ПолучитьТекст()) Тогда
		ДокументТекстИсходный.Очистить();
	КонецЕсли;
	
	Возврат ФайлИзменен;
	
КонецФункции

Функция ДобавитьПустуюСтрокуМеждуОбъявлениемПодсистемыИОписаниемПроцедуры(ДокументТекст)
	
	ФайлИзменен = Ложь;
	
	КоличествоСтрок = ДокументТекст.КоличествоСтрок();
	Если КоличествоСтрок = 0 Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	МассивТекстОбластьДляВызоваИзДругихПодсистем = Новый Массив;
	МассивТекстОбластьДляВызоваИзДругихПодсистем.Добавить("#ОбластьДляВызоваИзДругихПодсистем");
	МассивТекстОбластьДляВызоваИзДругихПодсистем.Добавить("#RegionForCallsFromOtherSubsystems");
	
	МассивТекстОбласть          = Контекст["МассивТекстОбласть"];
	МассивТекстКонецОбласти     = Контекст["МассивТекстКонецОбласти"];
	МассивТекстПроцедураФункция = Контекст["МассивТекстПроцедураФункция"];
	
	ТекстМодуля = ДокументТекст.ПолучитьТекст();
	ТекстМодуля = СтрЗаменить(ТекстМодуля, " ", "");
	ТекстМодуля = СтрЗаменить(ТекстМодуля, Символы.Таб, "");
	ТекстМодуля = ВРег(ТекстМодуля);
	
	ПозицияПоиска = СтрНайтиПоМассиву(ТекстМодуля, МассивТекстОбластьДляВызоваИзДругихПодсистем,,, Истина).Позиция;
	Если ПозицияПоиска = 0 Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	НайденныйНомерСтроки = ПолучитьНомерСтрокиМодуля(ТекстМодуля, ПозицияПоиска);
	
	НайденоНачалоОбласти = Ложь;
	КоличествоВложенныхОбластей = 0;
	
	Для НомерСтроки = НайденныйНомерСтроки По КоличествоСтрок Цикл
		
		СтрокаМодуля = ДокументТекст.ПолучитьСтроку(НомерСтроки);
		
		// Пропускаем пустые строки.
		Если ПустаяСтрока(СтрокаМодуля) Тогда
			Продолжить;
		КонецЕсли;
		
		// Пропускаем комментарии.
		СтрокаМодуля = СокрЛ(СтрокаМодуля);
		Если СтрНачинаетсяС(СтрокаМодуля, "//") Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаМодуля = СтрЗаменить(СтрокаМодуля, " ", "");
		СтрокаМодуля = СтрЗаменить(СтрокаМодуля, Символы.Таб, "");
		СтрокаМодуля = ВРег(СтрокаМодуля);
		
		Если (НЕ НайденоНачалоОбласти) И СтрНачинаетсяСПоМассиву(СтрокаМодуля, МассивТекстОбластьДляВызоваИзДругихПодсистем).Успешно Тогда
			НайденоНачалоОбласти = Истина;
			Продолжить;
		КонецЕсли;
		
		Если НЕ НайденоНачалоОбласти Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрНачинаетсяСПоМассиву(СтрокаМодуля, МассивТекстКонецОбласти).Успешно Тогда
			
			Если КоличествоВложенныхОбластей = 0 Тогда
				// Конец области ДляВызоваИзДругихПодсистем.
				Прервать;
			Иначе
				// Конец вложенной области.
				КоличествоВложенныхОбластей = КоличествоВложенныхОбластей - 1;
			КонецЕсли;
		
		ИначеЕсли СтрНачинаетсяСПоМассиву(СтрокаМодуля, МассивТекстОбласть).Успешно Тогда
			// Начало вложенной области.
			КоличествоВложенныхОбластей = КоличествоВложенныхОбластей + 1;
			
		ИначеЕсли СтрНачинаетсяСПоМассиву(СтрокаМодуля, МассивТекстПроцедураФункция).Успешно Тогда
			
			НомерСтрокиОписанияПроцедуры = НомерСтроки - 1;
			ПоследняяСтрокаОписания = "";
			
			Пока Истина Цикл
				
				Если НомерСтрокиОписанияПроцедуры = 0 Тогда
					Прервать;
				КонецЕсли;
				
				СтрокаМодуля = ДокументТекст.ПолучитьСтроку(НомерСтрокиОписанияПроцедуры);
				
				Если НЕ СтрНачинаетсяС(СтрокаМодуля, "//") Тогда
					Прервать;
				КонецЕсли;
				
				ПоследняяСтрокаОписания = СтрокаМодуля;
				НомерСтрокиОписанияПроцедуры = НомерСтрокиОписанияПроцедуры - 1;
				
			КонецЦикла;
			
			Если ПустаяСтрока(ПоследняяСтрокаОписания) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаОписания = СтрЗаменить(ПоследняяСтрокаОписания, "/", "");
			МассивСлов = СтрРазделить(СтрокаОписания, " ", Ложь);
			Если МассивСлов.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ПервоеСлово = МассивСлов[0];
			
			МассивСлов = СтрРазделить(ПервоеСлово, ".");
			ИмяПодсистемы = МассивСлов[0];
			
			Если ЭтоВыгрузкаXMLФайлов Тогда
				ПутьКФайлуПодсистемы = СтрШаблон("%1Subsystems%2%3.xml", КаталогВыгрузкиРезультат, РазделительПути, ИмяПодсистемы);
			Иначе
				ПутьКФайлуПодсистемы = СтрШаблон("%1src%2Subsystems%2%3", КаталогВыгрузкиРезультат, РазделительПути, ИмяПодсистемы);
			КонецЕсли;
			
			Если апк_ФайлСуществует(ПутьКФайлуПодсистемы) Тогда
				ДокументТекст.ВставитьСтроку(НомерСтрокиОписанияПроцедуры + 2, "");
				КоличествоСтрок = КоличествоСтрок + 1;
				НомерСтроки = НомерСтроки + 1;
				ФайлИзменен = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ФайлИзменен;
	
КонецФункции

Функция УдалитьПустыеПроцедурыИФункции(ДокументТекст)
	
	МассивУдаленныхМетодов = Новый Массив;
	
	ТекстМодуля = ДокументТекст.ПолучитьТекст();
	ТекстМодуляВРег = ВРег(ТекстМодуля);
	
	ТаблицаМетодов = ПолучитьТаблицуПроцедурИФункций(ТекстМодуля);
	Если ТаблицаМетодов.Количество() = 0 Тогда
		Возврат МассивУдаленныхМетодов;
	КонецЕсли;
	
	МассивТекстПодключаемый = Новый Массив;
	МассивТекстПодключаемый.Добавить(ВРег("Подключаемый_"));
	МассивТекстПодключаемый.Добавить(ВРег("Attachable_"));
	
	ИндексПоследнегоМетода = ТаблицаМетодов.Количество() - 1;
	Для НомерМетода = 0 По ИндексПоследнегоМетода Цикл
		
		СтрокаМетода = ТаблицаМетодов[ИндексПоследнегоМетода - НомерМетода];
		
		// Экспортные методы сразу пропускаем.
		Если СтрокаМетода.ЕстьЭкспорт Тогда
			Продолжить;
		КонецЕсли;
		
		ТелоМетода = СтрокаМетода.ТелоМетода;
		
		// Если тело метода не определено, значит, скорее всего, не нашли конец метода, пропускаем.
		Если ТелоМетода = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Если тело метода не пустое, то проверяем, возможно, оно состоит только из комментариев.
		Если НЕ ПустаяСтрока(ТелоМетода) Тогда
			
			ТелоМетодаСодержитКод = Ложь;
			
			// Проверяем, есть ли исполняемый код в этом тексте.
			ДокументТелоМетода = Новый ТекстовыйДокумент;
			ДокументТелоМетода.УстановитьТекст(ТелоМетода);
			
			КоличествоСтрок = ДокументТелоМетода.КоличествоСтрок();
			Для НомерСтроки = 1 По КоличествоСтрок Цикл
				
				СтрокаМодуля = ДокументТелоМетода.ПолучитьСтроку(НомерСтроки);
				СтрокаМодуля = СокрЛ(СтрокаМодуля);
				
				Если ПустаяСтрока(СтрокаМодуля) ИЛИ СтрНачинаетсяС(СтрокаМодуля, "//") Тогда
					Продолжить;
				КонецЕсли;
				
				// Нашли код, прерываем.
				ТелоМетодаСодержитКод = Истина;
				Прервать;
				
			КонецЦикла;
			
			Если ТелоМетодаСодержитКод Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		// Пропускаем методы с префиксом "Подключаемый_", т.к. их вызов может быть назначен в другом модуле.
		ИмяМетодаВРег = СтрокаМетода.ИмяМетодаВРег;
		Если СтрНачинаетсяСПоМассиву(ИмяМетодаВРег, МассивТекстПодключаемый).Успешно Тогда
			Продолжить;
		КонецЕсли;
		
		// Ищем вызовы этого метода в коде модуля.
		ПозицияНачалаМетода = СтрокаМетода.ПозицияНачалаМетода;
		ПозицияКонцаОписания = СтрокаМетода.ПозицияКонцаОписания;
		
		ПозицияВызова = 0;
		Пока Истина Цикл
			
			ПозицияВызова = СтрНайти(ТекстМодуляВРег, ИмяМетодаВРег,, ПозицияВызова + 1);
			Если ПозицияВызова = 0 Тогда
				Прервать;
			КонецЕсли;
			
			// Проверяем, не является ли этот вызов описанием метода.
			Если (ПозицияВызова < ПозицияНачалаМетода) ИЛИ (ПозицияВызова > ПозицияКонцаОписания) Тогда
				// Если вызов находится вне описания метода, то выходим.
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		// Есть вызов метода, пропускаем.
		Если ПозицияВызова > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПозицияНачалаУдаленияМетода = СтрокаМетода.ПозицияНачалаДирективы;
		Если ПозицияНачалаУдаленияМетода = 0 Тогда
			ПозицияНачалаУдаленияМетода = СтрокаМетода.ПозицияНачалаМетода;
		КонецЕсли;
		
		ПозицияКонцаУдаленияМетода = СтрокаМетода.ПозицияКонцаМетода;
		Если ПозицияКонцаУдаленияМетода = Неопределено Тогда
			// Не смогли найти позицию окончания метода, пропускаем.
			Продолжить;
		КонецЕсли;
		
		ТекстМодуля = Лев(ТекстМодуля, ПозицияНачалаУдаленияМетода - 1) + Сред(ТекстМодуля, ПозицияКонцаУдаленияМетода + 1);
		
		// Удаляем пустые строки до или после метода.
		СимволыДоИПослеМетода = Сред(ТекстМодуля, ПозицияНачалаУдаленияМетода - 1, 2);
		Если ПустаяСтрока(СимволыДоИПослеМетода) Тогда
			ТекстМодуля = Лев(ТекстМодуля, ПозицияНачалаУдаленияМетода - 1) + Сред(ТекстМодуля, ПозицияНачалаУдаленияМетода + 1);
		КонецЕсли;
		
		МассивУдаленныхМетодов.Вставить(0, СтрокаМетода.ИмяМетода);
		
	КонецЦикла;
	
	ДокументТекст.УстановитьТекст(ТекстМодуля);
	
	Возврат МассивУдаленныхМетодов;
	
КонецФункции

// Удаляет назначенные обработчики в форме, для которых отсутствуют события (процедуры обработчиков).
// Если передан массив, то удаляются только обработчики из массива.
// Если передано Неопределено, то удаляются все отсутствующие обработчики.
//
Функция УдалитьОтсутствующиеОбработчикиИзСобытийФормыXML(ПолноеИмяФайлаXML, МассивОбработчиковДляУдаления = Неопределено)
	
	ФайлИзменен = Ложь;
	
	МассивСуществующихМетодов = Неопределено;
	
	// Если массив обработчиков не определен, то собираем все обработчики из модуля формы.
	Если МассивОбработчиковДляУдаления = Неопределено Тогда
		
		// Ищем путь объекта по файлу XML его формы.
		ПутьОбъекта = ПолучитьЗначениеОбъекта(ПолноеИмяФайлаXML);
		Если НЕ ПустаяСтрока(ПутьОбъекта) Тогда
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Выбран", Истина);
			ПараметрыОтбора.Вставить("ЗахваченВХранилище", Истина);
			ПараметрыОтбора.Вставить("РедактированиеРазрешено", Истина);
			ПараметрыОтбора.Вставить("ПолноеИмяФайлаОкончание", СтрШаблон("%1Ext%1Form%1Module.bsl", РазделительПути));
			
			ПолноеИмяФайлаМодуля = ПолучитьЗначениеОбъекта(ПутьОбъекта, "Объект", "ПолноеИмяФайла", ПараметрыОтбора);
			
			ДокументТекст = ПолучитьТекстовыйДокументИзФайла(ПолноеИмяФайлаМодуля, КодировкаТекста.UTF8);
			Если ДокументТекст <> Неопределено Тогда
				ТаблицаМетодовМодуля = ПолучитьТаблицуПроцедурИФункций(ДокументТекст.ПолучитьТекст());
				МассивСуществующихМетодов = ТаблицаМетодовМодуля.ВыгрузитьКолонку("ИмяМетодаВРег");
			КонецЕсли;
			
		КонецЕсли;
		
		// Если не заполнен ни один из массивов, то выходим.
		Если МассивСуществующихМетодов = Неопределено Тогда
			Возврат ФайлИзменен;
		КонецЕсли;
		
	Иначе
		
		// Если не заполнен ни один из массивов, то выходим.
		Если МассивОбработчиковДляУдаления.Количество() = 0 Тогда
			Возврат ФайлИзменен;
		КонецЕсли;
		
		МассивОбработчиковДляУдаленияВРег = Новый Массив;
		
		НомерПоследнегоОбработчика = МассивОбработчиковДляУдаления.ВГраница();
		Для НомерОбработчика = 0 По НомерПоследнегоОбработчика Цикл
			МассивОбработчиковДляУдаленияВРег.Добавить(ВРег(МассивОбработчиковДляУдаления[НомерОбработчика]));
		КонецЦикла;
		
	КонецЕсли;
	
	ДокументDOM = ДокументDOM(ПолноеИмяФайлаXML);
	Если ДокументDOM = Неопределено Тогда
		// Если файл не удалось прочитать, то нет смысла записывать, поэтому возвращаем Ложь.
		Возврат Ложь;
	КонецЕсли;
	
	// Шаблон находит только обработчики формы, для обработчиков элементов необходим другой шаблон, например, "//xmlns:Events".
	ЭлементDOMСобытия = ПолучитьЭлементDOMПоВыражениюXPath("/xmlns:Form/xmlns:Events", ДокументDOM);
	Если ЭлементDOMСобытия = Неопределено Тогда
		// Если назначенных событий нет, выходим.
		Возврат ФайлИзменен;
	КонецЕсли;
	
	ЭлементDOMСобытияДочерниеУзлы = ЭлементDOMСобытия.ДочерниеУзлы;
	Если ЭлементDOMСобытияДочерниеУзлы.Количество() = 0 Тогда
		// Если дочерних узлов нет, выходим.
		Возврат ФайлИзменен;
	КонецЕсли;
	
	МассивЭлементовDOMСобытиеДляУдаления = Новый Массив;
	
	Для Каждого ЭлементDOMСобытие Из ЭлементDOMСобытияДочерниеУзлы Цикл
		
		УдалитьСобытие = Ложь;
		
		ИмяПроцедурыОбработчика = ВРег(ЭлементDOMСобытие.ТекстовоеСодержимое);
		Если ПустаяСтрока(ИмяПроцедурыОбработчика) Тогда
			Продолжить;
		КонецЕсли;
		
		Если МассивОбработчиковДляУдаления <> Неопределено Тогда
			УдалитьСобытие = (МассивОбработчиковДляУдаленияВРег.Найти(ИмяПроцедурыОбработчика) <> Неопределено);
		ИначеЕсли МассивСуществующихМетодов <> Неопределено Тогда
			УдалитьСобытие = (МассивСуществующихМетодов.Найти(ИмяПроцедурыОбработчика) = Неопределено);
		КонецЕсли;
		
		Если НЕ УдалитьСобытие Тогда
			Продолжить;
		КонецЕсли;
		
		МассивЭлементовDOMСобытиеДляУдаления.Добавить(ЭлементDOMСобытие);
		
		ФайлИзменен = Истина;
		
	КонецЦикла;
	
	Если НЕ ФайлИзменен Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	// Удаляем дочерние узлы из узла событий формы.
	Для Каждого ЭлементDOMСобытие Из МассивЭлементовDOMСобытиеДляУдаления Цикл
		ЭлементDOMСобытия.УдалитьДочерний(ЭлементDOMСобытие);
	КонецЦикла;
	
	// Если дочерних узлов нет, удаляем сам узел событий.
	Если ЭлементDOMСобытия.ДочерниеУзлы.Количество() = 0 Тогда
		ЭлементDOMСобытияРодительскийУзел = ЭлементDOMСобытия.РодительскийУзел;
		ЭлементDOMСобытияРодительскийУзел.УдалитьДочерний(ЭлементDOMСобытия);
	КонецЕсли;
	
	ЗаписатьДокументDOMВФайл(ДокументDOM, ПолноеИмяФайлаXML);
	
	Возврат ФайлИзменен;
	
КонецФункции

// Удаляет назначенные обработчики в форме, для которых отсутствуют события (процедуры обработчиков).
// Если передан массив, то удаляются только обработчики из массива.
// Если передано Неопределено, то удаляются все отсутствующие обработчики.
//
Функция УдалитьОтсутствующиеОбработчикиИзСобытийФормыEDT(ПолноеИмяФайлаXML, МассивОбработчиковДляУдаления = Неопределено)
	
	ДокументDOM = ДокументDOM(ПолноеИмяФайлаXML);
	Если ДокументDOM = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ФайлИзменен = Ложь;
	
	МассивСуществующихМетодов = Неопределено;
	
	// Если массив обработчиков не определен, то собираем все обработчики из модуля формы.
	Если МассивОбработчиковДляУдаления = Неопределено Тогда
		
		// Ищем путь объекта по файлу XML его формы.
		ПутьОбъекта = ПолучитьЗначениеОбъекта(ПолноеИмяФайлаXML);
		Если НЕ ПустаяСтрока(ПутьОбъекта) Тогда
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Выбран", Истина);
			ПараметрыОтбора.Вставить("ЗахваченВХранилище", Истина);
			ПараметрыОтбора.Вставить("РедактированиеРазрешено", Истина);
			ПараметрыОтбора.Вставить("ПолноеИмяФайлаОкончание", РазделительПути + "Module.bsl");
			
			ПолноеИмяФайлаМодуля = ПолучитьЗначениеОбъекта(ПутьОбъекта, "Объект", "ПолноеИмяФайла", ПараметрыОтбора);
			
			ДокументТекст = ПолучитьТекстовыйДокументИзФайла(ПолноеИмяФайлаМодуля, КодировкаТекста.UTF8);
			Если ДокументТекст <> Неопределено Тогда
				ТаблицаМетодовМодуля = ПолучитьТаблицуПроцедурИФункций(ДокументТекст.ПолучитьТекст());
				МассивСуществующихМетодов = ТаблицаМетодовМодуля.ВыгрузитьКолонку("ИмяМетодаВРег");
			КонецЕсли;
			
		КонецЕсли;
		
		// Если не заполнен ни один из массивов, то выходим.
		Если МассивСуществующихМетодов = Неопределено Тогда
			Возврат ФайлИзменен;
		КонецЕсли;
		
	Иначе
		
		// Если не заполнен ни один из массивов, то выходим.
		Если МассивОбработчиковДляУдаления.Количество() = 0 Тогда
			Возврат ФайлИзменен;
		КонецЕсли;
		
		МассивОбработчиковДляУдаленияВРег = Новый Массив;
		
		НомерПоследнегоОбработчика = МассивОбработчиковДляУдаления.ВГраница();
		Для НомерОбработчика = 0 По НомерПоследнегоОбработчика Цикл
			МассивОбработчиковДляУдаленияВРег.Добавить(ВРег(МассивОбработчиковДляУдаления[НомерОбработчика]));
		КонецЦикла;
		
	КонецЕсли;
	
	ЭлементDOMРодительскийУзел = ПолучитьЭлементDOMПоВыражениюXPath("/form:Form", ДокументDOM);
	Если ЭлементDOMРодительскийУзел = Неопределено Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	МассивЭлементовDOMСобытиеДляУдаления = Новый Массив;
	
	// Шаблон находит только обработчики формы, для обработчиков элементов необходим другой шаблон, например, "//handlers/name".
	РезультатXPath = ВычислитьВыражениеXPath("handlers/name", ДокументDOM, ЭлементDOMРодительскийУзел);
	Пока Истина Цикл
		
		ЭлементDOMv8Type = РезультатXPath.ПолучитьСледующий();
		Если ЭлементDOMv8Type = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		ИмяПроцедурыОбработчика = ВРег(ЭлементDOMv8Type.ТекстовоеСодержимое);
		Если ПустаяСтрока(ИмяПроцедурыОбработчика) Тогда
			Продолжить;
		КонецЕсли;
		
		Если МассивОбработчиковДляУдаления <> Неопределено Тогда
			УдалитьСобытие = (МассивОбработчиковДляУдаленияВРег.Найти(ИмяПроцедурыОбработчика) <> Неопределено);
		ИначеЕсли МассивСуществующихМетодов <> Неопределено Тогда
			УдалитьСобытие = (МассивСуществующихМетодов.Найти(ИмяПроцедурыОбработчика) = Неопределено);
		КонецЕсли;
		
		Если НЕ УдалитьСобытие Тогда
			Продолжить;
		КонецЕсли;
		
		МассивЭлементовDOMСобытиеДляУдаления.Добавить(ЭлементDOMv8Type.РодительскийУзел);
		ФайлИзменен = Истина;
		
	КонецЦикла;
	
	Если НЕ ФайлИзменен Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	// Удаляем дочерние узлы из узла событий формы.
	Для Каждого ЭлементDOMСобытие Из МассивЭлементовDOMСобытиеДляУдаления Цикл
		ЭлементDOMРодительскийУзел.УдалитьДочерний(ЭлементDOMСобытие);
	КонецЦикла;
	
	ЗаписатьДокументDOMВФайл(ДокументDOM, ПолноеИмяФайлаXML);
	
	Возврат ФайлИзменен;
	
КонецФункции

Функция ДобавитьДополнительныеОтступыВСтрокуСОписаниемПараметраИВозвращаемогоЗначения(ПолноеИмяФайла, ДокументТекст)
	
	ФайлИзменен = Ложь;
	
	КоличествоСтрок = ДокументТекст.КоличествоСтрок();
	Если КоличествоСтрок = 0 Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	ТекстМодуля = ДокументТекст.ПолучитьТекст();
	Если ПустаяСтрока(ТекстМодуля) Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	ТекстМодуля = ВРег(ТекстМодуля);
	
	МассивТекстПараметры = Контекст["МассивТекстПараметры"];
	МассивТекстВозвращаемоеЗначение = Контекст["МассивТекстВозвращаемоеЗначение"];
	
	МассивСекций = Новый Массив;
	ДополнитьМассив(МассивСекций, МассивТекстПараметры);
	ДополнитьМассив(МассивСекций, МассивТекстВозвращаемоеЗначение);
	
	// Если строка начинается с этого текста, то не двигаем ее, но проверяем параметры дальше.
	МассивИсключенийПродолжить = Новый Массив;
	МассивИсключенийПродолжить.Добавить(ВРег("Для внутреннего использования")); // АПК:1297 - не локализуется
	МассивИсключенийПродолжить.Добавить(ВРег("For internal use")); // АПК:1297 - не локализуется
	МассивИсключенийПродолжить.Добавить("-");
	ДополнитьМассив(МассивИсключенийПродолжить, МассивТекстВозвращаемоеЗначение);
	
	МассивИсключенийПрервать = Новый Массив;
	МассивИсключенийПрервать.Добавить(ВРег("Возврат"));
	МассивИсключенийПрервать.Добавить(ВРег("Return"));
	МассивИсключенийПрервать.Добавить(ВРег("Пример"));
	МассивИсключенийПрервать.Добавить(ВРег("Example"));
	ДополнитьМассив(МассивИсключенийПрервать, МассивТекстВозвращаемоеЗначение);
	
	Для Каждого ТекстСекции Из МассивСекций Цикл
		
		ПозицияСекции = 0;
		Пока Истина Цикл
			
			// Определяем описание секции по комментарию, например, "// Параметры:"
			ПозицияСекции = СтрНайти(ТекстМодуля, ТекстСекции,, ПозицияСекции + 1);
			Если ПозицияСекции = 0 Тогда
				Прервать;
			КонецЕсли;
			
			НомерСтрокиСекции = ПолучитьНомерСтрокиМодуля(ТекстМодуля, ПозицияСекции);
			СтрокаСекцииИсходная = ДокументТекст.ПолучитьСтроку(НомерСтрокиСекции);
			
			// Если это не комментарий с начала строки, то пропускаем.
			СтрокаСекции = СокрЛ(СтрокаСекцииИсходная);
			Если НЕ СтрНачинаетсяС(СтрокаСекции, "//") Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаСекции = СтрЗаменить(СтрокаСекции, "/", "");
			СтрокаСекции = СокрЛП(СтрокаСекции);
			СтрокаСекции = ВРег(СтрокаСекции);
			
			// Если комментарий не начинается с объявления секции "Параметры:" или "Возвращаемое значение", то пропускаем.
			Если НЕ СтрНачинаетсяС(СтрокаСекции, ТекстСекции) Тогда
				Продолжить;
			КонецЕсли;
			
			// Получаем отдельно отступы до и после знака комментария.
			ОтступДоЗнакаКомментарияСтрокаСекции = ПолучитьОтступДоЗнакаКомментария(СтрокаСекцииИсходная);
			ОтступПослеЗнакаКомментарияСтрокаСекции = ПолучитьОтступПослеЗнакаКомментария(СтрокаСекцииИсходная);
			
			// Запоминаем длину отступа после знака комментария.
			ДлинаОтступаПослеЗнакаКомментарияСтрокаСекции = СтрДлина(ОтступПослеЗнакаКомментарияСтрокаСекции);
			
			Для НомерСтроки = НомерСтрокиСекции + 1 По КоличествоСтрок Цикл
				
				// Если пустая строка, то комментарий закончился, прерываем.
				СтрокаМодуляИсходная = ДокументТекст.ПолучитьСтроку(НомерСтроки);
				Если ПустаяСтрока(СтрокаМодуляИсходная) Тогда
					Прервать;
				КонецЕсли;
				
				// Если это не комментарий, прерываем.
				СтрокаМодуля = СокрЛ(СтрокаМодуляИсходная);
				Если НЕ СтрНачинаетсяС(СтрокаМодуля, "//") Тогда
					Прервать;
				КонецЕсли;
				
				// Пустой комментарий в большинстве случаев подразумевает окончание секции, прерываем.
				СтрокаМодуля = СтрЗаменить(СтрокаМодуля, "/", "");
				Если ПустаяСтрока(СтрокаМодуля) Тогда
					Прервать;
				КонецЕсли;
				
				СтрокаМодуля = СокрЛ(СтрокаМодуля);
				СтрокаМодуля = ВРег(СтрокаМодуля);
				
				// Если строка начинается с исключения, например, начало следующей секции, то прерываем.
				ЭтоИсключениеПрервать = Ложь;
				Для Каждого СтрокаИсключения Из МассивИсключенийПрервать Цикл
					Если СтрНачинаетсяС(СтрокаМодуля, СтрокаИсключения) Тогда
						ЭтоИсключениеПрервать = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если ЭтоИсключениеПрервать Тогда
					Прервать;
				КонецЕсли;
				
				// Если строка начинается с исключения для дальнейшей проверки, то не двигаем ее, пропускаем.
				ЭтоИсключениеПродолжить = Ложь;
				Для Каждого СтрокаИсключения Из МассивИсключенийПродолжить Цикл
					Если СтрНачинаетсяС(СтрокаМодуля, СтрокаИсключения) Тогда
						ЭтоИсключениеПродолжить = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если ЭтоИсключениеПродолжить Тогда
					Продолжить;
				КонецЕсли;
				
				// Если отступ строки до знака комментария не совпадает с отступом строки объявления секции,
				// то непонятно, какие дополнительные отступы добавлять, прерываем.
				ОтступДоЗнакаКомментарияСтрокаМодуля = ПолучитьОтступДоЗнакаКомментария(СтрокаМодуляИсходная);
				Если ОтступДоЗнакаКомментарияСтрокаМодуля <> ОтступДоЗнакаКомментарияСтрокаСекции Тогда
					ТекстИсключения = НСтр("ru='Не совпадают размеры отступов до знака комментария секции ""Параметры"" и строки описания параметра: %Строка%';
						|en='Не совпадают размеры отступов до знака комментария секции ""Параметры"" и строки описания параметра: %Строка%'", КодОсновногоЯзыка);
					ТекстИсключения = СтрЗаменить(ТекстИсключения, "%Строка%", СокрЛП(СтрокаМодуляИсходная));
					ОбработатьИсключение(ПолноеИмяФайла, ТекстИсключения, НомерСтроки);
					Прервать;
				КонецЕсли;
				
				// Получаем длину отступа после знака комментария.
				ОтступПослеЗнакаКомментарияСтрокаМодуля = ПолучитьОтступПослеЗнакаКомментария(СтрокаМодуляИсходная);
				
				// Один таб считаем за 2 пробела.
				ОтступПослеЗнакаКомментарияСтрокаМодуля = СтрЗаменить(ОтступПослеЗнакаКомментарияСтрокаМодуля, Символы.Таб, "  ");
				ДлинаОтступаПослеЗнакаКомментарияСтрокаМодуля = СтрДлина(ОтступПослеЗнакаКомментарияСтрокаМодуля);
				РазницаДлинОтступа = ДлинаОтступаПослеЗнакаКомментарияСтрокаМодуля - ДлинаОтступаПослеЗнакаКомментарияСтрокаСекции;
				
				ДополнительныйОтступ = "";
				Если РазницаДлинОтступа < 0 Тогда
					// Комментарий к параметру располагается левее, чем объявление секции.
					// Возможно, это другая секция, закомментированный код или какой-либо пример, прерываем.
					Прервать;
				ИначеЕсли РазницаДлинОтступа = 0 Тогда
					// Отступы равны, добавляем дополнительный отступ в 2 пробела.
					ДополнительныйОтступ = "  ";
				ИначеЕсли (РазницаДлинОтступа = 1) Тогда
					// Если разница отступов = 1, и это свойство параметра, то добавляем 1 дополнительный пробел.
					Если СтрНачинаетсяС(СтрокаМодуля, "*") Тогда
						ДополнительныйОтступ = " ";
					ИначеЕсли СтрНачинаетсяС(ВРег(СтрокаМодуля), ВРег("см.")) Тогда
						// Если это гиперссылка, то добавляем дополнительные пробелы
						// в зависимости от места положения комментария относительно объявления секции.
						Если (НомерСтрокиСекции + 1 = НомерСтроки) Тогда
							// Если гиперссылка на следующей строке после секции "Возвращаемое значение", то добавляем 1 пробел.
							Если СтрНайтиПоМассиву(ТекстСекции, МассивТекстВозвращаемоеЗначение).Успешно Тогда
								ДополнительныйОтступ = " ";
							Иначе
								// Если гиперссылка находится на следующей строке после секции "Параметры",
								// то это неверное оформление параметров, пропускаем.
								Продолжить;
							КонецЕсли;
						Иначе
							// Если ниже, то сдвигаем на 3 пробела.
							ДополнительныйОтступ = "   ";
						КонецЕсли;
					Иначе
						Продолжить;
					КонецЕсли;
				Иначе
					// Параметр описан с дополнительными отступами правее объявления секции, пропускаем.
					Продолжить;
				КонецЕсли;
				
				ПозицияПервогоСимволаПослеЗнакаКомментария = СтрДлина(ОтступДоЗнакаКомментарияСтрокаМодуля + "//") + 1;
				ДлинаСтроки = СтрДлина(СтрокаМодуляИсходная);
				
				// Ищем первый символ после знака комментария.
				Для ПозицияСимвола = ПозицияПервогоСимволаПослеЗнакаКомментария По ДлинаСтроки Цикл
					Символ = Сред(СтрокаМодуляИсходная, ПозицияСимвола, 1);
					Если Символ <> "/" Тогда
						ПозицияПервогоСимволаПослеЗнакаКомментария = ПозицияСимвола;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				// Если после символов комментария нет непустых символов, то добавлять отступ не нужно, пропускаем.
				СтрокаМодуляПослеЗнакаКомментария = Сред(СтрокаМодуляИсходная, ПозицияПервогоСимволаПослеЗнакаКомментария);
				Если ПустаяСтрока(СтрокаМодуляПослеЗнакаКомментария) Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаМодуляСоЗнакомКомментария = Лев(СтрокаМодуляИсходная, ПозицияПервогоСимволаПослеЗнакаКомментария - 1);
				СтрокаМодуляСДополнительнымОтступом = СтрокаМодуляСоЗнакомКомментария + ДополнительныйОтступ + СтрокаМодуляПослеЗнакаКомментария;
				
				ДокументТекст.ЗаменитьСтроку(НомерСтроки, СтрокаМодуляСДополнительнымОтступом);
				
				ФайлИзменен = Истина;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ФайлИзменен;
	
КонецФункции

Функция ИсправитьЗнакМинусВДругихКодировках(ДокументТекст)
	
	ФайлИзменен = Ложь;
	
	КоличествоСтрок = ДокументТекст.КоличествоСтрок();
	Если КоличествоСтрок = 0 Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	ТекстМодуля = ДокументТекст.ПолучитьТекст();
	Если ПустаяСтрока(ТекстМодуля) Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	МассивЗнаковМинус = Новый Массив;
	МассивЗнаковМинус.Добавить(Символ(173));
	МассивЗнаковМинус.Добавить(Символ(8210));
	МассивЗнаковМинус.Добавить(Символ(8211));
	МассивЗнаковМинус.Добавить(Символ(8212));
	МассивЗнаковМинус.Добавить(Символ(8213));
	МассивЗнаковМинус.Добавить(Символ(8722));
	
	Для Каждого ЗнакМинус Из МассивЗнаковМинус Цикл
		
		ПозицияЗнакаМинус = 0;
		Пока Истина Цикл
			
			ПозицияЗнакаМинус = СтрНайти(ТекстМодуля, ЗнакМинус,, ПозицияЗнакаМинус + 1);
			Если ПозицияЗнакаМинус = 0 Тогда
				Прервать;
			КонецЕсли;
			
			СтрокаИзменена = Ложь;
			
			НомерСтроки = ПолучитьНомерСтрокиМодуля(ТекстМодуля, ПозицияЗнакаМинус);
			СтрокаМодуля = ДокументТекст.ПолучитьСтроку(НомерСтроки);
			
			// Ищем комментарий в строке.
			ПозицияКомментария = СтрНайти(СтрокаМодуля, "//");
			
			// Если строка не содержит комментарий, то пропускаем ее, т.к. минусы в коде заменять не нужно.
			Если ПозицияКомментария = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			// Если строка модуля полностью является комментарием, то заменяем знак минус во всей строке.
			СтрокаМодуляСокрЛ = СокрЛ(СтрокаМодуля);
			Если СтрНачинаетсяС(СтрокаМодуляСокрЛ, "//") Тогда
				
				СтрокаМодуля = СтрЗаменить(СтрокаМодуля, ЗнакМинус, "-");
				СтрокаИзменена = Истина;
				
			Иначе
				
				СтрокаНачинаетсяСоСтроковойКонстанты = СтрНачинаетсяС(СтрокаМодуляСокрЛ, "|");
				
				// Если комментарий внутри строки, то надо заменить минусы только после знака комментария.
				// Получаем комментарий из строки.
				ПозицияКомментария = ПозицияКомментария - 1;
				Пока Истина Цикл
					
					ПозицияКомментария = СтрНайти(СтрокаМодуля, "//",, ПозицияКомментария + 1);
					Если ПозицияКомментария = 0 Тогда
						Прервать;
					КонецЕсли;
					
					// Проверяем, находится ли знак комментария в строковой константе.
					СтрокаДоКомментария = Лев(СтрокаМодуля, ПозицияКомментария - 1);
					КоличествоКавычек = СтрЧислоВхождений(СтрокаДоКомментария, """");
					КоличествоКавычекЧетное = (КоличествоКавычек % 2 = 0);
					
					// Если знак комментария находится за строковой константой, то комментарий найден, прерываем.
					Если (СтрокаНачинаетсяСоСтроковойКонстанты И (НЕ КоличествоКавычекЧетное))
					 ИЛИ ((НЕ СтрокаНачинаетсяСоСтроковойКонстанты) И КоличествоКавычекЧетное) Тогда
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
				// Если комментарий не нашли, то пропускаем строку.
				Если ПозицияКомментария = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				// Получаем текст комментария.
				ТекстКомментария = Сред(СтрокаМодуля, ПозицияКомментария);
				// Проверяем, что в нем есть знак минус в другой кодировке.
				Если СтрНайти(ТекстКомментария, ЗнакМинус) > 0 Тогда
					// Тогда заменяем его и склеиваем строку модуля.
					ТекстКомментария = СтрЗаменить(ТекстКомментария, ЗнакМинус, "-");
					СтрокаМодуля = Лев(СтрокаМодуля, ПозицияКомментария - 1) + ТекстКомментария;
					СтрокаИзменена = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			Если СтрокаИзменена Тогда
				ДокументТекст.ЗаменитьСтроку(НомерСтроки, СтрокаМодуля);
				ТекстМодуля = ДокументТекст.ПолучитьТекст();
				ФайлИзменен = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ФайлИзменен;
	
КонецФункции

Функция УдалитьКомментарийПослеКонецПроцедурыФункции(Знач СтрокаМодуля)
	
	МассивТекстКонецПроцедурыФункции = Контекст["МассивТекстКонецПроцедурыФункции"];
	
	СтрокаМодуляВРег = ВРег(СтрокаМодуля);
	СтрокаМодуляВРег = СокрЛП(СтрокаМодуляВРег);
	
	// Проверяем, что строка содержит окончание процедуры или функции.
	РезультатПоискаКонецПроцедурыФункции = СтрНачинаетсяСПоМассиву(СтрокаМодуляВРег, МассивТекстКонецПроцедурыФункции);
	Если НЕ РезультатПоискаКонецПроцедурыФункции.Успешно Тогда
		// Если нет, то выходим.
		Возврат СтрокаМодуля;
	КонецЕсли;
	
	// Если в строке только текст окончания процедуры или функции, то выходим.
	НайденныйЭлемент = РезультатПоискаКонецПроцедурыФункции.НайденныйЭлемент;
	Если СтрокаМодуляВРег = НайденныйЭлемент Тогда
		Возврат СтрокаМодуля;
	КонецЕсли;
	
	// Проверяем следующий символ.
	СледующийСимвол = Сред(СтрокаМодуляВРег, СтрДлина(НайденныйЭлемент) + 1, 1);
	Если апк_СловоСодержитЗначимыеСимволы(СледующийСимвол) Тогда
		// Если следующий символ после окончания процедуры или функции - значимый, тогда это не окончание процедуры или функции.
		Возврат СтрокаМодуля;
	КонецЕсли;
	
	// Ищем комментарий в исходной строке.
	ПозицияКомментария = СтрНайти(СтрокаМодуля, "//");
	Если ПозицияКомментария = 0 Тогда
		Возврат СтрокаМодуля;
	КонецЕсли;
	
	// Удаляем комментарий из строки.
	СтрокаМодуля = Лев(СтрокаМодуля, ПозицияКомментария - 1);
	СтрокаМодуля = СокрЛП(СтрокаМодуля);
	
	Возврат СтрокаМодуля;
	
КонецФункции

// Если в первой строке комментария перед методом содержит гиперссылку "см.",
// то функция удаляет весь комментарий, расположенный ниже гиперссылки, оставляя только текст гиперссылки.
// Нюансы и исключения:
// 1. Остаются служебные комментарии, содержащие «//@», «//АПК:» и «//ACC:».
// 2. Текст ниже гиперссылки не удаляется, т.е. комментарий остается в исходном виде, если:
//   2.1. Объект (процедура/функция) гиперссылки не существует.
//   2.2. Состав реальных параметров описываемой процедуры и процедуры из гиперссылки не совпадает.
//
Функция ОчиститьКомментарийПередМетодомСодержащийГиперссылку(СтрокаМетодаМодуля)
	
	ТекстКомментарияМетода = СтрокаМетодаМодуля.ТекстКомментарияМетода;
	Если ПустаяСтрока(ТекстКомментарияМетода) Тогда
		Возврат "";
	КонецЕсли;
	
	// Если комментарий перед процедурой (функцией) содержит только одну строку, то пропускаем.
	КоличествоСтрокКомментария = СтрЧислоСтрок(ТекстКомментарияМетода);
	Если КоличествоСтрокКомментария = 1 Тогда
		Возврат "";
	КонецЕсли;
	
	МассивТекстСм = Контекст["МассивТекстСм"];
	
	ТекстКомментарияМетодаБуфер = СтрЗаменить(ТекстКомментарияМетода, "/", "");
	ТекстКомментарияМетодаБуфер = СокрЛП(ТекстКомментарияМетодаБуфер);
	ТекстКомментарияМетодаБуфер = ВРег(ТекстКомментарияМетодаБуфер);
	
	РезультатПоискаТекстаСм = СтрНачинаетсяСПоМассиву(ТекстКомментарияМетодаБуфер, МассивТекстСм);
	
	// Если текст комментария не начинается с "См.", то это не гиперссылка, выходим.
	Если НЕ РезультатПоискаТекстаСм.Успешно Тогда
		Возврат "";
	КонецЕсли;
	
	ДокументТекстКомментария = Новый ТекстовыйДокумент;
	ДокументТекстКомментария.УстановитьТекст(ТекстКомментарияМетода);
	
	// Получаем исходную строку с гиперссылкой из текста комментария.
	СтрокаГиперссылки = "";
	Для НомерСтрокиКомментария = 1 По КоличествоСтрокКомментария Цикл
		СтрокаКомментария = ДокументТекстКомментария.ПолучитьСтроку(НомерСтрокиКомментария);
		СтрокаКомментарияБуфер = СтрЗаменить(СтрокаКомментария, "/", "");
		Если НЕ ПустаяСтрока(СтрокаКомментарияБуфер) Тогда
			СтрокаГиперссылки = СтрокаКомментария;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	СтрокаГиперссылки = СокрЛП(СтрокаГиперссылки);
	
	// Если после сокращений строк пустых символов осталась только одна строка,
	// то не проверяем гиперссылку и выходим с исходной строкой.
	Если СтрЧислоСтрок(ТекстКомментарияМетодаБуфер) = 1 Тогда
		Возврат СтрокаГиперссылки;
	КонецЕсли;
	
	// Выделяем текст объекта гиперссылки из текста комментария метода.
	МассивТекстГиперссылокСм = Контекст["МассивТекстГиперссылокСм"];
	РезультатПоискаГиперссылки = СтрНайтиПоМассиву(ВРег(СтрокаГиперссылки), МассивТекстГиперссылокСм,,, Истина);
	Если НЕ РезультатПоискаГиперссылки.Успешно Тогда
		// Если не нашли текст с указателем гиперссылки, то выходим.
		Возврат "";
	КонецЕсли;
	
	ПозицияГиперссылки = РезультатПоискаГиперссылки.Позиция;
	НайденныйУказательГиперссылки = РезультатПоискаГиперссылки.НайденныйЭлемент;
	ТекстОбъектаГиперссылки = Сред(СтрокаГиперссылки, ПозицияГиперссылки + СтрДлина(НайденныйУказательГиперссылки));
	Если ПустаяСтрока(ТекстОбъектаГиперссылки) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстОбъектаГиперссылки = СтрЗаменить(ТекстОбъектаГиперссылки, "()", "");
	ТекстОбъектаГиперссылки = СтрСоединить(СтрРазделить(ТекстОбъектаГиперссылки, ".", Ложь), ".");
	ТекстОбъектаГиперссылки = СокрЛП(ТекстОбъектаГиперссылки);
	
	// Проверяем объект гиперссылки.
	СтрокаОбъектаПереадресации = ПолучитьОбъектПереадресацииИзГиперссылки(ТекстОбъектаГиперссылки, Новый ТаблицаЗначений);
	Если СтрокаОбъектаПереадресации = Неопределено Тогда
		// Если не удалось определить объект из гиперссылки, то выходим.
		Возврат "";
	КонецЕсли;
	
	// Если объект из гиперссылки не существует, то выходим.
	Если НЕ СтрокаОбъектаПереадресации.Существует Тогда
		Возврат "";
	КонецЕсли;
	
	// Проверяем метод из гиперссылки.
	МетодПереадресации = СтрокаОбъектаПереадресации.МетодПереадресации;
	Если МетодПереадресации = Неопределено Тогда
		// Если метод не определен, то выходим.
		Возврат "";
	КонецЕсли;
	
	// Проверяем параметры метода переадресации.
	МассивПараметровМетодаМодуля = СтрокаМетодаМодуля.МассивПараметров;
	МассивПараметровМетодаПереадресации = МетодПереадресации.МассивПараметров;
	Если МассивПараметровМетодаМодуля.Количество() <> МассивПараметровМетодаПереадресации.Количество() Тогда
		// Состав параметров текущего метода не соответствует составу параметров метода переадресации, выходим.
		Возврат "";
	КонецЕсли;
	
	// Сравниваем параметры по элементам.
	ПараметрыМетодовРавны = Истина;
	НомерПараметра = -1;
	Для Каждого ПараметрМетодаМодуля Из МассивПараметровМетодаМодуля Цикл
		НомерПараметра = НомерПараметра + 1;
		ПараметрМетодаПереадресации = МассивПараметровМетодаПереадресации[НомерПараметра];
		Если ПолучитьИмяПараметра(ПараметрМетодаМодуля) <> ПолучитьИмяПараметра(ПараметрМетодаПереадресации) Тогда
			ПараметрыМетодовРавны = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ПараметрыМетодовРавны Тогда
		// Состав параметров текущего метода не соответствует составу параметров метода переадресации, выходим.
		Возврат "";
	КонецЕсли;
	
	ТекстСм = РезультатПоискаТекстаСм.НайденныйЭлемент;
	
	// Иначе приводим строку комментария с объектом гиперссылки к правильному виду.
	СтрокаГиперссылки = СтрШаблон("// %1 %2", ТРег(ТекстСм), ТекстОбъектаГиперссылки);
	
	// Добавляем в общий комментарий служебные комментарии, если они есть.
	МассивСлужебныхКомментариев = Контекст["МассивСлужебныхКомментариев"];
	НовыйТекстКомментарияМетода = СтрокаГиперссылки;
	Для НомерСтрокиКомментария = 1 По КоличествоСтрокКомментария Цикл
		
		СтрокаКомментария = ДокументТекстКомментария.ПолучитьСтроку(НомерСтрокиКомментария);
		
		СтрокаКомментарияБуфер = СтрокаКомментария;
		СтрокаКомментарияБуфер = СтрЗаменить(СтрокаКомментарияБуфер, Символы.Таб, "");
		СтрокаКомментарияБуфер = СтрЗаменить(СтрокаКомментарияБуфер, " ", "");
		
		Если СтрНачинаетсяСПоМассиву(СтрокаКомментарияБуфер, МассивСлужебныхКомментариев).Успешно Тогда
			НовыйТекстКомментарияМетода = НовыйТекстКомментарияМетода + Символы.ПС + СтрокаКомментария;
		КонецЕсли;
		
	КонецЦикла;
	
	// Если количество строк больше одной, то добавляем строку с пустым комментарием в конец.
	Если СтрЧислоСтрок(НовыйТекстКомментарияМетода) > 1 Тогда
		НовыйТекстКомментарияМетода = НовыйТекстКомментарияМетода + Символы.ПС + "//";
	КонецЕсли;
	
	Возврат НовыйТекстКомментарияМетода;
	
КонецФункции

Функция ВставитьПустойКомментарийПередНачаломПроцедурыФункции(ТекстКомментарияМетода)
	
	Если ПустаяСтрока(ТекстКомментарияМетода) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Если комментарий перед процедурой (функцией) содержит только одну строку, то пропускаем.
	// Возможна неоднозначная ситуация, например, когда этот комментарий является служебным:
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	КоличествоСтрокКомментария = СтрЧислоСтрок(ТекстКомментарияМетода);
	Если КоличествоСтрокКомментария = 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Проверяем последнюю строку комментария.
	ПоследняяСтрокаКомментария = СтрПолучитьСтроку(ТекстКомментарияМетода, КоличествоСтрокКомментария);
	
	// Удаляем символы комментария.
	ПоследняяСтрокаКомментария = СтрЗаменить(ПоследняяСтрокаКомментария, "/", "");
	Если ПустаяСтрока(ПоследняяСтрокаКомментария) Тогда
		// Последняя строка комментария уже содержит пустой комментарий, выходим.
		Возврат Ложь;
	КонецЕсли;
	
	// Вставляем пустой комментарий.
	ТекстКомментарияМетода = ТекстКомментарияМетода + Символы.ПС + "//";
	
	Возврат Истина;
	
КонецФункции

Процедура ПереопределитьОписаниеПараметра(СтрокаОписанияПараметра, ПерваяСтрокаПолногоОписанияПараметра)
	
	// Запоминаем позицию текстового описания параметра до переопределения.
	ПозицияТекстовогоОписанияПараметраДоПереопределения = СтрокаОписанияПараметра.ПозицияТекстовогоОписанияПараметра;
	
	// Флаг "ОписаниеПараметраНачинаетсяСоЗвездочки" оставляем, т.к. он понадобится в нескольких исправлениях.
	ОписаниеПараметраНачинаетсяСоЗвездочки = СтрокаОписанияПараметра.ОписаниеПараметраНачинаетсяСоЗвездочки;
	
	// Получаем структуру описания параметра по новой первой строке полного описания параметра.
	ПолучатьИмяПараметра = НЕ ПустаяСтрока(СтрокаОписанияПараметра.ИмяПараметра);
	СтруктураОписанияПараметра = ПолучитьСтруктуруОписанияПараметра(ПерваяСтрокаПолногоОписанияПараметра, ПолучатьИмяПараметра, 0);
	
	// Переопределяем все свойства, кроме уровня вложенности и текстового описания.
	ЗаполнитьЗначенияСвойств(СтрокаОписанияПараметра, СтруктураОписанияПараметра,, "УровеньВложенностиПараметра, ТекстовоеОписаниеПараметра");
	
	// Переопределяем полное и текстовое описания параметра.
	МассивСтрокОписания = СтрРазделить(СтрокаОписанияПараметра.ПолноеОписаниеПараметра, Символы.ПС, Истина);
	МассивСтрокОписания[0] = ПерваяСтрокаПолногоОписанияПараметра;
	СтрокаОписанияПараметра.ПолноеОписаниеПараметра = СтрСоединить(МассивСтрокОписания, Символы.ПС);
	
	МассивСтрокОписания = СтрРазделить(СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра, Символы.ПС, Истина);
	// Если позиция текстового описания до переопределения была больше 0, то заменяем первую строку.
	Если ПозицияТекстовогоОписанияПараметраДоПереопределения > 0 Тогда
		МассивСтрокОписания[0] = СтруктураОписанияПараметра.ТекстовоеОписаниеПараметра;
	Иначе
		// Иначе добавляем новое текстовое описание в начало старого.
		МассивСтрокОписания.Вставить(0, СтруктураОписанияПараметра.ТекстовоеОписаниеПараметра);
	КонецЕсли;
	СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра = СокрЛ(СтрСоединить(МассивСтрокОписания, Символы.ПС));
	
	СтрокаОписанияПараметра.ОписаниеПараметраНачинаетсяСоЗвездочки = ОписаниеПараметраНачинаетсяСоЗвездочки;
	СтрокаОписанияПараметра.СостояниеПараметра = "Изменен";
	
КонецПроцедуры

Процедура УдалитьЛишниеСимволыИзОписанияПараметра(СтрокаОписанияПараметра)
	
	// Проверяем только первую строку описания параметра.
	ПолноеОписаниеПараметра = СтрокаОписанияПараметра.ПолноеОписаниеПараметра;
	ПерваяСтрокаПолногоОписанияПараметра = СтрПолучитьСтроку(ПолноеОписаниеПараметра, 1);
	
	ПерваяСтрокаПолногоОписанияПараметраБуфер = ПерваяСтрокаПолногоОписанияПараметра;
	ПерваяСтрокаПолногоОписанияПараметраБуфер = СтрЗаменить(ПерваяСтрокаПолногоОписанияПараметраБуфер, " ", "");
	ПерваяСтрокаПолногоОписанияПараметраБуфер = СтрЗаменить(ПерваяСтрокаПолногоОписанияПараметраБуфер, Символы.Таб, "");
	
	МассивЛишнихСимволов = Контекст["МассивЛишнихСимволов"];
	
	РезультатПоискаЛишнихСимволов = СтрНайтиПоМассиву(ПерваяСтрокаПолногоОписанияПараметраБуфер, МассивЛишнихСимволов);
	Если НЕ РезультатПоискаЛишнихСимволов.Успешно Тогда
		Возврат;
	КонецЕсли;
	
	МассивТире = Контекст["МассивТире"];
	
	ОписаниеПараметраИзменено = Ложь;
	
	// Рассмотрим следующие ситуации:
	// 1. Текстовое описание параметра начинается с запятой (случай "-,").
	ТекстовоеОписаниеПараметра = СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра;
	Если СтрНачинаетсяС(ТекстовоеОписаниеПараметра, ",") Тогда
		
		// Возможны 2 случая:
		// 1.1. Тип параметра описан неверно, тогда лишнее тире, например:
		// Структура - , ФиксированнаяСтруктура,
		// 1.2. Тип параметра описан верно, тогда лишняя запятая, например:
		// Массив - , содержащий полные имена объектов метаданных.
		
		// Чтобы понять, какой из случаев обрабатывать, определим, является ли начало текстового описания типом параметра.
		// Для этого удаляем первую запятую из текстового описания.
		ТекстовоеОписаниеПараметра = УдалитьПервыйНезначимыйСимволИзСтроки(ТекстовоеОписаниеПараметра);
		Если СтрокаНачинаетсяСТипаПараметра(ТекстовоеОписаниеПараметра).Успешно Тогда
			
			// Если текстовое описание начинается с типа параметра, то обрабатываем случай 1.1.
			ПозицияРазделителяПередТекстовымОписаниемПараметра = СтрокаОписанияПараметра.ПозицияРазделителяПередТекстовымОписаниемПараметра;
			Если ПозицияРазделителяПередТекстовымОписаниемПараметра > 0 Тогда
				ПерваяСтрокаПолногоОписанияПараметраДоТире = Лев(ПерваяСтрокаПолногоОписанияПараметра, ПозицияРазделителяПередТекстовымОписаниемПараметра - 1);
				ПерваяСтрокаПолногоОписанияПараметраПослеТире = Сред(ПерваяСтрокаПолногоОписанияПараметра, ПозицияРазделителяПередТекстовымОписаниемПараметра + 1);
				ПерваяСтрокаПолногоОписанияПараметра = СокрП(ПерваяСтрокаПолногоОписанияПараметраДоТире) + СокрЛ(ПерваяСтрокаПолногоОписанияПараметраПослеТире);
				
				ОписаниеПараметраИзменено = Истина;
			КонецЕсли;
			
		Иначе
			
			// Если текстовое описание не начинается с типа параметра, то обрабатываем случай 1.2.
			ПерваяСтрокаТекстовогоОписанияПараметра = СтрПолучитьСтроку(ТекстовоеОписаниеПараметра, 1);
			ПозицияТекстовогоОписанияПараметра = СтрокаОписанияПараметра.ПозицияТекстовогоОписанияПараметра;
			Если ПозицияТекстовогоОписанияПараметра > 0 Тогда
				ПерваяСтрокаПолногоОписанияПараметраДоТекстовогоОписания = Лев(ПерваяСтрокаПолногоОписанияПараметра, ПозицияТекстовогоОписанияПараметра - 1);
				ПерваяСтрокаПолногоОписанияПараметра = ПерваяСтрокаПолногоОписанияПараметраДоТекстовогоОписания + ПерваяСтрокаТекстовогоОписанияПараметра;
				
				ОписаниеПараметраИзменено = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Если описание параметра было изменено, то переопределяем все колонки строки описания параметра.
	Если ОписаниеПараметраИзменено Тогда
		ПереопределитьОписаниеПараметра(СтрокаОписанияПараметра, ПерваяСтрокаПолногоОписанияПараметра);
		ОписаниеПараметраИзменено = Ложь;
	КонецЕсли;
	
	// 2. Тип параметра заканчивается на запятую (случай ",-").
	ТипПараметра = СтрокаОписанияПараметра.ТипПараметра;
	ПозицияРазделителяПередТекстовымОписаниемПараметра = СтрокаОписанияПараметра.ПозицияРазделителяПередТекстовымОписаниемПараметра;
	Если СтрЗаканчиваетсяНа(ТипПараметра, ",") И (ПозицияРазделителяПередТекстовымОписаниемПараметра > 0) Тогда
		
		// Возможны 2 случая:
		// 2.1. Тип параметра описан неверно, тогда лишнее тире, например:
		// Объект - КонстантаМенеджерЗначения, - СправочникОбъект, ДокументОбъект,
		// 2.2. Тип параметра описан верно, тогда лишняя запятая, например:
		// Массив, - содержащий полные имена объектов метаданных.
		
		// Чтобы понять, какой из случаев обрабатывать, определим, является ли начало текстового описания типом параметра.
		ТекстовоеОписаниеПараметра = СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра;
		Если СтрокаНачинаетсяСТипаПараметра(ТекстовоеОписаниеПараметра).Успешно Тогда
			
			// Если текстовое описание начинается с типа параметра, то обрабатываем случай 2.1.
			ПерваяСтрокаПолногоОписанияПараметраДоТире = Лев(ПерваяСтрокаПолногоОписанияПараметра, ПозицияРазделителяПередТекстовымОписаниемПараметра - 1);
			ПерваяСтрокаПолногоОписанияПараметраПослеТире = Сред(ПерваяСтрокаПолногоОписанияПараметра, ПозицияРазделителяПередТекстовымОписаниемПараметра + 1);
			ПерваяСтрокаПолногоОписанияПараметра = ПерваяСтрокаПолногоОписанияПараметраДоТире + СокрЛ(ПерваяСтрокаПолногоОписанияПараметраПослеТире);
			
			ОписаниеПараметраИзменено = Истина;
			
		Иначе
			
			// Если текстовое описание не начинается с типа параметра, то обрабатываем случай 2.2.
			ПозицияЗапятой = СтрНайти(ПерваяСтрокаПолногоОписанияПараметра, ",", НаправлениеПоиска.СКонца, ПозицияРазделителяПередТекстовымОписаниемПараметра);
			ПерваяСтрокаПолногоОписанияПараметраДоЗапятой = Лев(ПерваяСтрокаПолногоОписанияПараметра, ПозицияЗапятой - 1);
			ПерваяСтрокаПолногоОписанияПараметраПослеЗапятой = Сред(ПерваяСтрокаПолногоОписанияПараметра, ПозицияЗапятой + 1);
			ПерваяСтрокаПолногоОписанияПараметра = СокрП(ПерваяСтрокаПолногоОписанияПараметраДоЗапятой) + ПерваяСтрокаПолногоОписанияПараметраПослеЗапятой;
			
			ОписаниеПараметраИзменено = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Если описание параметра было изменено, то переопределяем все колонки строки описания параметра.
	Если ОписаниеПараметраИзменено Тогда
		ПереопределитьОписаниеПараметра(СтрокаОписанияПараметра, ПерваяСтрокаПолногоОписанияПараметра);
		ОписаниеПараметраИзменено = Ложь;
	КонецЕсли;
	
	// 3. Лишнее тире в полном описании параметра (случай "--").
	ПозицияВторогоТире = 0;
	Пока Истина Цикл
		
		// Ищем первое тире.
		Если ПозицияВторогоТире > 0 Тогда
			// Если второе тире определено, то переопределяем его позицией первое тире.
			ПозицияПервогоТире = ПозицияВторогоТире;
		Иначе
			ПозицияПервогоТире = СтрНайтиПоМассиву(ПерваяСтрокаПолногоОписанияПараметра, МассивТире,, ПозицияВторогоТире + 1).Позиция;
			Если ПозицияПервогоТире = 0 Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
		// Если строка заканчивается на тире, то прерываем.
		Если ПозицияПервогоТире >= СтрДлина(ПерваяСтрокаПолногоОписанияПараметра) Тогда
			Прервать;
		КонецЕсли;
		
		// Ищем второе тире.
		ПозицияВторогоТире = СтрНайтиПоМассиву(ПерваяСтрокаПолногоОписанияПараметра, МассивТире,, ПозицияПервогоТире + 1, Истина).Позиция;
		Если ПозицияВторогоТире = 0 Тогда
			Прервать;
		КонецЕсли;
		
		// Если текст между тире не пустой, то пропускаем.
		ТекстМеждуТире = Сред(ПерваяСтрокаПолногоОписанияПараметра, ПозицияПервогоТире + 1, ПозицияВторогоТире - ПозицияПервогоТире - 1);
		Если НЕ ПустаяСтрока(ТекстМеждуТире) Тогда
			Продолжить;
		КонецЕсли;
		
		// Получаем текст до первого тире.
		ПерваяСтрокаПолногоОписанияПараметраДоПервогоТире = Лев(ПерваяСтрокаПолногоОписанияПараметра, ПозицияПервогоТире - 1);
		
		// Если строка до первого тире пустая, т.е. полное описание параметра начинается с "--", то пропускаем эту замену.
		ПерваяСтрокаПолногоОписанияПараметраДоПервогоТиреБуфер = СтрЗаменить(ПерваяСтрокаПолногоОписанияПараметраДоПервогоТире, "/", "");
		Если ПустаяСтрока(ПерваяСтрокаПолногоОписанияПараметраДоПервогоТиреБуфер) Тогда
			Продолжить;
		КонецЕсли;
		
		ПоследнийСимволДоПервогоТире = Прав(ПерваяСтрокаПолногоОписанияПараметраДоПервогоТире, 1);
		Если НЕ ПустаяСтрока(ПоследнийСимволДоПервогоТире) Тогда
			// Если до первого тире нет пробелов, то добавляем один пробел.
			ПерваяСтрокаПолногоОписанияПараметраДоПервогоТире = ПерваяСтрокаПолногоОписанияПараметраДоПервогоТире + " ";
		КонецЕсли;
		
		// Получаем текст после второго тире.
		ПерваяСтрокаПолногоОписанияПараметраПослеВторогоТире = Сред(ПерваяСтрокаПолногоОписанияПараметра, ПозицияВторогоТире + 1);
		ПервыйСимволПослеВторогоТире = Лев(ПерваяСтрокаПолногоОписанияПараметраПослеВторогоТире, 1);
		Если НЕ ПустаяСтрока(ПервыйСимволПослеВторогоТире) Тогда
			// Если после второго тире нет пробелов, то добавляем один пробел.
			ПерваяСтрокаПолногоОписанияПараметраПослеВторогоТире = " " + ПерваяСтрокаПолногоОписанияПараметраПослеВторогоТире;
		КонецЕсли;
		
		// Склеиваем результирующую строку описания параметра.
		ПерваяСтрокаПолногоОписанияПараметра = ПерваяСтрокаПолногоОписанияПараметраДоПервогоТире + "-" + ПерваяСтрокаПолногоОписанияПараметраПослеВторогоТире;
		
		// Переопределяем позицию поиска тире.
		ПозицияВторогоТире = СтрДлина(ПерваяСтрокаПолногоОписанияПараметраДоПервогоТире) + 1;
		
		ОписаниеПараметраИзменено = Истина;
		
	КонецЦикла;
	
	// Если описание параметра было изменено, то переопределяем все колонки строки описания параметра.
	Если ОписаниеПараметраИзменено Тогда
		ПереопределитьОписаниеПараметра(СтрокаОписанияПараметра, ПерваяСтрокаПолногоОписанияПараметра);
		ОписаниеПараметраИзменено = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьТекстОбязательныйНеобязательныйИзОписанияПараметра(СтрокаОписанияПараметра)
	
	// Обрабатываем только параметры процедур и функций, поэтому секцию "Возвращаемое значение" проверять бесполезно.
	Если СтрокаОписанияПараметра.СекцияОписания = "ВозвращаемоеЗначение" Тогда
		Возврат;
	КонецЕсли;
	
	// Если имя параметра не задано, то пропускаем.
	ИмяПараметра = СтрокаОписанияПараметра.ИмяПараметра;
	Если ПустаяСтрока(ИмяПараметра) Тогда
		Возврат;
	КонецЕсли;
	
	// Если уровень вложенности параметра больше 0 или имя параметра начинается с "*",
	// то это не параметр процедуры или функции, а свойство параметра, например, ключ структуры или колонка таблицы значений.
	Если (СтрокаОписанияПараметра.УровеньВложенностиПараметра > 0) ИЛИ СтрНачинаетсяС(ИмяПараметра, "*") Тогда
		Возврат;
	КонецЕсли;
	
	// Получаем первую строку полного описания параметра для поиска текстов "обязательный" и "необязательный".
	ПолноеОписаниеПараметра = СтрокаОписанияПараметра.ПолноеОписаниеПараметра;
	ПерваяСтрокаПолногоОписанияПараметра = СтрПолучитьСтроку(ПолноеОписаниеПараметра, 1);
	
	// Ищем различные варианты текстов "обязательный" и "необязательный" в первой строке описания параметра.
	МассивТекстОбязательныйНеобязательный = Контекст["МассивТекстОбязательныйНеобязательный"];
	СтруктураПоиска = СтрНайтиПоМассиву(ВРег(ПерваяСтрокаПолногоОписанияПараметра), МассивТекстОбязательныйНеобязательный);
	Если НЕ СтруктураПоиска.Успешно Тогда
		// Если не нашли, то выходим.
		Возврат;
	КонецЕсли;
	
	// Проверяем исключение конструкции текста "обязательный".
	МассивТекстИсключенийОбязательный = Контекст["МассивТекстИсключенийОбязательный"];
	СтруктураПоискаИсключения = СтрНайтиПоМассиву(ВРег(ПерваяСтрокаПолногоОписанияПараметра), МассивТекстИсключенийОбязательный);
	Если СтруктураПоискаИсключения.Успешно Тогда
		// Если нашли, то выходим.
		Возврат;
	КонецЕсли;
	
	// В имени параметра могут быть дополнительные символы или текст "обязательный", поэтому берем первое слово.
	ИмяПараметра = ПолучитьПервоеСловоИзСтроки(ИмяПараметра);
	ИмяПараметра = ВРег(ИмяПараметра);
	
	// Получаем массив параметров текущего метода.
	МассивПараметров = Новый Массив;
	ТекущийОбрабатываемыйМетод = Контекст["ТекущийОбрабатываемыйМетод"];
	Если ТекущийОбрабатываемыйМетод <> Неопределено Тогда
		МассивПараметров = ТекущийОбрабатываемыйМетод.МассивПараметров;
	КонецЕсли;
	
	// Ищем описанный параметр в комментарии среди параметров объявленного метода.
	ПараметрНайден = Ложь;
	Для Каждого Параметр Из МассивПараметров Цикл
		ИмяПараметраИзМетода = ПолучитьИмяПараметра(Параметр);
		Если СтрСравнить(ИмяПараметра, ИмяПараметраИзМетода) = 0 Тогда
			ПараметрНайден = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Если параметр не найден, то выходим, т.к. это может быть неверно описанное свойство параметра,
	// тогда удалять текст не надо.
	Если НЕ ПараметрНайден Тогда
		Возврат;
	КонецЕсли;
	
	ПозицияТекстаНеобязательный = СтруктураПоиска.Позиция;
	ДлинаТекстаНеобязательный = СтрДлина(СтруктураПоиска.НайденныйЭлемент);
	
	// Получаем текст первой строки до и после найденной конструкции текста "обязательный".
	ПерваяСтрокаДоТекстаНеобязательный = Лев(ПерваяСтрокаПолногоОписанияПараметра, ПозицияТекстаНеобязательный - 1);
	ПерваяСтрокаПослеТекстаНеобязательный = Сред(ПерваяСтрокаПолногоОписанияПараметра, ПозицияТекстаНеобязательный + ДлинаТекстаНеобязательный);
	ПерваяСтрокаПослеТекстаНеобязательный = СокрЛП(ПерваяСтрокаПослеТекстаНеобязательный);
	
	// Если следующий символ после текста "обязательный" - точка или запятая, то удаляем его.
	ПервыйСимволПослеТекстаНеобязательный = Лев(ПерваяСтрокаПослеТекстаНеобязательный, 1);
	Если СтрНайти(".,", ПервыйСимволПослеТекстаНеобязательный) > 0 Тогда
		ПерваяСтрокаПослеТекстаНеобязательный = УдалитьПервыйНезначимыйСимволИзСтроки(ПерваяСтрокаПослеТекстаНеобязательный);
	КонецЕсли;
	
	// Если строка заканчивается на конструкцию текста "обязательный", то сокращаем последние пробелы перед конструкцией.
	Если ПустаяСтрока(ПерваяСтрокаПослеТекстаНеобязательный) Тогда
		ПерваяСтрокаДоТекстаНеобязательный = СокрП(ПерваяСтрокаДоТекстаНеобязательный);
	КонецЕсли;
	
	// Склеиваем первую строку полного описания параметра.
	ПерваяСтрокаПолногоОписанияПараметра = ПерваяСтрокаДоТекстаНеобязательный + ПерваяСтрокаПослеТекстаНеобязательный;
	
	// Переопределяем все колонки строки описания параметра.
	ПереопределитьОписаниеПараметра(СтрокаОписанияПараметра, ПерваяСтрокаПолногоОписанияПараметра);
	
КонецПроцедуры

Процедура УдалитьДефисВКонцеСтрокиОписанияПараметра(СтрокаОписанияПараметра)
	
	ПолноеОписаниеПараметра = СокрП(СтрокаОписанияПараметра.ПолноеОписаниеПараметра);
	ИсходноеПолноеОписаниеПараметраЗаканчиваетсяНаДвоеточие = Ложь;
	
	// Иногда описание параметра заканчивается на "-." или "-:", тогда удаляем оба знака.
	Если НЕ СтрЗаканчиваетсяНа(ПолноеОписаниеПараметра, "-") Тогда
		ИсходноеПолноеОписаниеПараметраЗаканчиваетсяНаДвоеточие = СтрЗаканчиваетсяНа(ПолноеОписаниеПараметра, ":");
		ПолноеОписаниеПараметра = УдалитьПоследнийНезначимыйСимволИзСтроки(ПолноеОписаниеПараметра);
		// Проверяем "-" в конце описания параметра.
		Если НЕ СтрЗаканчиваетсяНа(ПолноеОписаниеПараметра, "-") Тогда
			// Если текстовое описание параметра не заканчивается на "-", то выходим.
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Иначе удаляем "-" в конце описания параметра.
	// Иногда в конце описания параметра встречается 2 тире, поэтому удаляем в цикле.
	Пока СтрЗаканчиваетсяНа(ПолноеОписаниеПараметра, "-") Цикл
		ПолноеОписаниеПараметра = Лев(ПолноеОписаниеПараметра, СтрДлина(ПолноеОписаниеПараметра) - 1);
		ПолноеОписаниеПараметра = СокрП(ПолноеОписаниеПараметра);
	КонецЦикла;
	
	// Если позиция типа параметра заполнена, но тип параметра пустой, то очистим позицию типа параметра.
	Если (СтрокаОписанияПараметра.ПозицияТипаПараметра > 0) И ПустаяСтрока(СтрокаОписанияПараметра.ТипПараметра) Тогда
		СтрокаОписанияПараметра.ПозицияТипаПараметра = 0;
	КонецЕсли;
	
	// Заменяем текстовое описание параметра.
	ТекстовоеОписаниеПараметра = СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра;
	Если НЕ ПустаяСтрока(ТекстовоеОписаниеПараметра) Тогда
		
		// Получаем текстовое описание.
		ПозицияТекстовогоОписанияПараметра = СтрокаОписанияПараметра.ПозицияТекстовогоОписанияПараметра;
		Если ПозицияТекстовогоОписанияПараметра > 0 Тогда
			ТекстовоеОписаниеПараметра = Сред(ПолноеОписаниеПараметра, ПозицияТекстовогоОписанияПараметра);
		Иначе
			// Если позиция текстового описания равна 0, значит, текстовое описание начинается со следующей строки.
			МассивСтрокОписанияПараметра = СтрРазделить(ПолноеОписаниеПараметра, Символы.ПС, Ложь);
			МассивСтрокОписанияПараметра.Удалить(0);
			ТекстовоеОписаниеПараметра = СтрСоединить(МассивСтрокОписанияПараметра, Символы.ПС);
		КонецЕсли;
		
		// Если текстовое описание параметра стало пустым, то очистим его позицию.
		Если ПустаяСтрока(ТекстовоеОписаниеПараметра) Тогда
			СтрокаОписанияПараметра.ПозицияТекстовогоОписанияПараметра = 0;
		КонецЕсли;
		
	КонецЕсли;
	
	// Если исходное полное описание параметра заканчивалось на двоеточие, то добавим его обратно.
	Если ИсходноеПолноеОписаниеПараметраЗаканчиваетсяНаДвоеточие Тогда
		
		ИмяПараметра = СтрокаОписанияПараметра.ИмяПараметра;
		ТипПараметра = СтрокаОписанияПараметра.ТипПараметра;
		
		ПолноеОписаниеПараметра = УдалитьПоследнийНезначимыйСимволИзСтроки(ПолноеОписаниеПараметра) + ":";
		
		Если НЕ ПустаяСтрока(ТекстовоеОписаниеПараметра) Тогда
			ТекстовоеОписаниеПараметра = УдалитьПоследнийНезначимыйСимволИзСтроки(ТекстовоеОписаниеПараметра) + ":";
		ИначеЕсли НЕ ПустаяСтрока(ТипПараметра) Тогда
			ТипПараметра = УдалитьПоследнийНезначимыйСимволИзСтроки(ТипПараметра) + ":";
			СтрокаОписанияПараметра.ТипПараметра = ТипПараметра;
		ИначеЕсли НЕ ПустаяСтрока(ИмяПараметра) Тогда
			ИмяПараметра = УдалитьПоследнийНезначимыйСимволИзСтроки(ИмяПараметра) + ":";
			СтрокаОписанияПараметра.ИмяПараметра = ИмяПараметра;
		КонецЕсли;
		
	КонецЕсли;
	
	// Переопределяем измененные колонки строки описания параметра.
	СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра = ТекстовоеОписаниеПараметра;
	СтрокаОписанияПараметра.ПолноеОписаниеПараметра    = ПолноеОписаниеПараметра;
	СтрокаОписанияПараметра.СостояниеПараметра         = "Изменен";
	
КонецПроцедуры

Процедура УстановитьТипПараметраИзИмениПараметра(СтрокаОписанияПараметра)
	
	ИмяПараметра = СтрокаОписанияПараметра.ИмяПараметра;
	ДлинаИмениПараметра = СтрДлина(ИмяПараметра);
	
	// Получаем полное описание параметра до имени параметра и после него.
	ПолноеОписаниеПараметра = СтрокаОписанияПараметра.ПолноеОписаниеПараметра;
	ПозицияИмениПараметра = СтрокаОписанияПараметра.ПозицияИмениПараметра;
	ПолноеОписаниеПараметраДоИмениПараметра = Лев(ПолноеОписаниеПараметра, ПозицияИмениПараметра - 1);
	ПолноеОписаниеПараметраПослеИмениПараметра = Сред(ПолноеОписаниеПараметра, ПозицияИмениПараметра + ДлинаИмениПараметра);
	
	// Ищем тип параметра в скобках в имени параметра в цикле, т.к. в одной строке может быть описание нескольких параметров.
	ТипПараметраУстановлен = Ложь;
	Пока Истина Цикл
		
		СтруктураРезультата = СтрокаСодержитТипПараметраВСкобках(ИмяПараметра);
		Если НЕ СтруктураРезультата.Успешно Тогда
			Прервать;
		КонецЕсли;
		
		ТипПараметраУстановлен = Истина;
		
		// Выделяем тип параметра.
		ИмяПараметраДоСкобки = Лев(ИмяПараметра, СтруктураРезультата.ПозицияОткрытойСкобки - 1);
		ТипПараметра = Сред(ИмяПараметра, СтруктураРезультата.ПозицияОткрытойСкобки + 1,
			СтруктураРезультата.ПозицияЗакрытойСкобки - СтруктураРезультата.ПозицияОткрытойСкобки - 1);
		ИмяПараметраПослеСкобки = Сред(ИмяПараметра, СтруктураРезультата.ПозицияЗакрытойСкобки + 1);
		
		ИмяПараметраПослеСкобки = СокрЛ(ИмяПараметраПослеСкобки);
		
		// Если после типа параметра в скобках есть еще описание, то добавляем разделитель.
		ДополнительныйРазделитель = "";
		Если апк_СловоСодержитЗначимыеСимволы(ИмяПараметраПослеСкобки) Тогда
			
			ДополнительныйРазделитель = " - ";
			Если СтрНачинаетсяС(ИмяПараметраПослеСкобки, ",") Тогда
				// Если после типа параметра в скобках сразу идет запятая, то скорее всего далее будет описание нового параметра.
				// Переносим его на следующую строку с тем же отступом.
				ИмяПараметраПослеСкобки = Сред(ИмяПараметраПослеСкобки, 2);
				ДополнительныйРазделитель = Символы.ПС + ПолноеОписаниеПараметраДоИмениПараметра;
			ИначеЕсли СтрНачинаетсяС(ИмяПараметраПослеСкобки, ":") Тогда
				// Двоеточие просто удаляем.
				ИмяПараметраПослеСкобки = Сред(ИмяПараметраПослеСкобки, 2);
			КонецЕсли;
			
		КонецЕсли;
		
		// Получаем объединенную строку с правильным описанием имени и типа параметра.
		ИмяПараметра = СокрП(ИмяПараметраДоСкобки) + " - " + ТипПараметра + ДополнительныйРазделитель + СокрЛ(ИмяПараметраПослеСкобки);
		
	КонецЦикла;
	
	// Если тип параметра в скобках не был найден, то выходим.
	Если НЕ ТипПараметраУстановлен Тогда
		Возврат;
	КонецЕсли;
	
	// Переопределяем полное описание параметра.
	ПолноеОписаниеПараметра = ПолноеОписаниеПараметраДоИмениПараметра + ИмяПараметра + ПолноеОписаниеПараметраПослеИмениПараметра;
	
	// Т.к. могло быть описано несколько параметров в одной строке, и мы их в цикле перенесли на следующие строки,
	// необходимо пересчитать номер строки конца описания параметра.
	НомерСтрокиНачалаОписанияПараметра = СтрокаОписанияПараметра.НомерСтрокиНачалаОписанияПараметра;
	НомерСтрокиКонцаОписанияПараметра = НомерСтрокиНачалаОписанияПараметра + СтрЧислоСтрок(ПолноеОписаниеПараметра) - 1;
	
	// Важно переопределить исходное описание параметра, т.к. количество строк полного описания параметра могло измениться.
	СтрокаОписанияПараметра.ПолноеОписаниеПараметра = ПолноеОписаниеПараметра;
	ПерваяСтрокаПолногоОписанияПараметра = СтрПолучитьСтроку(ПолноеОписаниеПараметра, 1);
	
	// Переопределяем остальные колонки строки описания параметра.
	ПереопределитьОписаниеПараметра(СтрокаОписанияПараметра, ПерваяСтрокаПолногоОписанияПараметра);
	СтрокаОписанияПараметра.НомерСтрокиКонцаОписанияПараметра = НомерСтрокиКонцаОписанияПараметра;
	СтрокаОписанияПараметра.НеобходимоПовторноеФорматирование = Истина;
	
КонецПроцедуры

Процедура УстановитьТипПараметраИзТекстовогоОписанияПараметра(СтрокаОписанияПараметра)
	
	// Если тип параметра заполнен, то выходим.
	Если НЕ ПустаяСтрока(СтрокаОписанияПараметра.ТипПараметра) Тогда
		Возврат;
	КонецЕсли;
	
	// Если текстовое описание параметра не заполнено, то выходим.
	ТекстовоеОписаниеПараметра = СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра;
	Если ПустаяСтрока(ТекстовоеОписаниеПараметра) Тогда
		Возврат;
	КонецЕсли;
	
	МассивТиповПараметровДляВыделенияТипа = Контекст["МассивТиповПараметровДляВыделенияТипа"];
	ТаблицаТиповПараметровДляФорматирования = Контекст["ТаблицаТиповПараметровДляФорматирования"];
	ДлинаТиповПараметра = 0;
	
	НайденныйТип = "";
	ТипПараметраМножественный = Ложь;
	МассивТиповИзТекстовогоОписания = СтрРазделить(ТекстовоеОписаниеПараметра, ",;");
	Для Каждого ТипИзТекстовогоОписания Из МассивТиповИзТекстовогоОписания Цикл
		
		ТипИзТекстовогоОписанияБуфер = СокрЛ(ТипИзТекстовогоОписания);
		
		// Если текстовое описание не начинается с типа, то прерываем.
		РезультатПоискаТипаПараметра = СтрНачинаетсяСПоМассиву(ВРег(ТипИзТекстовогоОписанияБуфер), МассивТиповПараметровДляВыделенияТипа);
		Если НЕ РезультатПоискаТипаПараметра.Успешно Тогда
			Прервать;
		КонецЕсли;
		
		НайденныйЭлемент = РезультатПоискаТипаПараметра.НайденныйЭлемент;
		
		Если НЕ ПустаяСтрока(НайденныйТип) Тогда
			
			// Если предыдущий тип равен вновь найденному, то прерываем,
			// т.к. скорее всего, началось текстовое описание параметра с повторением типа, например:
			// ДатаФормированияФайла - Дата, дата и время выполнения замера.
			Если НайденныйТип = НайденныйЭлемент Тогда
				Прервать;
			Иначе
				// Текущее наименование типа может быть написано неверно, и далее будет заменено.
				// Проверим в таблице типов для замены.
				СтрокаТипаПараметра = ТаблицаТиповПараметровДляФорматирования.Найти(НайденныйЭлемент, "ТипПараметраДляПоиска");
				Если СтрокаТипаПараметра <> Неопределено Тогда
					// Найдено повторение типа, прерываем.
					Если НайденныйТип = СтрокаТипаПараметра.ТипПараметраДляЗаменыВРег Тогда
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		// Если какой-то тип уже был выделен, то добавляем длину запятой.
		Если ДлинаТиповПараметра > 0 Тогда
			ДлинаТиповПараметра = ДлинаТиповПараметра + 1;
			ТипПараметраМножественный = Истина;
		КонецЕсли;
		
		// Если найденный тип полностью является одним из возможных типов, то добавляем длину исходного элемента.
		НайденныйТип = НайденныйЭлемент;
		Если ВРег(СокрП(ТипИзТекстовогоОписанияБуфер)) = НайденныйТип Тогда
			ДлинаТиповПараметра = ДлинаТиповПараметра + СтрДлина(ТипИзТекстовогоОписания);
		Иначе
			// Если тип начинается с одного из возможных, но не равен ему,
			// то добавляем длину типа и прерываем для дальнейшего анализа следующего текста.
			ДлинаПробеловПередТипом = СтрДлина(ТипИзТекстовогоОписания) - СтрДлина(ТипИзТекстовогоОписанияБуфер);
			ДлинаТиповПараметра = ДлинаТиповПараметра + ДлинаПробеловПередТипом + СтрДлина(НайденныйТип);
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	// Если тип параметра в текстовом описании не обнаружен, то выходим.
	Если ДлинаТиповПараметра = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТипПараметра = Лев(ТекстовоеОписаниеПараметра, ДлинаТиповПараметра);
	
	// Получаем текстовое описание параметра после типа параметра.
	ТекстовоеОписаниеПараметра = Сред(ТекстовоеОписаниеПараметра, ДлинаТиповПараметра + 1);
	
	// Если текстовое описание пустое, то выходим, т.к. добавлять нечего.
	Если ПустаяСтрока(ТекстовоеОписаниеПараметра) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстовоеОписаниеПараметра = СокрЛ(ТекстовоеОписаниеПараметра);
	
	// Проверяем, с чего начинается текстовое описание параметра после сокращенного выделенного.
	МассивСимволовДляВыделенияТипаПараметра = Контекст["МассивСимволовДляВыделенияТипаПараметра"];
	РезультатПоискаСимволов = СтрНачинаетсяСПоМассиву(ВРег(ТекстовоеОписаниеПараметра), МассивСимволовДляВыделенияТипаПараметра);
	Если НЕ РезультатПоискаСимволов.Успешно Тогда
		// Если не нашли в специальном массиве символов, то выходим.
		Возврат;
	КонецЕсли;
	
	НаборСимволов = РезультатПоискаСимволов.НайденныйЭлемент;
	
	// Если символы незначимые, то обрезаем. Например, точку или запятую.
	Если НЕ апк_СловоСодержитЗначимыеСимволы(НаборСимволов) Тогда
		ТекстовоеОписаниеПараметра = Сред(ТекстовоеОписаниеПараметра, СтрДлина(НаборСимволов) + 1);
		ТекстовоеОписаниеПараметра = СокрЛ(ТекстовоеОписаниеПараметра);
	КонецЕсли;
	
	// Иначе заменяем первый символ на тире и пробелы.
	РазделительЭлементовОписанияПараметра = " - ";
	ДлинаРазделителяЭлементовОписанияПараметра = СтрДлина(РазделительЭлементовОписанияПараметра);
	
	// Переопределяем позицию типа параметра позицией текстового описания параметра.
	ПозицияТипаПараметра = СтрокаОписанияПараметра.ПозицияТекстовогоОписанияПараметра;
	ПозицияТекстовогоОписанияПараметра = ПозицияТипаПараметра + ДлинаТиповПараметра;
	СтрокаОписанияПараметра.ПозицияРазделителяПередТекстовымОписаниемПараметра = ПозицияТекстовогоОписанияПараметра + 1;
	ПозицияТекстовогоОписанияПараметра = ПозицияТекстовогоОписанияПараметра + ДлинаРазделителяЭлементовОписанияПараметра;
	
	ПолноеОписаниеПараметра = СтрокаОписанияПараметра.ПолноеОписаниеПараметра;
	ПолноеОписаниеПараметра = Лев(ПолноеОписаниеПараметра, ПозицияТипаПараметра - 1 + ДлинаТиповПараметра);
	ПолноеОписаниеПараметра = ПолноеОписаниеПараметра + РазделительЭлементовОписанияПараметра + ТекстовоеОписаниеПараметра;
	
	// Переопределяем все измененные колонки строки описания параметра.
	СтрокаОписанияПараметра.ПолноеОписаниеПараметра = ПолноеОписаниеПараметра;
	СтрокаОписанияПараметра.ТипПараметра = ТипПараметра;
	СтрокаОписанияПараметра.ТипПараметраМножественный = ТипПараметраМножественный;
	СтрокаОписанияПараметра.ПозицияТипаПараметра = ПозицияТипаПараметра;
	СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра = ТекстовоеОписаниеПараметра;
	СтрокаОписанияПараметра.ПозицияТекстовогоОписанияПараметра = ПозицияТекстовогоОписанияПараметра;
	СтрокаОписанияПараметра.СостояниеПараметра = "Изменен";
	
КонецПроцедуры

Процедура ЗаменитьНеправильноеОписаниеТипаПараметра(СтрокаОписанияПараметра)
	
	ТипПараметра = СтрокаОписанияПараметра.ТипПараметра;
	Если ПустаяСтрока(ТипПараметра) Тогда
		Возврат;
	КонецЕсли;
	
	ПозицияТипаПараметра = СтрокаОписанияПараметра.ПозицияТипаПараметра;
	Если ПозицияТипаПараметра = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаТиповПараметровДляФорматированияПоложениеРавно = Контекст["ТаблицаТиповПараметровДляФорматированияПоложениеРавно"];
	ТаблицаТиповПараметровДляФорматированияПоложениеНачало = Контекст["ТаблицаТиповПараметровДляФорматированияПоложениеНачало"];
	ТаблицаТиповПараметровДляФорматированияПоложениеКонец = Контекст["ТаблицаТиповПараметровДляФорматированияПоложениеКонец"];
	
	НомерЭлемента = -1;
	ТипПараметраЗаменен = Ложь;
	МассивТиповПараметра = СтрРазделить(ТипПараметра, ",;", Ложь);
	Для Каждого ЭлементТипаПараметра Из МассивТиповПараметра Цикл
		
		ЭлементТипаПараметраНайден = Ложь;
		
		НомерЭлемента = НомерЭлемента + 1;
		
		ЭлементТипаПараметра = СтрЗаменить(ЭлементТипаПараметра, "/", "");
		ЭлементТипаПараметра = СокрЛП(ЭлементТипаПараметра);
		
		// Если элемент типа параметра заканчивается на двоеточие, то запомним его.
		ПоследнийСимвол = ?(СтрЗаканчиваетсяНа(ЭлементТипаПараметра, ":"), ":", "");
		
		// И в любом случае удаляем последний незначимый символ (например, точку) для поиска по таблице типов.
		ЭлементТипаПараметра = УдалитьПоследнийНезначимыйСимволИзСтроки(ЭлементТипаПараметра);
		ЭлементТипаПараметраБуфер = ВРег(ЭлементТипаПараметра);
		ЭлементТипаПараметраБуфер = СтрЗаменить(ЭлементТипаПараметраБуфер, Символы.Таб, " ");
		ЭлементТипаПараметраБуфер = СтрСоединить(СтрРазделить(ЭлементТипаПараметраБуфер, " ", Ложь), " ");
		
		// Сначала ищем элемент типа параметра в таблице типов для замены с положением "Равно".
		СтрокаТипаПараметра = ТаблицаТиповПараметровДляФорматированияПоложениеРавно.Найти(ЭлементТипаПараметраБуфер, "ТипПараметраДляПоиска");
		Если СтрокаТипаПараметра <> Неопределено Тогда
			
			ЭлементТипаПараметраНайден = Истина;
			
			// Если текст для замены отличается от исходного типа в модуле, то заменяем.
			ТипПараметраДляЗамены = СтрокаТипаПараметра.ТипПараметраДляЗамены;
			Если ЭлементТипаПараметра <> ТипПараметраДляЗамены Тогда
				МассивТиповПараметра[НомерЭлемента] = " " + ТипПараметраДляЗамены + ПоследнийСимвол;
				ТипПараметраЗаменен = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЭлементТипаПараметраНайден Тогда
			Продолжить;
		КонецЕсли;
		
		// Если не нашли, то ищем в таблице типов для замены с положением "Начало".
		Для Каждого СтрокаТипаПараметра Из ТаблицаТиповПараметровДляФорматированияПоложениеНачало Цикл
			
			// Проверяем начало написания типа в верхнем регистре.
			ТипПараметраДляПоиска = СтрокаТипаПараметра.ТипПараметраДляПоиска;
			Если НЕ СтрНачинаетсяС(ЭлементТипаПараметраБуфер, ТипПараметраДляПоиска) Тогда
				// Если не совпадают, то проверяем следующий тип из таблицы.
				Продолжить;
			КонецЕсли;
			
			ЭлементТипаПараметраНайден = Истина;
			
			// Сравниваем начало написания типа с типом для замены.
			ТипПараметраДляЗамены = СтрокаТипаПараметра.ТипПараметраДляЗамены;
			Если (НЕ СтрНачинаетсяС(ЭлементТипаПараметра, ТипПараметраДляЗамены))
			 ИЛИ (СтрСравнить(ТипПараметраДляПоиска, ТипПараметраДляЗамены) <> 0) Тогда
				// Если не совпадают, то надо заменить.
				ТипПараметраТекстЗамены = ТипПараметраДляЗамены + Сред(ЭлементТипаПараметра, СтрДлина(ТипПараметраДляПоиска) + 1);
				МассивТиповПараметра[НомерЭлемента] = " " + ТипПараметраТекстЗамены + ПоследнийСимвол;
				ТипПараметраЗаменен = Истина;
			КонецЕсли;
			
			// Найден подходящий тип, прерываем.
			Прервать;
			
		КонецЦикла;
		
		Если ЭлементТипаПараметраНайден Тогда
			Продолжить;
		КонецЕсли;
		
		// Если не нашли, то ищем в таблице типов для замены с положением "Конец".
		Для Каждого СтрокаТипаПараметра Из ТаблицаТиповПараметровДляФорматированияПоложениеКонец Цикл
			
			// Проверяем конец написания типа в верхнем регистре.
			ТипПараметраДляПоиска = СтрокаТипаПараметра.ТипПараметраДляПоиска;
			Если НЕ СтрЗаканчиваетсяНа(ЭлементТипаПараметраБуфер, ТипПараметраДляПоиска) Тогда
				// Если не совпадают, то проверяем следующий тип из таблицы.
				Продолжить;
			КонецЕсли;
			
			ЭлементТипаПараметраНайден = Истина;
			
			// Сравниваем конец написания типа с типом для замены.
			ТипПараметраДляЗамены = СтрокаТипаПараметра.ТипПараметраДляЗамены;
			Если НЕ СтрЗаканчиваетсяНа(ЭлементТипаПараметра, ТипПараметраДляЗамены) Тогда
				// Если не совпадают, то надо заменить.
				ТипПараметраТекстЗамены = Лев(ЭлементТипаПараметра, СтрДлина(ЭлементТипаПараметра) - СтрДлина(ТипПараметраДляПоиска));
				ТипПараметраТекстЗамены = ТипПараметраТекстЗамены + ТипПараметраДляЗамены;
				МассивТиповПараметра[НомерЭлемента] = " " + ТипПараметраТекстЗамены + ПоследнийСимвол;
				ТипПараметраЗаменен = Истина;
			КонецЕсли;
			
			// Найден подходящий тип, прерываем.
			Прервать;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Если не было ни одной замены, то выходим.
	Если НЕ ТипПараметраЗаменен Тогда
		Возврат;
	КонецЕсли;
	
	// Соединяем массив типов параметра в строку.
	ТипПараметра = СтрСоединить(МассивТиповПараметра, ",");
	ТипПараметра = СокрЛП(ТипПараметра);
	
	Если НЕ СтрокаОписанияПараметра.ТипПараметраМножественный Тогда
		МассивТиповПараметра = СтрРазделить(ТипПараметра, ",", Ложь);
		Если МассивТиповПараметра.Количество() > 1 Тогда
			СтрокаОписанияПараметра.ТипПараметраМножественный = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// Если тип параметра не изменился, то выходим.
	Если ТипПараметра = СтрокаОписанияПараметра.ТипПараметра Тогда
		Возврат;
	КонецЕсли;
	
	// Переопределяем полное описание типа параметра.
	ПолноеОписаниеПараметраИсходное = СтрокаОписанияПараметра.ПолноеОписаниеПараметра;
	ПолноеОписаниеПараметра = ПолноеОписаниеПараметраИсходное;
	ПолноеОписаниеПараметра = Лев(ПолноеОписаниеПараметра, ПозицияТипаПараметра - 1);
	ПолноеОписаниеПараметра = ПолноеОписаниеПараметра + ТипПараметра;
	
	// Если текстовое описание параметра заполнено, то добавляем его в полное описание.
	ТекстовоеОписаниеПараметра = СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра;
	Если НЕ ПустаяСтрока(ТекстовоеОписаниеПараметра) Тогда
		
		// Если позиция тире перед текстовым описанием больше 0, то переопределим ее.
		ПозицияРазделителяПередТекстовымОписаниемПараметра = СтрокаОписанияПараметра.ПозицияРазделителяПередТекстовымОписаниемПараметра;
		Если ПозицияРазделителяПередТекстовымОписаниемПараметра > 0 Тогда
			РазделительОписанияПараметра = Сред(ПолноеОписаниеПараметраИсходное, ПозицияРазделителяПередТекстовымОписаниемПараметра, 1);
			ПолноеОписаниеПараметра = ПолноеОписаниеПараметра + ?(РазделительОписанияПараметра = ":", "", " ") + РазделительОписанияПараметра;
			СтрокаОписанияПараметра.ПозицияРазделителяПередТекстовымОписаниемПараметра = СтрДлина(ПолноеОписаниеПараметра);
		КонецЕсли;
		
		ПозицияТекстовогоОписанияПараметра = СтрокаОписанияПараметра.ПозицияТекстовогоОписанияПараметра;
		Если ПозицияТекстовогоОписанияПараметра > 0 Тогда
			ПолноеОписаниеПараметра = ПолноеОписаниеПараметра + " ";
			СтрокаОписанияПараметра.ПозицияТекстовогоОписанияПараметра = СтрДлина(ПолноеОписаниеПараметра) + 1;
		КонецЕсли;
		
		Если (ПозицияРазделителяПередТекстовымОписаниемПараметра = 0)
		 ИЛИ (ПозицияТекстовогоОписанияПараметра = 0)
		 ИЛИ СтрНачинаетсяС(ТекстовоеОписаниеПараметра, "//") Тогда
			ПолноеОписаниеПараметра = ПолноеОписаниеПараметра + Символы.ПС;
		КонецЕсли;
		
		ПолноеОписаниеПараметра = ПолноеОписаниеПараметра + ТекстовоеОписаниеПараметра;
		
	КонецЕсли;
	
	// Переопределяем необходимые колонки строки описания параметра.
	СтрокаОписанияПараметра.ТипПараметра = ТипПараметра;
	СтрокаОписанияПараметра.ПолноеОписаниеПараметра = ПолноеОписаниеПараметра;
	СтрокаОписанияПараметра.СостояниеПараметра = "Изменен";
	
КонецПроцедуры

Функция ФорматироватьТекстовоеОписаниеПараметраПослеТекстаКлючИЗначение(Знач ТекстОписанияСвойства)
	
	// Удаляем первый и последний незначимые символы.
	ТекстОписанияСвойства = УдалитьПервыйНезначимыйСимволИзСтроки(ТекстОписанияСвойства);
	ТекстОписанияСвойства = УдалитьПоследнийНезначимыйСимволИзСтроки(ТекстОписанияСвойства);
	
	// Заменяем текст в текстовом описании свойства.
	СписокЗаменПриПереносеСвойствКлючИЗначение = Контекст["СписокЗаменПриПереносеСвойствКлючИЗначение"];
	Для Каждого ЭлементСписка Из СписокЗаменПриПереносеСвойствКлючИЗначение Цикл
		
		ЗначениеПоиска = ЭлементСписка.Значение;
		ПозицияПоиска = СтрНайти(ВРег(ТекстОписанияСвойства), ЗначениеПоиска);
		Если ПозицияПоиска = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПозицияПослеЗначенияПоиска = ПозицияПоиска + СтрДлина(ЗначениеПоиска);
		
		ТекстОписанияСвойстваДоПозицииПоиска = Лев(ТекстОписанияСвойства, ПозицияПоиска - 1);
		ТекстОписанияСвойстваПослеЗначенияПоиска = Сред(ТекстОписанияСвойства, ПозицияПослеЗначенияПоиска);
		
		ТекстОписанияСвойства = ТекстОписанияСвойстваДоПозицииПоиска
			+ ЭлементСписка.Представление
			+ ТекстОписанияСвойстваПослеЗначенияПоиска;
		
	КонецЦикла;
	
	// Проверяем окончание части текстового описания после текста "Ключ" до текста "Значение".
	МассивУдаляемогоТекстаОкончанияТекстаКлючИЗначение = Новый Массив;
	МассивУдаляемогоТекстаОкончанияТекстаКлючИЗначение.Добавить(ВРег(" а"));
	МассивУдаляемогоТекстаОкончанияТекстаКлючИЗначение.Добавить(ВРег(" и"));
	МассивУдаляемогоТекстаОкончанияТекстаКлючИЗначение.Добавить(ВРег(" в"));
	
	// Если нашли какой-либо из элементов, то удаляем его.
	СтруктураПроверки = СтрЗаканчиваетсяНаПоМассиву(ВРег(ТекстОписанияСвойства), МассивУдаляемогоТекстаОкончанияТекстаКлючИЗначение);
	Если СтруктураПроверки.Успешно Тогда
		ДлинаУдаляемогоТекста = СтрДлина(СтруктураПроверки.НайденныйЭлемент);
		ДлинаТекстаОписанияСвойства = СтрДлина(ТекстОписанияСвойства);
		ТекстОписанияСвойства = Лев(ТекстОписанияСвойства, ДлинаТекстаОписанияСвойства - ДлинаУдаляемогоТекста);
	КонецЕсли;
	
	// Проверяем наличие скобок в текстовом описании свойства.
	Если СтрНачинаетсяС(ТекстОписанияСвойства, "(") И СтрЗаканчиваетсяНа(ТекстОписанияСвойства, ")") Тогда
		ТекстОписанияСвойства = Сред(ТекстОписанияСвойства, 2, СтрДлина(ТекстОписанияСвойства) - 2);
		ТекстОписанияСвойства = СокрЛП(ТекстОписанияСвойства);
	КонецЕсли;
	
	// Если текстовое описание свойства содержит тип параметра в скобках, то выносим его вперед.
	СтруктураПоискаТекстаВСкобках = СтрокаСодержитТипПараметраВСкобках(ТекстОписанияСвойства);
	Если СтруктураПоискаТекстаВСкобках.Успешно Тогда
		
		ПозицияОткрытойСкобки = СтруктураПоискаТекстаВСкобках.ПозицияОткрытойСкобки;
		ТекстОписанияСвойстваДоОткрытойСкобки = СокрЛП(Лев(ТекстОписанияСвойства, ПозицияОткрытойСкобки - 1));
		Если апк_СловоСодержитЗначимыеСимволы(ТекстОписанияСвойстваДоОткрытойСкобки) Тогда
			ТекстОписанияСвойстваДоОткрытойСкобки = " - " + ТекстОписанияСвойстваДоОткрытойСкобки;
		КонецЕсли;
		
		ПозицияЗакрытойСкобки = СтруктураПоискаТекстаВСкобках.ПозицияЗакрытойСкобки;
		ТекстОписанияСвойстваПослеЗакрытойСкобки = СокрЛП(Сред(ТекстОписанияСвойства, ПозицияЗакрытойСкобки + 1));
		Если апк_СловоСодержитЗначимыеСимволы(ТекстОписанияСвойстваПослеЗакрытойСкобки) Тогда
			ТекстОписанияСвойстваПослеЗакрытойСкобки = ", " + ТекстОписанияСвойстваПослеЗакрытойСкобки;
		КонецЕсли;
		
		ТекстОписанияСвойства = СтруктураПоискаТекстаВСкобках.ТекстВСкобках
			+ ТекстОписанияСвойстваДоОткрытойСкобки
			+ ТекстОписанияСвойстваПослеЗакрытойСкобки;
		
	КонецЕсли;
	
	// Если в текстовом описании свойства остались знаки комментария, значит, есть перенос на следующие строки.
	// Попробуем объединить короткие строки в одну.
	Если СтрНайти(ТекстОписанияСвойства, "//") > 0 Тогда
		ТекстОписанияСвойстваБуфер = СтрЗаменить(ТекстОписанияСвойства, "/", "");
		МассивСтрокОписанияСвойства = СтрРазделить(ТекстОписанияСвойстваБуфер, Символы.ПС + Символы.Таб + " ", Ложь);
		ТекстОписанияСвойстваБуфер = СтрСоединить(МассивСтрокОписанияСвойства, " ");
		// Если длина получившейся объединенной строки меньше 120 символов, то оставляем.
		Если СтрДлина(ТекстОписанияСвойстваБуфер) <= Контекст["КоличествоСимволовДляПереносаКомментария"] Тогда
			ТекстОписанияСвойства = ТекстОписанияСвойстваБуфер;
		КонецЕсли;
	КонецЕсли;
	
	// Еще раз удаляем первый и последний незначимые символы.
	ТекстОписанияСвойства = УдалитьПервыйНезначимыйСимволИзСтроки(ТекстОписанияСвойства);
	ТекстОписанияСвойства = УдалитьПоследнийНезначимыйСимволИзСтроки(ТекстОписанияСвойства);
	
	Возврат ТекстОписанияСвойства;
	
КонецФункции

Процедура ПеренестиКлючИЗначениеНаСледующиеСтрокиОписанияПараметра(СтрокаОписанияПараметра, СтруктураПоиска)
	
	ТекстовоеОписаниеПараметра = СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра;
	
	// Вводим условное ограничение: если количество строк текстового описания параметра больше 3,
	// то ничего не анализируем и не переносим.
	Если СтрЧислоСтрок(ТекстовоеОписаниеПараметра) > 3 Тогда
		Возврат;
	КонецЕсли;
	
	МассивТекстИсключенийДляПереносаСвойствКлючИЗначение = Новый Массив;
	МассивТекстИсключенийДляПереносаСвойствКлючИЗначение.Добавить(ВРег("Ключ и Значение"));
	МассивТекстИсключенийДляПереносаСвойствКлючИЗначение.Добавить(ВРег("может быть"));
	
	Если СтрНайтиПоМассиву(ВРег(ТекстовоеОписаниеПараметра), МассивТекстИсключенийДляПереносаСвойствКлючИЗначение).Успешно Тогда
		Возврат;
	КонецЕсли;
	
	// Получаем отступ для текста "Ключ" и "Значение".
	ПолноеОписаниеПараметра = СтрокаОписанияПараметра.ПолноеОписаниеПараметра;
	ОтступДляТекстаКлючИЗначение = ПолучитьОтступПослеЗнакаКомментария(ПолноеОписаниеПараметра, Ложь);
	ОтступДляТекстаКлючИЗначение = ОтступДляТекстаКлючИЗначение + "  ";
	
	УровеньВложенностиПараметра = СтрокаОписанияПараметра.УровеньВложенностиПараметра;
	Для Счетчик = 0 По УровеньВложенностиПараметра Цикл
		ОтступДляТекстаКлючИЗначение = ОтступДляТекстаКлючИЗначение + "*";
	КонецЦикла;
	
	// Добавляем знаки комментария и пробел в отступ.
	ОтступДляТекстаКлючИЗначение = "//" + ОтступДляТекстаКлючИЗначение + " ";
	
	ПозицияТекстаКлюч = СтруктураПоиска.ПозицияТекстаКлюч;
	ПозицияТекстаЗначение = СтруктураПоиска.ПозицияТекстаЗначение;
	ПозицияПослеТекстаКлюч = ПозицияТекстаКлюч + СтрДлина(СтруктураПоиска.НайденныйТекстКлюч);
	ПозицияПослеТекстаЗначение = ПозицияТекстаЗначение + СтрДлина(СтруктураПоиска.НайденныйТекстЗначение);
	
	// Получаем части текстового описания параметра.
	ТекстовоеОписаниеПараметраДоТекстаКлюч = Лев(ТекстовоеОписаниеПараметра, ПозицияТекстаКлюч - 1);
	ТекстовоеОписаниеПараметраПослеТекстаКлюч = Сред(ТекстовоеОписаниеПараметра, ПозицияПослеТекстаКлюч, ПозицияТекстаЗначение - ПозицияПослеТекстаКлюч);
	ТекстовоеОписаниеПараметраПослеТекстаЗначение = Сред(ТекстовоеОписаниеПараметра, ПозицияПослеТекстаЗначение);
	
	ТекстовоеОписаниеПараметраДоТекстаКлюч = СокрЛП(ТекстовоеОписаниеПараметраДоТекстаКлюч);
	ТекстовоеОписаниеПараметраПослеТекстаКлюч = СокрЛП(ТекстовоеОписаниеПараметраПослеТекстаКлюч);
	ТекстовоеОписаниеПараметраПослеТекстаЗначение = СокрЛП(ТекстовоеОписаниеПараметраПослеТекстаЗначение);
	
	// Проверяем окончание части текстового описания до текста "Ключ".
	// Если последняя строка текстового описания до текста "Ключ" - пустая, то удаляем ее.
	МассивСтрокДоТекстаКлюч = СтрРазделить(ТекстовоеОписаниеПараметраДоТекстаКлюч, Символы.ПС, Истина);
	КоличествоСтрокДоТекстаКлюч = МассивСтрокДоТекстаКлюч.Количество();
	Если КоличествоСтрокДоТекстаКлюч > 1 Тогда
		ПоследняяСтрокаДоТекстаКлюч = МассивСтрокДоТекстаКлюч[КоличествоСтрокДоТекстаКлюч - 1];
		ПоследняяСтрокаДоТекстаКлюч = СтрЗаменить(ПоследняяСтрокаДоТекстаКлюч, "/", "");
		Если ПустаяСтрока(ПоследняяСтрокаДоТекстаКлюч) Тогда
			МассивСтрокДоТекстаКлюч.Удалить(КоличествоСтрокДоТекстаКлюч - 1);
			ТекстовоеОписаниеПараметраДоТекстаКлюч = СтрСоединить(МассивСтрокДоТекстаКлюч, Символы.ПС);
		КонецЕсли;
	КонецЕсли;
	
	// Добавляем двоеточие после текстового описания параметра до текста "Ключ".
	Если НЕ ПустаяСтрока(ТекстовоеОписаниеПараметраДоТекстаКлюч) Тогда
		ТекстовоеОписаниеПараметраДоТекстаКлюч = УдалитьПоследнийНезначимыйСимволИзСтроки(ТекстовоеОписаниеПараметраДоТекстаКлюч);
		ТекстовоеОписаниеПараметраДоТекстаКлюч = ТекстовоеОписаниеПараметраДоТекстаКлюч + ":";
	КонецЕсли;
	
	// Обрабатываем текстовое описание после текста "Ключ" и "Значение".
	ТекстовоеОписаниеПараметраПослеТекстаКлюч =
		ФорматироватьТекстовоеОписаниеПараметраПослеТекстаКлючИЗначение(ТекстовоеОписаниеПараметраПослеТекстаКлюч);
	ТекстовоеОписаниеПараметраПослеТекстаЗначение =
		ФорматироватьТекстовоеОписаниеПараметраПослеТекстаКлючИЗначение(ТекстовоеОписаниеПараметраПослеТекстаЗначение);
	
	// Соединяем части текстового описания.
	ТекстовоеОписаниеПараметра = СокрЛП(ТекстовоеОписаниеПараметраДоТекстаКлюч)
		+ Символы.ПС
		+ ОтступДляТекстаКлючИЗначение + СтруктураПоиска.НайденныйТекстКлюч + " - " + СокрЛП(ТекстовоеОписаниеПараметраПослеТекстаКлюч)
		+ Символы.ПС
		+ ОтступДляТекстаКлючИЗначение + СтруктураПоиска.НайденныйТекстЗначение + " - " + СокрЛП(ТекстовоеОписаниеПараметраПослеТекстаЗначение);
	
	// Получаем новое полное описание параметра.
	ПозицияТекстовогоОписанияПараметра = СтрокаОписанияПараметра.ПозицияТекстовогоОписанияПараметра;
	
	// Если позиция текстового параметра определена, то добавляем текстовое описание в полное с этой позиции.
	// Иначе вставляем текстовое описание со 2-й строки.
	НачалоПолногоОписанияПараметра = ?(ПозицияТекстовогоОписанияПараметра > 0,
		Лев(ПолноеОписаниеПараметра, ПозицияТекстовогоОписанияПараметра - 1),
		СтрПолучитьСтроку(ПолноеОписаниеПараметра, 1) + Символы.ПС);
	ПолноеОписаниеПараметра = НачалоПолногоОписанияПараметра + ТекстовоеОписаниеПараметра;
	
	// Переопределяем остальные колонки строки описания параметра.
	НомерСтрокиНачалаОписанияПараметра = СтрокаОписанияПараметра.НомерСтрокиНачалаОписанияПараметра;
	НомерСтрокиКонцаОписанияПараметра = НомерСтрокиНачалаОписанияПараметра + СтрЧислоСтрок(ПолноеОписаниеПараметра) - 1;
	
	СтрокаОписанияПараметра.ПолноеОписаниеПараметра = ПолноеОписаниеПараметра;
	СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра = ТекстовоеОписаниеПараметра;
	СтрокаОписанияПараметра.НомерСтрокиКонцаОписанияПараметра = НомерСтрокиКонцаОписанияПараметра;
	СтрокаОписанияПараметра.СостояниеПараметра = "Изменен";
	СтрокаОписанияПараметра.НеобходимоПовторноеФорматирование = Истина;
	
КонецПроцедуры

Функция НайтиОписаниеСвойстваПараметра(СтрокаОписанияПараметра, ИмяСвойства, КоличествоСвойствДляПоиска = 0)
	
	СтрокаОписанияСвойства = Неопределено;
	
	// Получаем таблицу описания параметров.
	ТаблицаОписанияПараметров = СтрокаОписанияПараметра.Владелец();
	ИндексСтрокиОписанияПараметра = ТаблицаОписанияПараметров.Индекс(СтрокаОписанияПараметра);
	КоличествоСтрокТаблицыОписанияПараметров = ТаблицаОписанияПараметров.Количество();
	
	Если КоличествоСвойствДляПоиска = 0 Тогда
		КоличествоСвойствДляПоиска = КоличествоСтрокТаблицыОписанияПараметров - ИндексСтрокиОписанияПараметра - 1;
	КонецЕсли;
	
	// Запоминаем текущую секцию описания.
	СекцияОписания = СтрокаОписанияПараметра.СекцияОписания;
	
	КоличествоСвойствПроверено = 0;
	Для ИндексСтроки = ИндексСтрокиОписанияПараметра + 1 По КоличествоСтрокТаблицыОписанияПараметров - 1 Цикл
		
		// Если следующий параметр в другой секции описания, то прерываем.
		СтрокаОписанияСледующегоПараметра = ТаблицаОписанияПараметров[ИндексСтроки];
		Если СтрокаОписанияСледующегоПараметра.СекцияОписания <> СекцияОписания Тогда
			Прервать;
		КонецЕсли;
		
		// Если имя параметра не заполнено, то описан тип параметра, проверяем следующий.
		ИмяСледующегоПараметра = СтрокаОписанияСледующегоПараметра.ИмяПараметра;
		Если ПустаяСтрока(ИмяСледующегоПараметра) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяСледующегоПараметра = ПреобразоватьТекстДляСравнения(ИмяСледующегоПараметра);
		
		// Проверяем, является ли следующий параметр искомым свойством.
		// Дополнительную проверку на уровень вложенности (количество "*") пока не вводим,
		// т.к. очень часто свойства описывают некорректно.
		Если ИмяСледующегоПараметра = ВРег(ИмяСвойства) Тогда
			СтрокаОписанияСвойства = СтрокаОписанияСледующегоПараметра;
			Прервать;
		КонецЕсли;
		
		// Если количество проверенных свойств больше или равно количеству заявленных свойств для проверки, то прерываем.
		КоличествоСвойствПроверено = КоличествоСвойствПроверено + 1;
		Если КоличествоСвойствПроверено >= КоличествоСвойствДляПоиска Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрокаОписанияСвойства;
	
КонецФункции

Процедура ЗаменитьОписаниеТипаПараметраСоответствие(СтрокаОписанияПараметра)
	
	ТипПараметра = СтрокаОписанияПараметра.ТипПараметра;
	Если ПустаяСтрока(ТипПараметра) Тогда
		Возврат;
	КонецЕсли;
	
	ПозицияТипаПараметра = СтрокаОписанияПараметра.ПозицияТипаПараметра;
	Если ПозицияТипаПараметра = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СписокТекстСоответствие = Контекст["СписокТекстСоответствие"];
	
	// Ищем "Соответствие" в типе параметра.
	НомерЭлемента = -1;
	НомерЭлементаТипаПараметраСоответствие = -1;
	ЭлементСпискаТекстСоответствия = Неопределено;
	МассивТиповПараметра = СтрРазделить(ТипПараметра, ",", Ложь);
	Для Каждого ЭлементТипаПараметра Из МассивТиповПараметра Цикл
		
		НомерЭлемента = НомерЭлемента + 1;
		
		ЭлементТипаПараметра = ПреобразоватьТекстДляСравнения(ЭлементТипаПараметра);
		
		ЭлементСпискаТекстСоответствия = СписокТекстСоответствие.НайтиПоЗначению(ЭлементТипаПараметра);
		Если ЭлементСпискаТекстСоответствия <> Неопределено Тогда
			НомерЭлементаТипаПараметраСоответствие = НомерЭлемента;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	// Если не нашли "Соответствие" в типе параметра, то выходим.
	Если (НомерЭлементаТипаПараметраСоответствие < 0) ИЛИ (ЭлементСпискаТекстСоответствия = Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
	// Инициализируем флаг наличия ключа и значения.
	НайденоОписаниеКлючИЗначение = Ложь;
	
	// По таблице параметров ищем ниже параметры с наименованием "Ключ" и "Значение".
	Если НЕ НайденоОписаниеКлючИЗначение Тогда
		Если (НайтиОписаниеСвойстваПараметра(СтрокаОписанияПараметра, Контекст["ТекстКлюч"], 1) <> Неопределено)
		   И (НайтиОписаниеСвойстваПараметра(СтрокаОписанияПараметра, Контекст["ТекстЗначение"], 2) <> Неопределено) Тогда
			НайденоОписаниеКлючИЗначение = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// Если не нашли, проверяем текст "Ключ" и "Значение" в текстовом описании.
	Если НЕ НайденоОписаниеКлючИЗначение Тогда
		ТекстовоеОписаниеПараметра = СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра;
		СтруктураПоискаКлючИЗначение = СтрокаСодержитОписаниеСвойствКлючИЗначение(ТекстовоеОписаниеПараметра);
		// Если нашли, то сразу автоматически перенесем их на следующие строки описания параметра.
		Если СтруктураПоискаКлючИЗначение.Успешно Тогда
			НайденоОписаниеКлючИЗначение = Истина;
			ПеренестиКлючИЗначениеНаСледующиеСтрокиОписанияПараметра(СтрокаОписанияПараметра, СтруктураПоискаКлючИЗначение);
		КонецЕсли;
	КонецЕсли;
	
	// Не нашли описание параметров "Ключ" или "Значение", выходим.
	Если НЕ НайденоОписаниеКлючИЗначение Тогда
		Возврат;
	КонецЕсли;
	
	// Нашли описание параметров "Ключ" и "Значение", заменяем "Соответствие" на "Соответствие из КлючИЗначение",
	// при этом оставляем все дополнительные специальные символы.
	ТипПараметраСоответствие = МассивТиповПараметра[НомерЭлементаТипаПараметраСоответствие];
	ТипПараметраСоответствие = ВРег(ТипПараметраСоответствие);
	ТипПараметраСоответствие = СтрЗаменить(ТипПараметраСоответствие, ЭлементСпискаТекстСоответствия.Значение,
		ЭлементСпискаТекстСоответствия.Представление);
	МассивТиповПараметра[НомерЭлементаТипаПараметраСоответствие] = ТипПараметраСоответствие;
	
	// Соединяем массив типов параметра в строку.
	ТипПараметра = СтрСоединить(МассивТиповПараметра, ",");
	ТипПараметра = СокрЛП(ТипПараметра);
	
	// Переопределяем полное описание типа параметра.
	ПолноеОписаниеПараметра = СтрокаОписанияПараметра.ПолноеОписаниеПараметра;
	ПолноеОписаниеПараметра = Лев(ПолноеОписаниеПараметра, ПозицияТипаПараметра - 1);
	ПолноеОписаниеПараметра = ПолноеОписаниеПараметра + ТипПараметра;
	
	// Если текстовое описание параметра заполнено, то добавляем его в полное описание.
	ТекстовоеОписаниеПараметра = СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра;
	Если НЕ ПустаяСтрока(ТекстовоеОписаниеПараметра) Тогда
		
		// Если позиция тире перед текстовым описанием больше 0, то переопределим ее.
		ПозицияРазделителяПередТекстовымОписаниемПараметра = СтрокаОписанияПараметра.ПозицияРазделителяПередТекстовымОписаниемПараметра;
		Если ПозицияРазделителяПередТекстовымОписаниемПараметра > 0 Тогда
			ПолноеОписаниеПараметра = ПолноеОписаниеПараметра + " -";
			СтрокаОписанияПараметра.ПозицияРазделителяПередТекстовымОписаниемПараметра = СтрДлина(ПолноеОписаниеПараметра);
		КонецЕсли;
		
		ПозицияТекстовогоОписанияПараметра = СтрокаОписанияПараметра.ПозицияТекстовогоОписанияПараметра;
		Если ПозицияТекстовогоОписанияПараметра > 0 Тогда
			ПолноеОписаниеПараметра = ПолноеОписаниеПараметра + " ";
			СтрокаОписанияПараметра.ПозицияТекстовогоОписанияПараметра = СтрДлина(ПолноеОписаниеПараметра) + 1;
		Иначе
			ПолноеОписаниеПараметра = ПолноеОписаниеПараметра + Символы.ПС;
		КонецЕсли;
		
		ПолноеОписаниеПараметра = ПолноеОписаниеПараметра + ТекстовоеОписаниеПараметра;
		
	КонецЕсли;
	
	// Переопределяем необходимые колонки строки описания параметра.
	СтрокаОписанияПараметра.ТипПараметра = ТипПараметра;
	СтрокаОписанияПараметра.ПолноеОписаниеПараметра = ПолноеОписаниеПараметра;
	СтрокаОписанияПараметра.СостояниеПараметра = "Изменен";
	
КонецПроцедуры

// Процедура выравнивается описание типа параметра относительно предыдущего,
// если строка описания начинается с тире и типа параметра.
//
// Пример:
//
// Было:
// Параметры:
//   ТекущийОбъект - ДокументОбъект
//                   - СправочникОбъект
//               - ПланОбменаОбъект - объект метаданных.
//
// Станет:
// Параметры:
//   ТекущийОбъект - ДокументОбъект
//                 - СправочникОбъект
//                 - ПланОбменаОбъект - объект метаданных.
// 
Процедура ВыровнятьТипПараметраОтносительноПредыдущего(СтрокаОписанияПараметра)
	
	// Если описание параметра не начинается с тире, то выходим.
	Если НЕ СтрокаОписанияПараметра.ОписаниеПараметраНачинаетсяСТире Тогда
		Возврат;
	КонецЕсли;
	
	// Если уровень вложенности параметра больше 0, т.е. это описание свойства, то выходим.
	УровеньВложенностиПараметра = СтрокаОписанияПараметра.УровеньВложенностиПараметра;
	Если УровеньВложенностиПараметра > 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Если имя параметра указано, то выходим.
	ИмяПараметра = СтрокаОписанияПараметра.ИмяПараметра;
	Если НЕ ПустаяСтрока(ИмяПараметра) Тогда
		Возврат;
	КонецЕсли;
	
	// Если позиция разделителя перед типом параметра не определена, то выходим.
	ПозицияРазделителяПередТипомПараметра = СтрокаОписанияПараметра.ПозицияРазделителяПередТипомПараметра;
	Если ПозицияРазделителяПередТипомПараметра = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Если тип параметра сложный (через точку), и текстовое описание многострочное, то выходим.
	ПолноеОписаниеПараметра = СтрокаОписанияПараметра.ПолноеОписаниеПараметра;
	ТипПараметра = СтрокаОписанияПараметра.ТипПараметра;
	Если (СтрНайти(ТипПараметра, ".") > 0) И (СтрЧислоСтрок(ПолноеОписаниеПараметра) > 1) Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим описание предыдущего параметра, для это получаем таблицу всех параметров.
	ТаблицаОписанияПараметров = СтрокаОписанияПараметра.Владелец();
	ИндексСтрокиОписанияПараметра = ТаблицаОписанияПараметров.Индекс(СтрокаОписанияПараметра);
	
	// Если текущий параметр - первый, то выравнивать не надо, выходим.
	Если ИндексСтрокиОписанияПараметра = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Если предыдущий параметр из другой секции описания, то выходим.
	СтрокаОписанияПредыдущегоПараметра = ТаблицаОписанияПараметров[ИндексСтрокиОписанияПараметра - 1];
	Если СтрокаОписанияПараметра.СекцияОписания <> СтрокаОписанияПредыдущегоПараметра.СекцияОписания Тогда
		Возврат;
	КонецЕсли;
	
	// Если уровни вложенности не совпадают, то выходим.
	Если УровеньВложенностиПараметра <> СтрокаОписанияПредыдущегоПараметра.УровеньВложенностиПараметра Тогда
		Возврат;
	КонецЕсли;
	
	// Если позиция тире перед типом предыдущего параметра не определена, то выходим.
	ПозицияТиреПередТипомПредыдущегоПараметра = СтрокаОписанияПредыдущегоПараметра.ПозицияРазделителяПередТипомПараметра;
	Если ПозицияТиреПередТипомПредыдущегоПараметра = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем тип предыдущего параметра в массиве исключений типов для выравнивания.
	МассивИсключенийТиповПараметровДляВыравнивания = Контекст["МассивИсключенийТиповПараметровДляВыравнивания"];
	
	ТипПараметраВРег = ВРег(ТипПараметра);
	ТипПараметраВРег = УдалитьПоследнийНезначимыйСимволИзСтроки(ТипПараметраВРег);
	ТипПредыдущегоПараметра = ВРег(СтрокаОписанияПредыдущегоПараметра.ТипПараметра);
	Если СтрНайтиПоМассиву(ТипПредыдущегоПараметра, МассивИсключенийТиповПараметровДляВыравнивания).Успешно Тогда
		// Если один из типов исключений нашли в типе предыдущего параметра, то выходим.
		Возврат;
	КонецЕсли;
	
	// Если тип текущего параметра есть в типах предыдущего параметра, то сдвигать не нужно, выходим.
	МассивТиповПредыдущегоПараметра = СтрРазделить(ТипПредыдущегоПараметра, ",;: " + Символы.Таб, Ложь);
	Если МассивТиповПредыдущегоПараметра.Найти(ТипПараметраВРег) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Получаем новый отступ из полного описания предыдущего параметра до тире перед типом параметра.
	ПолноеОписаниеПредыдущегоПараметра = СтрокаОписанияПредыдущегоПараметра.ПолноеОписаниеПараметра;
	ПолноеОписаниеПредыдущегоПараметраДоТире = Лев(ПолноеОписаниеПредыдущегоПараметра, ПозицияТиреПередТипомПредыдущегоПараметра - 1);
	ПолноеОписаниеПредыдущегоПараметраПослеТире = СтрЗаменить(ПолноеОписаниеПредыдущегоПараметра, ПолноеОписаниеПредыдущегоПараметраДоТире, "");
	ОписаниеПредыдущегоПараметраСодержитПробелПослеТире = СтрНачинаетсяС(ПолноеОписаниеПредыдущегоПараметраПослеТире, "- ");
	
	// Заменяем все символы, кроме знаков комментария и табов.
	СтрокаНезаменяемыхСимволов = "/" + Символы.Таб;
	ПолноеОписаниеПараметраДоТире = "";
	ДлинаПолногоОписанияПредыдущегоПараметраДоТире = СтрДлина(ПолноеОписаниеПредыдущегоПараметраДоТире);
	Для НомерСимвола = 1 По ДлинаПолногоОписанияПредыдущегоПараметраДоТире Цикл
		Символ = Сред(ПолноеОписаниеПредыдущегоПараметраДоТире, НомерСимвола, 1);
		// Добавляем в строку либо символ, либо пробел.
		СимволЗамены = ?(СтрНайти(СтрокаНезаменяемыхСимволов, Символ) > 0, Символ, " ");
		ПолноеОписаниеПараметраДоТире = ПолноеОписаниеПараметраДоТире + СимволЗамены;
	КонецЦикла;
	
	ПолноеОписаниеПараметраНачинаяСТире = Сред(ПолноеОписаниеПараметра, ПозицияРазделителяПередТипомПараметра);
	Если ОписаниеПредыдущегоПараметраСодержитПробелПослеТире
		И НЕ СтрНачинаетсяС(ПолноеОписаниеПараметраНачинаяСТире, "- ") Тогда
		ПолноеОписаниеПараметраНачинаяСТире = СтрЗаменить(ПолноеОписаниеПараметраНачинаяСТире, "-", "- ");
	КонецЕсли;
	ПолноеОписаниеПараметра = ПолноеОписаниеПараметраДоТире + ПолноеОписаниеПараметраНачинаяСТире;
	
	// Проверяем случай, когда перед типом параметра есть незначимый символ, Например, ", <ТипПараметра>".
	ТипПараметраБезНезначимыхСимволов = УдалитьПервыйНезначимыйСимволИзСтроки(ТипПараметра);
	Если ТипПараметра <> ТипПараметраБезНезначимыхСимволов Тогда
		ПолноеОписаниеПараметра = СтрЗаменить(ПолноеОписаниеПараметра, ТипПараметра, ТипПараметраБезНезначимыхСимволов);
	КонецЕсли;
	
	// Полное описание не изменилось, то выходим.
	Если СтрокаОписанияПараметра.ПолноеОписаниеПараметра = ПолноеОписаниеПараметра Тогда
		Возврат;
	КонецЕсли;
	
	// Переопределяем позиции элементов полного описания.
	РазницаПозицийТиреПередТипом = ПозицияТиреПередТипомПредыдущегоПараметра - ПозицияРазделителяПередТипомПараметра;
	ТаблицаПозицийОписанияПараметра = Контекст["ТаблицаПозицийОписанияПараметра"].Скопировать();
	Для Каждого СтрокаПозицииОписанияПараметра Из ТаблицаПозицийОписанияПараметра Цикл
		
		НаименованиеПозицииОписанияПараметра = СтрокаПозицииОписанияПараметра.НаименованиеПозиции;
		ПозицияЭлементаОписанияПараметра = СтрокаОписанияПараметра[НаименованиеПозицииОписанияПараметра];
		
		Если ПозицияЭлементаОписанияПараметра = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПозицияЭлементаОписанияПараметра = ПозицияЭлементаОписанияПараметра + РазницаПозицийТиреПередТипом;
		СтрокаОписанияПараметра[НаименованиеПозицииОписанияПараметра] = ПозицияЭлементаОписанияПараметра;
		
	КонецЦикла;
	
	СтрокаОписанияПараметра.ПолноеОписаниеПараметра = ПолноеОписаниеПараметра;
	СтрокаОписанияПараметра.СостояниеПараметра = "Изменен";
	
КонецПроцедуры

Процедура ЗаменитьТабыНаПробелыПередОписаниемПараметра(СтрокаОписанияПараметра)
	
	// Если в описании параметра нет табов, то выходим.
	ПолноеОписаниеПараметра = СтрокаОписанияПараметра.ПолноеОписаниеПараметра;
	Если СтрНайти(ПолноеОписаниеПараметра, Символы.Таб) = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// В общем случае пока заменяем табы на пробелы только до имени параметра.
	// Если имя параметра не указано (например, строка описания параметра начинается с тире и типа), то замены не будет.
	ТаблицаПозицийОписанияПараметра = Контекст["ТаблицаПозицийОписанияПараметра"].Скопировать();
	Если СтрокаОписанияПараметра.ЭтоОписаниеВозвращаемогоЗначения Тогда
		// Кроме случая описания возвращаемого значения - в этих строках замена табов происходит до типа параметра.
		СтрокаПозицииОписанияПараметра = ТаблицаПозицийОписанияПараметра.Найти("ПозицияТипаПараметра", "НаименованиеПозиции");
		Если СтрокаПозицииОписанияПараметра <> Неопределено Тогда
			СтрокаПозицииОписанияПараметра.ЗаменятьТабыДоПозиции = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// Получаем позицию для замены табов.
	ПозицияЗаменыТабов = 0;
	Для Каждого СтрокаПозицииОписанияПараметра Из ТаблицаПозицийОписанияПараметра Цикл
		
		// Запоминаем во временную таблицу позиций описания параметров текущие позиции.
		НаименованиеПозицииОписанияПараметра = СтрокаПозицииОписанияПараметра.НаименованиеПозиции;
		ПозицияЭлементаОписанияПараметра = СтрокаОписанияПараметра[НаименованиеПозицииОписанияПараметра];
		СтрокаПозицииОписанияПараметра.Позиция = ПозицияЭлементаОписанияПараметра;
		
		// Если позиция найдена, то пропускаем.
		Если ПозицияЗаменыТабов > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Если для этой позиции не надо заменять табы, то пропускаем.
		Если НЕ СтрокаПозицииОписанияПараметра.ЗаменятьТабыДоПозиции Тогда
			Продолжить;
		КонецЕсли;
		
		// Если нашли позицию, то запоминаем ее.
		Если ПозицияЭлементаОписанияПараметра > 0 Тогда
			ПозицияЗаменыТабов = ПозицияЭлементаОписанияПараметра;
		КонецЕсли;
		
	КонецЦикла;
	
	// Если ни одна из позиций не определена, то выходим.
	Если ПозицияЗаменыТабов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Определяем текст описания, в котором необходимо заменить табы на пробелы.
	ТекстДоПозицииЗаменыТабов = Лев(ПолноеОписаниеПараметра, ПозицияЗаменыТабов - 1);
	КоличествоТабов = СтрЧислоВхождений(ТекстДоПозицииЗаменыТабов, Символы.Таб);
	Если КоличествоТабов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Заменяем таб на 2 пробела.
	ТекстДоПозицииЗаменыТабов = СтрЗаменить(ТекстДоПозицииЗаменыТабов, Символы.Таб, "  ");
	ПолноеОписаниеПараметра = ТекстДоПозицииЗаменыТабов + Сред(ПолноеОписаниеПараметра, ПозицияЗаменыТабов);
	
	// Переопределяем необходимые колонки строки описания параметра.
	Для Каждого СтрокаПозицииОписанияПараметра Из ТаблицаПозицийОписанияПараметра Цикл
		
		ПозицияЭлементаОписанияПараметра = СтрокаПозицииОписанияПараметра.Позиция;
		Если НЕ апк_ЭтоЧисло(ПозицияЭлементаОписанияПараметра) Тогда
			Продолжить;
		КонецЕсли;
		
		ПозицияЭлементаОписанияПараметра = Число(ПозицияЭлементаОписанияПараметра);
		Если ПозицияЭлементаОписанияПараметра = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Заменяем значения всех определенных позиций больше 0.
		НаименованиеПозицииОписанияПараметра = СтрокаПозицииОписанияПараметра.НаименованиеПозиции;
		СтрокаОписанияПараметра[НаименованиеПозицииОписанияПараметра] = ПозицияЭлементаОписанияПараметра + КоличествоТабов;
		
	КонецЦикла;
	
	СтрокаОписанияПараметра.ПолноеОписаниеПараметра = ПолноеОписаниеПараметра;
	СтрокаОписанияПараметра.СостояниеПараметра = "Изменен";
	
КонецПроцедуры

Процедура РазделитьТипыПараметраПоСтрокам(СтрокаОписанияПараметра)
	
	// Если тип параметра не указан, то выходим.
	ТипПараметра = СтрокаОписанияПараметра.ТипПараметра;
	Если ПустаяСтрока(ТипПараметра) Тогда
		Возврат;
	КонецЕсли;
	
	// Получаем позицию типа параметра.
	ПозицияТипаПараметра = СтрокаОписанияПараметра.ПозицияТипаПараметра;
	Если ПозицияТипаПараметра = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДлинаТипаПараметра = СтрДлина(ТипПараметра);
	
	// Если это описание возвращаемого значения, то проверяем длину описания типа параметра.
	Если СтрокаОписанияПараметра.ЭтоОписаниеВозвращаемогоЗначения Тогда
		// Если длина описания типа параметра не более 80-ти символов, то оставляем в исходном виде.
		Если ДлинаТипаПараметра <= 80 Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ТекстовоеОписаниеПараметра = СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра;
	
	// Определяем, закончено ли описание типа параметра на первой строке описания параметра.
	ПозицияРазделителяПередТекстовымОписаниемПараметра = СтрокаОписанияПараметра.ПозицияРазделителяПередТекстовымОписаниемПараметра;
	ТипПараметраЗакончен = ПустаяСтрока(ТекстовоеОписаниеПараметра) ИЛИ (ПозицияРазделителяПередТекстовымОписаниемПараметра > 0);
	
	// Если тип параметра единственный, и описание типа параметра закончилось,
	// т.к. есть тире перед текстовым описанием параметра, то выходим.
	Если (НЕ СтрокаОписанияПараметра.ТипПараметраМножественный) И ТипПараметраЗакончен Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим скобки в описании типа.
	ПозицияЗакрывающейсяСкобки = 0;
	Пока Истина Цикл
		
		Если ПозицияЗакрывающейсяСкобки >= ДлинаТипаПараметра Тогда
			Прервать;
		КонецЕсли;
		
		ПозицияОткрывающейсяСкобки = СтрНайти(ТипПараметра, "(",, ПозицияЗакрывающейсяСкобки + 1);
		Если ПозицияОткрывающейсяСкобки = 0 Тогда
			Прервать;
		КонецЕсли;
		
		ПозицияЗакрывающейсяСкобки = СтрНайти(ТипПараметра, ")",, ПозицияОткрывающейсяСкобки + 1);
		Если ПозицияЗакрывающейсяСкобки = 0 Тогда
			ПозицияЗакрывающейсяСкобки = ДлинаТипаПараметра;
		КонецЕсли;
		
		// Если текст в скобках содержит запятую, тогда разделение пройдет неверно, выходим.
		ТекстВСкобках = Сред(ТипПараметра, ПозицияОткрывающейсяСкобки + 1, ПозицияЗакрывающейсяСкобки - ПозицияОткрывающейсяСкобки - 1);
		Если СтрНайти(ТекстВСкобках, ",") > 0 Тогда
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	// Разделяем типы параметра на массив типов.
	МассивТиповПараметра = СтрРазделить(ТипПараметра, ",;", Ложь);
	Если ТипПараметраЗакончен Тогда
		
		КоличествоТиповПараметра = МассивТиповПараметра.Количество();
		
		// Если описание типа закончено и только один тип параметра, то выходим.
		Если КоличествоТиповПараметра < 2 Тогда
			Возврат;
		КонецЕсли;
		
		ПозицияНачалаОписанияТипаПараметра = СтрокаОписанияПараметра.ПозицияРазделителяПередТипомПараметра;
		Если ПозицияНачалаОписанияТипаПараметра = 0 Тогда
			ПозицияНачалаОписанияТипаПараметра = ПозицияТипаПараметра;
		КонецЕсли;
		
		ПозицияКонцаОписанияТипаПараметра = СтрокаОписанияПараметра.ПозицияРазделителяПередТекстовымОписаниемПараметра;
		Если ПозицияКонцаОписанияТипаПараметра = 0 Тогда
			ПозицияКонцаОписанияТипаПараметра = ПозицияТипаПараметра + ДлинаТипаПараметра;
		Иначе
			// Тире после описание типа также учитываем при подсчете длины.
			ПозицияКонцаОписанияТипаПараметра = ПозицияКонцаОписанияТипаПараметра + 1;
		КонецЕсли;
		
		ДлинаТипаПараметра = ПозицияКонцаОписанияТипаПараметра - ПозицияНачалаОписанияТипаПараметра;
		
		// Если количество типов параметра не более 5, и длина описания типов до 50 символов,
		// то оставляем описание типов на одной строке и выходим.
		Если (КоличествоТиповПараметра <= 5) И (ДлинаТипаПараметра <= 50) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ТаблицаТиповПараметра = Новый ТаблицаЗначений;
	ТаблицаТиповПараметра.Колонки.Добавить("ТипПараметра");
	
	Для Каждого ЭлементТипаПараметра Из МассивТиповПараметра Цикл
		
		// Если элемент типа пустой, то пропускаем его.
		Если ПустаяСтрока(ЭлементТипаПараметра) Тогда
			Продолжить;
		КонецЕсли;
		
		// Если один из элементов типа является числом, то выходим.
		ЭлементТипаПараметра = СокрЛП(ЭлементТипаПараметра);
		Если апк_ЭтоЧисло(ЭлементТипаПараметра) Тогда
			Возврат;
		КонецЕсли;
		
		// Добавляем тип в таблицу.
		СтрокаТаблицыТиповПараметра = ТаблицаТиповПараметра.Добавить();
		СтрокаТаблицыТиповПараметра.ТипПараметра = ЭлементТипаПараметра;
		
	КонецЦикла;
	
	// Если описание типа параметра не закончено, то, возможно, в текстовом описании есть еще описание типа параметра,
	// рассмотрим его отдельно.
	Если НЕ ТипПараметраЗакончен Тогда
		
		ТипыПараметраИзТекстовогоОписания = ТекстовоеОписаниеПараметра;
		ПозицияТире = СтрНайти(ТипыПараметраИзТекстовогоОписания, "-");
		Если ПозицияТире > 0 Тогда
			ТипыПараметраИзТекстовогоОписания = Лев(ТекстовоеОписаниеПараметра, ПозицияТире - 1);
		КонецЕсли;
		
		МассивИсключенийТиповПараметров = Контекст["МассивИсключенийТиповПараметров"];
		ДлинаТиповПараметраИзТекстовогоОписания = 0;
		
		// Разделяем типы параметра на массив типов.
		НомерЭлементаТипа = -1;
		МассивТиповПараметра = СтрРазделить(ТипыПараметраИзТекстовогоОписания, ",;", Ложь);
		Для Каждого ЭлементТипаПараметра Из МассивТиповПараметра Цикл
			
			НомерЭлементаТипа = НомерЭлементаТипа + 1;
			
			ЭлементТипаПараметраБуфер = ЭлементТипаПараметра;
			ЭлементТипаПараметраБуфер = СтрЗаменить(ЭлементТипаПараметраБуфер, "/", "");
			ЭлементТипаПараметраБуфер = СокрЛП(ЭлементТипаПараметраБуфер);
			
			// Если элемент описания параметра пустой, то прерываем.
			Если ПустаяСтрока(ЭлементТипаПараметраБуфер) Тогда
				Прервать;
			КонецЕсли;
			
			// Если элемент описания параметра не содержит заглавных букв, то это не тип параметра, прерываем.
			Если НРег(ЭлементТипаПараметраБуфер) = ЭлементТипаПараметраБуфер Тогда
				Прервать;
			КонецЕсли;
			
			// Если в элементе описания параметра есть пробелы, тогда это не тип, прерываем.
			Если СтрНайти(ЭлементТипаПараметраБуфер, " ") > 0 Тогда
				Прервать;
			КонецЕсли;
			
			// Если элемент текстового параметра не содержит буквы, то прерываем.
			Если НЕ апк_СловоСодержитБуквы(ЭлементТипаПараметраБуфер) Тогда
				Прервать;
			КонецЕсли;
			
			// Если элемент текстового параметра есть в массиве исключений типов параметров, то прерываем.
			Если МассивИсключенийТиповПараметров.Найти(ВРег(ЭлементТипаПараметраБуфер)) <> Неопределено Тогда
				Прервать;
			КонецЕсли;
			
			// Если в текстовом описании встретился тип параметра, который уже есть в таблице типов,
			// и он является последним в текстовом описании, то, скорее всего, далее идет описание этого типа параметра, прерываем.
			СтрокаТаблицыТиповПараметра = ТаблицаТиповПараметра.Найти(ЭлементТипаПараметраБуфер, "ТипПараметра");
			Если СтрокаТаблицыТиповПараметра <> Неопределено Тогда
				Если НомерЭлементаТипа = МассивТиповПараметра.ВГраница() Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
			// Если у текущего параметра не заполнено наименование,
			// то, возможно, перед этим уже есть перечисление этого типа параметра.
			Если ПустаяСтрока(СтрокаОписанияПараметра.ИмяПараметра) Тогда
				
				// Ищем вверх по всей таблице описания параметров первый параметр с заполненным наименованием.
				ТаблицаОписанияПараметров = СтрокаОписанияПараметра.Владелец();
				ИндексСтрокиОписанияПараметра = ТаблицаОписанияПараметров.Индекс(СтрокаОписанияПараметра);
				
				СекцияОписания = СтрокаОписанияПараметра.СекцияОписания;
				
				ТипПараметраНайденВТаблицеОписанияПараметров = Ложь;
				Для ИндексСтроки = 1 По ИндексСтрокиОписанияПараметра Цикл
					
					// Если секция не совпадает, то прерываем.
					ИндексСтрокиВверх = ИндексСтрокиОписанияПараметра - ИндексСтроки;
					СтрокаОписанияПараметраВверх = ТаблицаОписанияПараметров[ИндексСтрокиВверх];
					Если СтрокаОписанияПараметраВверх.СекцияОписания <> СекцияОписания Тогда
						Прервать;
					КонецЕсли;
					
					// Если тип параметра уже был описан ранее, прерываем.
					Если СтрокаОписанияПараметраВверх.ТипПараметра = ЭлементТипаПараметраБуфер Тогда
						ТипПараметраНайденВТаблицеОписанияПараметров = Истина;
						Прервать;
					КонецЕсли;
					
					// Если нашли параметр с заполненным наименованием, то прерываем.
					Если НЕ ПустаяСтрока(СтрокаОписанияПараметраВверх.ИмяПараметра) Тогда
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
				// Если нашли тип параметра в таблице описания параметров,
				// то добавлять этот тип в таблицу параметров не нужно, прерываем.
				Если ТипПараметраНайденВТаблицеОписанияПараметров Тогда
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
			// Добавляем тип в таблицу.
			СтрокаТаблицыТиповПараметра = ТаблицаТиповПараметра.Добавить();
			СтрокаТаблицыТиповПараметра.ТипПараметра = ЭлементТипаПараметраБуфер;
			
			ДлинаТиповПараметраИзТекстовогоОписания = ДлинаТиповПараметраИзТекстовогоОписания + СтрДлина(ЭлементТипаПараметра) + 1;
			
		КонецЦикла;
		
		Если ПозицияТире = ДлинаТиповПараметраИзТекстовогоОписания Тогда
			ПозицияРазделителяПередТекстовымОписаниемПараметра = ПозицияТире;
		КонецЕсли;
		
		ТекстовоеОписаниеПараметра = Сред(ТекстовоеОписаниеПараметра, ДлинаТиповПараметраИзТекстовогоОписания);
		ТекстовоеОписаниеПараметра = СокрЛ(ТекстовоеОписаниеПараметра);
		Если ПустаяСтрока(ТекстовоеОписаниеПараметра) Тогда
			ТекстовоеОписаниеПараметра = "";
		Иначе
			СтрокаСимволовДляУдаления = "- , .";
			МассивСимволовДляУдаления = СтрРазделить(СтрокаСимволовДляУдаления, " ");
			
			Если СтрНачинаетсяСПоМассиву(ТекстовоеОписаниеПараметра, МассивСимволовДляУдаления).Успешно Тогда
				ТекстовоеОписаниеПараметра = Сред(ТекстовоеОписаниеПараметра, 2);
				ТекстовоеОписаниеПараметра = СокрЛ(ТекстовоеОписаниеПараметра);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	МассивТиповПараметра = ТаблицаТиповПараметра.ВыгрузитьКолонку("ТипПараметра");
	Если МассивТиповПараметра.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	
	// Рассчитаем разделитель для переноса параметра.
	РазделительТипов = Символы.ПС;
	
	СтрокаНезаменяемыхСимволов = "/-" + Символы.Таб;
	
	ПолноеОписаниеПараметра = СтрокаОписанияПараметра.ПолноеОписаниеПараметра;
	СтрокаДоТипаПараметра = Лев(ПолноеОписаниеПараметра, ПозицияТипаПараметра - 1);
	
	ДлинаСтрокиДоТипаПараметра = СтрДлина(СтрокаДоТипаПараметра);
	Для НомерСимвола = 1 По ДлинаСтрокиДоТипаПараметра Цикл
		Символ = Сред(СтрокаДоТипаПараметра, НомерСимвола, 1);
		// Добавляем в разделитель либо символ, либо пробел.
		РазделительТипов = РазделительТипов + ?(СтрНайти(СтрокаНезаменяемыхСимволов, Символ) > 0, Символ, " ");
	КонецЦикла;
	
	// Проверим количество тире в получившемся разделителе.
	// Если больше 1, то оставим только последний.
	КоличествоТире = СтрЧислоВхождений(РазделительТипов, "-");
	Если КоличествоТире > 1 Тогда
		НомерТире = 0;
		Для НомерСимвола = 1 По ДлинаСтрокиДоТипаПараметра Цикл
			// Проверяем символ.
			Символ = Сред(РазделительТипов, НомерСимвола, 1);
			Если Символ <> "-" Тогда
				Продолжить;
			КонецЕсли;
			// Заменяем тире на пробел.
			РазделительТипов = Лев(РазделительТипов, НомерСимвола - 1) + " " + Сред(РазделительТипов, НомерСимвола + 1);
			// Если это предпоследнее тире, то прерываем.
			НомерТире = НомерТире + 1;
			Если (НомерТире + 1) = КоличествоТире Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТипПараметра = СтрСоединить(МассивТиповПараметра, РазделительТипов);
	
	ПозицияТекстовогоОписанияПараметра = 0;
	
	// Если текстовое описание не пустое, то добавим его к новому полному описанию параметра.
	ПолноеОписаниеПараметра = СтрокаДоТипаПараметра + ТипПараметра;
	Если НЕ ПустаяСтрока(ТекстовоеОписаниеПараметра) Тогда
		
		// Если текстовое описание начинается с новой строки после типа, то разделителем будет являться перенос.
		Если СтрНачинаетсяС(ТекстовоеОписаниеПараметра, "//") Тогда
			
			РазделительМеждуТипомИТекстовымОписанием = Символы.ПС;
			
			// Если в первой строке описания параметра было тире перед текстовым описанием, то оставим его.
			Если ПозицияРазделителяПередТекстовымОписаниемПараметра > 0 Тогда
				РазделительМеждуТипомИТекстовымОписанием = " -" + РазделительМеждуТипомИТекстовымОписанием;
			КонецЕсли;
			
		Иначе
			
			// Если текстовое описание находится на той же строке, что и тип, то разделителем будет являться тире.
			РазделительМеждуТипомИТекстовымОписанием = " - ";
			
			// Если текстовое описание состоит из нескольких строк, то необходимо их сдвинуть на новую позицию.
			МассивСтрокТекстовогоОписания = СтрРазделить(ТекстовоеОписаниеПараметра, Символы.ПС, Ложь);
			Если МассивСтрокТекстовогоОписания.Количество() > 1 Тогда
				
				// Сдвигаем каждую строку текстового описания параметра влево на уровень тире.
				ПоследнийТипПараметра = МассивТиповПараметра[МассивТиповПараметра.ВГраница()];
				ДлинаСтрокиДоТекстовогоОписания = ДлинаСтрокиДоТипаПараметра + СтрДлина(ПоследнийТипПараметра) + СтрДлина(РазделительМеждуТипомИТекстовымОписанием);
				
				// Обрабатываем все строки текстового описания кроме первой, т.к. первая будет в одной строке с типом.
				Для НомерСтроки = 1 По МассивСтрокТекстовогоОписания.ВГраница() Цикл
					
					СтрокаТекстовогоОписания = МассивСтрокТекстовогоОписания[НомерСтроки];
					СтрокаТекстовогоОписанияБуфер = СтрЗаменить(СтрокаТекстовогоОписания, "/", " ");
					
					// Если текущая длина отступа строки текстового описания меньше или равна той, которую собираемся установить, то пропускаем.
					ДлинаТекущегоОтступаСтроки = СтрДлина(СтрокаТекстовогоОписанияБуфер) - СтрДлина(СокрЛ(СтрокаТекстовогоОписанияБуфер));
					Если ДлинаТекущегоОтступаСтроки <= ДлинаСтрокиДоТекстовогоОписания Тогда
						Продолжить;
					КонецЕсли;
					
					СтрокаТекстовогоОписания = Лев(СтрокаТекстовогоОписания, ДлинаСтрокиДоТекстовогоОписания) + СокрЛ(СтрокаТекстовогоОписанияБуфер);
					МассивСтрокТекстовогоОписания[НомерСтроки] = СтрокаТекстовогоОписания;
					
				КонецЦикла;
				
				ТекстовоеОписаниеПараметра = СтрСоединить(МассивСтрокТекстовогоОписания, Символы.ПС);
				
			КонецЕсли;
			
		КонецЕсли;
		
		ПолноеОписаниеПараметра = ПолноеОписаниеПараметра + РазделительМеждуТипомИТекстовымОписанием;
		ПозицияТекстовогоОписанияПараметра = СтрДлина(ПолноеОписаниеПараметра) + 1;
		ПолноеОписаниеПараметра = ПолноеОписаниеПараметра + ТекстовоеОписаниеПараметра;
		
	КонецЕсли;
	
	// Переопределяем остальные колонки строки описания параметра.
	НомерСтрокиНачалаОписанияПараметра = СтрокаОписанияПараметра.НомерСтрокиНачалаОписанияПараметра;
	НомерСтрокиКонцаОписанияПараметра = НомерСтрокиНачалаОписанияПараметра + СтрЧислоСтрок(ПолноеОписаниеПараметра) - 1;
	
	СтрокаОписанияПараметра.ТипПараметра = ТипПараметра;
	СтрокаОписанияПараметра.ПолноеОписаниеПараметра = ПолноеОписаниеПараметра;
	СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра = ТекстовоеОписаниеПараметра;
	СтрокаОписанияПараметра.ПозицияТекстовогоОписанияПараметра = ПозицияТекстовогоОписанияПараметра;
	СтрокаОписанияПараметра.НомерСтрокиКонцаОписанияПараметра = НомерСтрокиКонцаОписанияПараметра;
	СтрокаОписанияПараметра.СостояниеПараметра = "Изменен";
	
КонецПроцедуры

Процедура УстановитьПервыйСимволТекстовогоОписанияПараметраВНижнийРегистр(СтрокаОписанияПараметра)
	
	ТекстовоеОписаниеПараметра = СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра;
	Если ПустаяСтрока(ТекстовоеОписаниеПараметра) Тогда
		Возврат;
	КонецЕсли;
	
	// Если позиция текстового описания не заполнена, значит, текстовое описание находится на следующей строке.
	// В таком случае не меняем регистр первого символа текстового описания и выходим.
	ПозицияТекстовогоОписанияПараметра = СтрокаОписанияПараметра.ПозицияТекстовогоОписанияПараметра;
	Если ПозицияТекстовогоОписанияПараметра = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем регистр первого символа текстового описания параметра.
	ПервыйСимволТекстовогоОписанияПараметра = Лев(ТекстовоеОписаниеПараметра, 1);
	Если ПервыйСимволТекстовогоОписанияПараметра = НРег(ПервыйСимволТекстовогоОписанияПараметра) Тогда
		// Если первый символ уже в нижнем регистре, то выходим.
		Возврат;
	КонецЕсли;
	
	// Если первый символ не из кириллического алфавита, то выходим.
	Если НЕ апк_СловоСодержитКириллицу(ПервыйСимволТекстовогоОписанияПараметра) Тогда
		Возврат;
	КонецЕсли;
	
	// Если описание параметра состоит только из текстового описания,
	// то устанавливать первый символ в нижний регистр не нужно, выходим.
	Если ПустаяСтрока(СтрокаОписанияПараметра.ИмяПараметра)
	   И ПустаяСтрока(СтрокаОписанияПараметра.ТипПараметра)
	   И (НЕ СтрокаОписанияПараметра.ОписаниеПараметраНачинаетсяСТире) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстовоеОписаниеПараметраБуфер = СтрЗаменить(ТекстовоеОписаниеПараметра, Символы.Таб, " ");
	
	// Исключаем некоторые конструкции, с которых может начинаться текстовое описание параметра.
	МассивИсключенийСлов = Контекст["МассивИсключенийСловДляУстановкиПервогоСимволаТекстовогоОписанияПараметраВНижнийРегистр"];
	Если СтрНачинаетсяСПоМассиву(ВРег(ТекстовоеОписаниеПараметраБуфер), МассивИсключенийСлов).Успешно Тогда
		Возврат;
	КонецЕсли;
	
	// Иногда в текстовом описании первым словом указан тип параметра, нужна дополнительная проверка.
	МассивСловТекстовогоОписанияПараметра = СтрРазделить(ТекстовоеОписаниеПараметраБуфер, " ", Ложь);
	Если МассивСловТекстовогоОписанияПараметра.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем первое слово текстового описания.
	ПервоеСловоТекстовогоОписанияПараметра = МассивСловТекстовогоОписанияПараметра[0];
	
	// Если оно заканчивается на двоеточие, то выходим.
	Если СтрЗаканчиваетсяНа(ПервоеСловоТекстовогоОписанияПараметра, ":") Тогда
		Возврат;
	КонецЕсли;
	
	// Убираем первый символ первого слова текстового описания.
	ПервоеСловоТекстовогоОписанияПараметра = Сред(ПервоеСловоТекстовогоОписанияПараметра, 2);
	
	// Если в первом слове есть еще заглавные буквы, то это, скорее всего, описание типа параметра.
	Если ПервоеСловоТекстовогоОписанияПараметра <> НРег(ПервоеСловоТекстовогоОписанияПараметра) Тогда
		// Устанавливать первый символ в нижний регистр не нужно, выходим.
		Возврат;
	КонецЕсли;
	
	// Устанавливаем первый символ текстового описания параметра в нижний регистр.
	ТекстовоеОписаниеПараметра = НРег(ПервыйСимволТекстовогоОписанияПараметра) + Сред(ТекстовоеОписаниеПараметра, 2);
	
	// Заменяем полное описание параметра.
	ПолноеОписаниеПараметра = СтрокаОписанияПараметра.ПолноеОписаниеПараметра;
	ПолноеОписаниеПараметра = Лев(ПолноеОписаниеПараметра, ПозицияТекстовогоОписанияПараметра - 1) + ТекстовоеОписаниеПараметра;
	
	// Переопределяем все измененные колонки строки описания параметра.
	СтрокаОписанияПараметра.ПолноеОписаниеПараметра = ПолноеОписаниеПараметра;
	СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра = ТекстовоеОписаниеПараметра;
	СтрокаОписанияПараметра.СостояниеПараметра = "Изменен";
	
КонецПроцедуры

Процедура УдалитьНезначащееТекстовоеОписаниеПараметра(СтрокаОписанияПараметра)
	
	// Если нет текстового описания параметра, то выходим.
	ТекстовоеОписаниеПараметра = СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра;
	Если ПустаяСтрока(ТекстовоеОписаниеПараметра) Тогда
		Возврат;
	КонецЕсли;
	
	// Если в текстовом описании только аббревиатуры, то выходим.
	Если ВРег(ТекстовоеОписаниеПараметра) = ТекстовоеОписаниеПараметра Тогда
		Возврат;
	КонецЕсли;
	
	ТекстовоеОписаниеПараметра = СокрЛП(ТекстовоеОписаниеПараметра);
	
	// Возводим обратный флаг для проверки.
	ТекстовоеОписаниеПараметраЯвляетсяЗначащим = Истина;
	
	Если ТекстовоеОписаниеПараметраЯвляетсяЗначащим Тогда
		// Проверяем текстовое описание параметра среди вариантов незначащих описаний, пока без проверки типа параметра.
		МассивНезначащихОписаний = Контекст["МассивНезначащихОписаний"];
		Если МассивНезначащихОписаний.Найти(ПреобразоватьТекстДляСравнения(ТекстовоеОписаниеПараметра)) <> Неопределено Тогда
			ТекстовоеОписаниеПараметраЯвляетсяЗначащим = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ТекстовоеОписаниеПараметраЯвляетсяЗначащим Тогда
		
		// Проверяем тип параметра, если тип пустой, то выходим.
		ТипПараметра = СтрокаОписанияПараметра.ТипПараметра;
		Если ПустаяСтрока(ТипПараметра) Тогда
			Возврат;
		КонецЕсли;
		
		// Проверяем только последний тип параметра в массиве составных типов,
		// т.к. ранее было разделение типов по строкам (поэтому делим строку типа параметра по запятой и тире),
		// и текстовое описание будет визуально относиться только к последнему типу.
		МассивТиповПараметра = СтрРазделить(ТипПараметра, ",-", Ложь);
		ПоследнийТипПараметра = МассивТиповПараметра[МассивТиповПараметра.ВГраница()];
		ПоследнийТипПараметра = ПреобразоватьТекстДляСравнения(ПоследнийТипПараметра);
		
		// Если последний тип параметра не составной, то выходим.
		МассивСоставныхТиповПараметров = Контекст["МассивСоставныхТиповПараметров"];
		Если МассивСоставныхТиповПараметров.Найти(ПоследнийТипПараметра) = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверяем следующие условия незначащего параметра:
	// 1. Текстовое описание закачивается на ":" и содержит менее 25 символов.
	Если ТекстовоеОписаниеПараметраЯвляетсяЗначащим Тогда
		// Если текстовое описание меньше 25-ти символов,
		Если СтрДлина(ТекстовоеОписаниеПараметра) < 25 Тогда
			// То проверяем, надо ли добавить двоеточие в конце.
			// (Двоеточие будет добавлено отдельно в цикле по таблице параметров, сейчас эта процедура вызывается только для проверки).
			ДобавитьДвоеточиеВКонцеСтрокиОписанияПараметра(СтрокаОписанияПараметра);
			ТекстовоеОписаниеПараметра = СокрЛП(СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра);
			// Если двоеточие уже было или добавлено только что, то считаем, что параметр незначащий.
			Если СтрЗаканчиваетсяНа(ТекстовоеОписаниеПараметра, ":") Тогда
				ТекстовоеОписаниеПараметраЯвляетсяЗначащим = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// 2. Написано по шаблону, например:
	//  ... - <структура|таблица|дерево значений|...>, содержащая передаваемые параметры:
	//  ... - таблица значений с колонками:
	Если ТекстовоеОписаниеПараметраЯвляетсяЗначащим Тогда
		
		ТекстовоеОписаниеПараметраБуфер = ВРег(ТекстовоеОписаниеПараметра);
		ТаблицаШаблоновНезначащихОписаний = Контекст["ТаблицаШаблоновНезначащихОписаний"];
		
		ШаблонНайден = Ложь;
		Для Каждого СтрокаШаблонаНезначащегоОписания Из ТаблицаШаблоновНезначащихОписаний Цикл
			
			ПоложениеШаблона = СтрокаШаблонаНезначащегоОписания.Положение;
			ТекстШаблона = СтрокаШаблонаНезначащегоОписания.ТекстШаблона;
			
			Если ПоложениеШаблона = "Равно" Тогда
				ШаблонНайден = (ТекстовоеОписаниеПараметраБуфер = ТекстШаблона);
			ИначеЕсли ПоложениеШаблона = "Конец" Тогда
				ШаблонНайден = СтрЗаканчиваетсяНа(ТекстовоеОписаниеПараметраБуфер, ТекстШаблона);
			ИначеЕсли ПоложениеШаблона = "Начало" Тогда
				ШаблонНайден = СтрНачинаетсяС(ТекстовоеОписаниеПараметраБуфер, ТекстШаблона);
			ИначеЕсли ПоложениеШаблона = "Любое" Тогда
				ШаблонНайден = (СтрНайти(ТекстовоеОписаниеПараметраБуфер, ТекстШаблона) > 0);
			КонецЕсли;
			
			Если ШаблонНайден Тогда
				ТекстовоеОписаниеПараметраЯвляетсяЗначащим = Ложь;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// 3. Совпадает с именем по правилам образования имени от синонима, например:
	//  ОтборЖурналаРегистрации - Структура - отбор журнала регистрации.
	Если ТекстовоеОписаниеПараметраЯвляетсяЗначащим Тогда
		ИмяПараметраБуфер = ПреобразоватьТекстДляСравнения(СтрокаОписанияПараметра.ИмяПараметра);
		ТекстовоеОписаниеПараметраБуфер = ПреобразоватьТекстДляСравнения(ТекстовоеОписаниеПараметра);
		Если ИмяПараметраБуфер = ТекстовоеОписаниеПараметраБуфер Тогда
			ТекстовоеОписаниеПараметраЯвляетсяЗначащим = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	// Если ни одно условие не сработало, то удалять текстовое описание параметра не нужно, выходим.
	Если ТекстовоеОписаниеПараметраЯвляетсяЗначащим Тогда
		Возврат;
	КонецЕсли;
	
	// Иначе удаляем текстовое описание параметра.
	ПолноеОписаниеПараметра = СтрокаОписанияПараметра.ПолноеОписаниеПараметра;
	ПозицияТекстовогоОписанияПараметра = СтрокаОписанияПараметра.ПозицияТекстовогоОписанияПараметра;
	
	// Если текстовое описание параметра находится на 2-й строке, то определим его позицию.
	Если ПозицияТекстовогоОписанияПараметра = 0 Тогда
		ПерваяСтрокаПолногоОписанияПараметра = СтрПолучитьСтроку(ПолноеОписаниеПараметра, 1);
		ПозицияТекстовогоОписанияПараметра = СтрДлина(ПерваяСтрокаПолногоОписанияПараметра) + 1;
	КонецЕсли;
	
	// Запоминаем, было ли двоеточие в конце исходного описания параметра.
	ПолноеОписаниеПараметра = СокрП(ПолноеОписаниеПараметра);
	ИсходноеПолноеОписаниеПараметраЗаканчиваетсяНаДвоеточие = СтрЗаканчиваетсяНа(ПолноеОписаниеПараметра, ":");
	
	// Удаляем незначащее текстовое описание.
	ПолноеОписаниеПараметра = Лев(ПолноеОписаниеПараметра, ПозицияТекстовогоОписанияПараметра - 1);
	ПолноеОписаниеПараметра = СокрП(ПолноеОписаниеПараметра);
	
	// Если исходное описание параметра заканчивалось на двоеточие, то добавляем двоеточие в конец нового описания.
	Если ИсходноеПолноеОписаниеПараметраЗаканчиваетсяНаДвоеточие Тогда
		ПолноеОписаниеПараметра = УдалитьПоследнийНезначимыйСимволИзСтроки(ПолноеОписаниеПараметра) + ":";
		// Если тип параметра заполнен, то добавляем двоеточие в него.
		ТипПараметра = СтрокаОписанияПараметра.ТипПараметра;
		Если НЕ ПустаяСтрока(ТипПараметра) Тогда
			СтрокаОписанияПараметра.ТипПараметра = УдалитьПоследнийНезначимыйСимволИзСтроки(ТипПараметра) + ":";
		КонецЕсли;
	КонецЕсли;
	
	// Переопределяем колонки строки описания параметра.
	НомерСтрокиНачалаОписанияПараметра = СтрокаОписанияПараметра.НомерСтрокиНачалаОписанияПараметра;
	НомерСтрокиКонцаОписанияПараметра = НомерСтрокиНачалаОписанияПараметра + СтрЧислоСтрок(ПолноеОписаниеПараметра) - 1;
	
	СтрокаОписанияПараметра.ПолноеОписаниеПараметра = ПолноеОписаниеПараметра;
	СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра = "";
	СтрокаОписанияПараметра.ПозицияТекстовогоОписанияПараметра = 0;
	СтрокаОписанияПараметра.НомерСтрокиКонцаОписанияПараметра = НомерСтрокиКонцаОписанияПараметра;
	СтрокаОписанияПараметра.СостояниеПараметра = "Изменен";
	
КонецПроцедуры

Процедура УстановитьТекстГиперссылкиВОписаниеПараметра(СтрокаОписанияПараметра)
	
	ТекстовоеОписаниеПараметра = СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра;
	
	// Вводим условное ограничение: если количество строк больше 3, то, возможно,
	// текстовое описание содержит пример описания другой процедуры, в котором есть гиперссылка "см.",
	// или описание подробно описывает нюансы параметра.
	// В любом случае, такое текстовое описание не удаляем - оставляем как есть.
	// Искать гиперссылку "см." бессмысленно, сразу выходим.
	Если СтрЧислоСтрок(ТекстовоеОписаниеПараметра) > 3 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстовоеОписаниеПараметраВРег = ВРег(ТекстовоеОписаниеПараметра);
	
	// Проверяем вхождения "см." и "см " в текстовое описание параметра.
	КоличествоВхожденийСм = 0;
	МассивТекстСм = Контекст["МассивТекстСм"];
	Для Каждого ТекстСм Из МассивТекстСм Цикл
		КоличествоВхожденийТекстСм = СтрЧислоВхождений(ТекстовоеОписаниеПараметраВРег, ТекстСм);
		КоличествоВхожденийСм = КоличествоВхожденийСм + КоличествоВхожденийТекстСм;
	КонецЦикла;
	
	Если КоличествоВхожденийСм <> 1 Тогда
		// Если вхождений нет или их больше 1, тогда выходим.
		Возврат;
	КонецЕсли;
	
	РезультатПоискаТекстСм = СтрНайтиПоМассиву(ТекстовоеОписаниеПараметраВРег, МассивТекстСм,,, Истина);
	Если НЕ РезультатПоискаТекстСм.Успешно Тогда
		Возврат;
	КонецЕсли;
	
	ПозицияТекстСм = РезультатПоискаТекстСм.Позиция;
	НайденныйТекстСм = РезультатПоискаТекстСм.НайденныйЭлемент;
	
	ТекстСм = Сред(ТекстовоеОписаниеПараметра, ПозицияТекстСм, СтрДлина(НайденныйТекстСм));
	ТекстСмСокрЛ = СокрЛ(ТекстСм);
	
	Если СтрСравнить(ТекстСмСокрЛ, "См") = 0 Тогда
		ТекстСм = ТекстСмСокрЛ + ".";
	КонецЕсли;
	
	// Заменяем ненужные символы.
	ТекстГиперссылки = ТекстовоеОписаниеПараметра;
	ТекстГиперссылки = СтрЗаменить(ТекстГиперссылки, "/", "");
	ТекстГиперссылки = СтрЗаменить(ТекстГиперссылки, Символы.Таб, " ");
	ТекстГиперссылки = СтрЗаменить(ТекстГиперссылки, Символы.ПС, " ");
	
	// Удаляем двойные пробелы для поиска.
	Пока СтрНайти(ТекстГиперссылки, "  ") > 0 Цикл
		ТекстГиперссылки = СтрЗаменить(ТекстГиперссылки, "  ", " ");
	КонецЦикла;
	
	// Сначала ищем в текстовом описании параметра каждый элемент из массива исключений гиперссылок,
	// из которых не нужно получать объект гиперссылки.
	МассивТекстИсключенийГиперссылокСм = Контекст["МассивТекстИсключенийГиперссылокСм"];
	РезультатПоискаИсключенияГиперссылки = СтрНайтиПоМассиву(ВРег(ТекстГиперссылки), МассивТекстИсключенийГиперссылокСм);
	Если РезультатПоискаИсключенияГиперссылки.Успешно Тогда
		// Если нашли, то выходим.
		Возврат;
	КонецЕсли;
	
	// Затем ищем каждый элемент из массива гиперссылок "см." в текстовом описании параметра.
	МассивТекстГиперссылокСм = Контекст["МассивТекстГиперссылокСм"];
	РезультатПоискаГиперссылки = СтрНайтиПоМассиву(ВРег(ТекстГиперссылки), МассивТекстГиперссылокСм);
	Если НЕ РезультатПоискаГиперссылки.Успешно Тогда
		// Если не нашли, то выходим.
		Возврат;
	КонецЕсли;
	
	НайденныйУказательГиперссылки = РезультатПоискаГиперссылки.НайденныйЭлемент;
	ПозицияГиперссылки = РезультатПоискаГиперссылки.Позиция;
	ТекстГиперссылки = Сред(ТекстГиперссылки, ПозицияГиперссылки + СтрДлина(НайденныйУказательГиперссылки));
	
	Если ПустаяСтрока(ТекстГиперссылки) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстГиперссылки = СокрЛ(ТекстГиперссылки);
	ДлинаТекстаГиперссылки = СтрДлина(ТекстГиперссылки);
	
	// Получаем объект гиперссылки, для этого ищем первый незначимый символ, при этом точка считается значимым символом.
	КоличествоЗначимыхСимволов = ДлинаТекстаГиперссылки;
	Для НомерСимвола = 1 По ДлинаТекстаГиперссылки Цикл
		
		СимволГиперссылки = Сред(ТекстГиперссылки, НомерСимвола, 1);
		
		// Если в тексте гиперссылки встретился знак "\", то это обозначение событий подсистемы, например,
		// См. СтандартныеПодсистемы.БазоваяФункциональность\ПередЗавершениемРаботыСистемы.
		// В этом случае, это не текст гиперссылки, выходим.
		Если СимволГиперссылки = "\" Тогда
			Возврат;
		КонецЕсли;
		
		// Если нашли первый незначимый символ, то прерываем.
		Если НЕ (апк_СловоСодержитЗначимыеСимволы(СимволГиперссылки) ИЛИ (СимволГиперссылки = ".")) Тогда
			КоличествоЗначимыхСимволов = НомерСимвола - 1;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	// Запоминаем текст гиперссылки в буфер, позже понадобится.
	ТекстГиперссылкиБуфер = ТекстГиперссылки;
	ТекстГиперссылки = Лев(ТекстГиперссылки, КоличествоЗначимыхСимволов);
	
	// Проверяем, является ли полученный текст гиперссылки объектом, процедурой, функцией или параметром.
	// Пока проверяем только по наличию заглавных букв в тексте: если их нет, то это не гиперссылка.
	Если ТекстГиперссылки = НРег(ТекстГиперссылки) Тогда
		Возврат;
	КонецЕсли;
	
	// Устанавливаем флаг, что в текстовом описании параметра содержится гиперссылка.
	СтрокаОписанияПараметра.ТекстовоеОписаниеПараметраСодержитГиперссылку = Истина;
	
	// Если тип параметра множественный, то выходим.
	Если СтрокаОписанияПараметра.ТипПараметраМножественный Тогда
		Возврат;
	КонецЕсли;
	
	// Если описание параметра начинается с тире, то, скорее всего, описан следующий тип предыдущего параметра, проверим его.
	Если СтрокаОписанияПараметра.ОписаниеПараметраНачинаетсяСТире Тогда
		// Получаем полную таблицу с описанием всех параметров.
		ТаблицаОписанияПараметров = СтрокаОписанияПараметра.Владелец();
		ИндексСтрокиОписанияПараметра = ТаблицаОписанияПараметров.Индекс(СтрокаОписанияПараметра);
		Если ИндексСтрокиОписанияПараметра > 0 Тогда
			// Получаем строку описания предыдущего параметра.
			ПредыдущаяСтрокаОписанияПараметра = ТаблицаОписанияПараметров[ИндексСтрокиОписанияПараметра - 1];
			// Если у предыдущего параметра отсутствует описание, то считаем,
			// что описание текущего параметра с гиперссылкой распространяется и на предыдущий,
			// тогда оставляем исходное описание без изменений и выходим.
			Если ПустаяСтрока(ПредыдущаяСтрокаОписанияПараметра.ТекстовоеОписаниеПараметра) Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Проверяем параметр в списке исключений типов и описаний для установки гиперссылки.
	ТипПараметра = ВРег(СтрокаОписанияПараметра.ТипПараметра);
	СписокТекстИсключенийТиповИОписанийПараметровДляУстановкиГиперссылкиСм = Контекст["СписокТекстИсключенийТиповИОписанийПараметровДляУстановкиГиперссылкиСм"];
	ЭлементИсключения = СписокТекстИсключенийТиповИОписанийПараметровДляУстановкиГиперссылкиСм.НайтиПоЗначению(ТипПараметра);
	Если ЭлементИсключения <> Неопределено Тогда
		// Проверяем конструкцию из представления найденного элемента списка значений в текстовом описании параметра.
		Если СтрНайти(ВРег(ТекстовоеОписаниеПараметра), ЭлементИсключения.Представление) > 0 Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Ищем дополнительные конструкции, которые могут быть указаны в текстовом описании после гиперссылки "см.".
	ТаблицаКонструкцийОбъектовПослеГиперссылокСм = Контекст["ТаблицаКонструкцийОбъектовПослеГиперссылокСм"];
	Для Каждого СтрокаКонструкцииОбъектаГиперссылки Из ТаблицаКонструкцийОбъектовПослеГиперссылокСм Цикл
		
		// Ищем текст конструкции после текста гиперссылки "см.".
		ТекстКонструкции = СтрокаКонструкцииОбъектаГиперссылки.ТекстКонструкции;
		ПозицияПоискаКонструкции = СтрНайти(ВРег(ТекстГиперссылкиБуфер), ТекстКонструкции,, КоличествоЗначимыхСимволов);
		Если ПозицияПоискаКонструкции = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Получаем имя объекта после искомой конструкции.
		ИмяНайденногоОбъекта = Сред(ТекстГиперссылкиБуфер, ПозицияПоискаКонструкции + СтрДлина(ТекстКонструкции));
		ИмяНайденногоОбъекта = ПолучитьПервоеСловоИзСтроки(ИмяНайденногоОбъекта);
		
		Если ПустаяСтрока(ИмяНайденногоОбъекта) Тогда
			Продолжить;
		КонецЕсли;
		
		// Если удалось получить, то добавляем имя объекта в текст гиперссылки.
		ПоложениеДобавленияОбъекта = СтрокаКонструкцииОбъектаГиперссылки.ПоложениеДобавленияОбъекта;
		Если ПоложениеДобавленияОбъекта = "Начало" Тогда
			ТекстГиперссылки = ИмяНайденногоОбъекта + "." + ТекстГиперссылки;
		ИначеЕсли ПоложениеДобавленияОбъекта = "Конец" Тогда
			ТекстГиперссылки = ТекстГиперссылки + "." + ИмяНайденногоОбъекта;
		КонецЕсли;
		
		// Добавляем тип объекта, если указан.
		ДобавляемыйТипОбъекта = СтрокаКонструкцииОбъектаГиперссылки.ДобавляемыйТипОбъекта;
		Если НЕ ПустаяСтрока(ДобавляемыйТипОбъекта) Тогда
			ТекстГиперссылки = ДобавляемыйТипОбъекта + "." + ТекстГиперссылки;
		КонецЕсли;
		
	КонецЦикла;
	
	// Запоминаем текст объекта гиперссылки.
	ТекстОбъектаГиперссылки = ТекстГиперссылки;
	
	// Добавляем статичный текст "см. ", "Массив из см. " или "ФиксированныйМассив из см. ".
	МассивТекстМассив = Контекст["МассивТекстМассив"];
	МассивТекстМассивИз = Контекст["МассивТекстМассивИз"];
	МассивТекстМассивИзСм = Контекст["МассивТекстМассивИзСм"];
	
	МассивТекстФиксированныйМассив = Контекст["МассивТекстФиксированныйМассив"];
	МассивТекстФиксированныйМассивИз = Контекст["МассивТекстФиксированныйМассивИз"];
	МассивТекстФиксированныйМассивИзСм = Контекст["МассивТекстФиксированныйМассивИзСм"];
	
	МассивТекстМассивИзСтрокаТаблицыЗначений = Контекст["МассивТекстМассивИзСтрокаТаблицыЗначений"];
	МассивТекстМассивИзСтрокаТаблицыЗначенийВРег = Контекст["МассивТекстМассивИзСтрокаТаблицыЗначенийВРег"];
	
	СтруктураПоискаТекстМассивИзСтрокаТаблицыЗначений = СтрНачинаетсяСПоМассиву(ТипПараметра, МассивТекстМассивИзСтрокаТаблицыЗначенийВРег);
	Если СтруктураПоискаТекстМассивИзСтрокаТаблицыЗначений.Успешно Тогда
		// Если был найден один из элементов, например, "Массив из СтрокаТаблицыЗначений", то добавляем этот статичный текст в текст гиперссылки.
		ТекстМассивИзСтрокаТаблицыЗначенийВРег = СтруктураПоискаТекстМассивИзСтрокаТаблицыЗначений.НайденныйЭлемент;
		НомерЭлемента = МассивТекстМассивИзСтрокаТаблицыЗначенийВРег.Найти(ТекстМассивИзСтрокаТаблицыЗначенийВРег);
		Если НомерЭлемента = Неопределено Тогда
			ДобавляемыйТекстГиперссылки = СтрокаОписанияПараметра.ТипПараметра + ": " + ТекстСм + " ";
		Иначе
			ТекстМассивИзСтрокаТаблицыЗначений = МассивТекстМассивИзСтрокаТаблицыЗначений[НомерЭлемента];
			ДобавляемыйТекстГиперссылки = ТекстМассивИзСтрокаТаблицыЗначений + ": " + ТекстСм + " ";
		КонецЕсли;
	ИначеЕсли (МассивТекстМассивИзСм.Найти(НайденныйУказательГиперссылки) <> Неопределено)
	 ИЛИ (МассивТекстМассив.Найти(ПреобразоватьТекстДляСравнения(ТипПараметра)) <> Неопределено)
	 ИЛИ СтрНачинаетсяСПоМассиву(ТипПараметра, МассивТекстМассивИз).Успешно Тогда
		// Если был найден элемент "Массив из см. " или тип параметра - "Массив", то добавляем этот статичный текст в текст гиперссылки.
		ДобавляемыйТекстГиперссылки = Контекст["ТекстМассивИзСм"];
	ИначеЕсли (МассивТекстФиксированныйМассивИзСм.Найти(НайденныйУказательГиперссылки) <> Неопределено)
		  ИЛИ (МассивТекстФиксированныйМассив.Найти(ПреобразоватьТекстДляСравнения(ТипПараметра)) <> Неопределено)
		  ИЛИ СтрНачинаетсяСПоМассиву(ТипПараметра, МассивТекстФиксированныйМассивИз).Успешно Тогда
		// Если был найден элемент "ФиксированныйМассив из см. " или тип параметра - "ФиксированныйМассив", то добавляем этот статичный текст в текст гиперссылки.
		ДобавляемыйТекстГиперссылки = Контекст["ТекстФиксированныйМассивИзСм"];
	Иначе
		// Иначе просто добавляем "см. ".
		ДобавляемыйТекстГиперссылки = ТекстСм + " ";
	КонецЕсли;
	
	ТекстГиперссылки = ДобавляемыйТекстГиперссылки + ТекстГиперссылки;
	
	// Если объект из гиперссылки не найден, то текстовое описание не меняем и выходим.
	СтрокаТаблицыОбъектовПереадресации = ПолучитьОбъектПереадресацииИзГиперссылки(ТекстОбъектаГиперссылки, СтрокаОписанияПараметра.Владелец());
	Если СтрокаТаблицыОбъектовПереадресации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Если объект переадресации не существует, то оставляем текстовое описание в исходном виде.
	Если НЕ СтрокаТаблицыОбъектовПереадресации.Существует Тогда
		// Если необходимо, то регистрируем ошибку.
		Если СтрокаТаблицыОбъектовПереадресации.ЗарегистрироватьОшибку Тогда
			ТекстОшибки = НСтр("ru='Не найден объект переадресации ""%1"" из текста гиперссылки ""см."":%3%2';
				|en='Не найден объект переадресации ""%1"" из текста гиперссылки ""см."":%3%2'", КодОсновногоЯзыка);
			ТекстОшибки = СтрШаблон(ТекстОшибки, ТекстОбъектаГиперссылки, СтрокаОписанияПараметра.ПолноеОписаниеПараметра, Символы.ПС);
			СтрокаОписанияПараметра.ТекстОшибки = ТекстОшибки;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	// Текстовое описание с гиперссылкой на процедуру оставляем в исходном виде.
	Если СтрокаТаблицыОбъектовПереадресации.ТипОбъектаПереадресации = "Процедура" Тогда
		Возврат;
	КонецЕсли;
	
	МассивСохраняемыхТиповПараметровПриУстановкеГиперссылкиСм = Контекст["МассивСохраняемыхТиповПараметровПриУстановкеГиперссылкиСм"];
	
	// Определяем номер символа, начиная с которого надо вставить новое текстовое описание параметра с гиперссылкой.
	// Сначала определяем ее как позицию типа параметра.
	ПозицияТекстовогоОписанияПараметра = СтрокаОписанияПараметра.ПозицияТипаПараметра;
	// Тип не указан.
	Если (ПозицияТекстовогоОписанияПараметра = 0)
		// Описание параметра начинается с тире.
		// В таком случае оставляем тип параметра, т.к. есть перечисление нескольких типов одного параметра.
	 ИЛИ (СтрокаОписанияПараметра.ОписаниеПараметраНачинаетсяСТире)
		// Этот тип параметра не надо удалять (нашли в отдельном массиве сохраняемых типов).
	 ИЛИ (МассивСохраняемыхТиповПараметровПриУстановкеГиперссылкиСм.Найти(ТипПараметра) <> Неопределено) Тогда
		// Вставляем начиная с прежнего текстового описания параметра.
		ПозицияТекстовогоОписанияПараметра = СтрокаОписанияПараметра.ПозицияТекстовогоОписанияПараметра;
	КонецЕсли;
	
	// Если позиция не определена, то выходим.
	Если ПозицияТекстовогоОписанияПараметра = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаОписанияПараметра.ТекстовоеОписаниеПараметраЯвляетсяГиперссылкой = Истина;
	
	ТекстовоеОписаниеПараметра = ТекстГиперссылки;
	
	// Изменяем полное описание параметра.
	ПолноеОписаниеПараметра = СтрокаОписанияПараметра.ПолноеОписаниеПараметра;
	ПолноеОписаниеПараметра = Лев(ПолноеОписаниеПараметра, ПозицияТекстовогоОписанияПараметра - 1);
	
	// Если это первая строка описания возвращаемого значения,
	// и вставка гиперссылки происходит в начало строки комментария, то увеличим отступ до 3-х пробелов.
	Если СтрокаОписанияПараметра.ЭтоОписаниеВозвращаемогоЗначения Тогда
		ПолноеОписаниеПараметраБуфер = СокрП(ПолноеОписаниеПараметра);
		Если СтрЗаканчиваетсяНа(ПолноеОписаниеПараметраБуфер, "//") Тогда
			РазницаОтступов = СтрДлина(ПолноеОписаниеПараметра) - СтрДлина(ПолноеОписаниеПараметраБуфер);
			Если РазницаОтступов < 3 Тогда
				ПолноеОписаниеПараметра = ПолноеОписаниеПараметраБуфер + "   ";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ПолноеОписаниеПараметра = ПолноеОписаниеПараметра + ТекстовоеОписаниеПараметра;
	
	// Если полное описание параметра не изменилось, то выходим.
	Если СокрЛП(СтрокаОписанияПараметра.ПолноеОписаниеПараметра) = ПолноеОписаниеПараметра Тогда
		Возврат;
	КонецЕсли;
	
	// Переопределяем остальные колонки строки описания параметра.
	НомерСтрокиНачалаОписанияПараметра = СтрокаОписанияПараметра.НомерСтрокиНачалаОписанияПараметра;
	НомерСтрокиКонцаОписанияПараметра = НомерСтрокиНачалаОписанияПараметра + СтрЧислоСтрок(ПолноеОписаниеПараметра) - 1;
	
	// Тип параметра и его позицию необходимо очистить, только если описание не начинается с тире.
	Если НЕ СтрокаОписанияПараметра.ОписаниеПараметраНачинаетсяСТире Тогда
		СтрокаОписанияПараметра.ТипПараметра = "";
		СтрокаОписанияПараметра.ПозицияТипаПараметра = 0;
	КонецЕсли;
	СтрокаОписанияПараметра.ПолноеОписаниеПараметра = ПолноеОписаниеПараметра;
	СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра = ТекстовоеОписаниеПараметра;
	СтрокаОписанияПараметра.ПозицияТекстовогоОписанияПараметра = ПозицияТекстовогоОписанияПараметра;
	СтрокаОписанияПараметра.НомерСтрокиКонцаОписанияПараметра = НомерСтрокиКонцаОписанияПараметра;
	СтрокаОписанияПараметра.ТекстовоеОписаниеПараметраЯвляетсяГиперссылкой = Истина;
	СтрокаОписанияПараметра.СостояниеПараметра = "Изменен";
	
КонецПроцедуры

Процедура ДобавитьДвоеточиеВКонцеСтрокиОписанияПараметра(СтрокаОписанияПараметра)
	
	// Если описание параметра уже заканчивается на двоеточие, то выходим.
	ПолноеОписаниеПараметра = СтрокаОписанияПараметра.ПолноеОписаниеПараметра;
	ПолноеОписаниеПараметра = СокрП(ПолноеОписаниеПараметра);
	Если СтрЗаканчиваетсяНа(ПолноеОписаниеПараметра, ":") Тогда
		Возврат;
	КонецЕсли;
	
	// Если описание параметра заканчивается на многоточие, то выходим.
	Если СтрЗаканчиваетсяНа(ПолноеОписаниеПараметра, "...") Тогда
		Возврат;
	КонецЕсли;
	
	// Для параметров с гиперссылкой в текстовом описании добавлять двоеточие не требуется, выходим.
	Если СтрокаОписанияПараметра.ТекстовоеОписаниеПараметраСодержитГиперссылку Тогда
		Возврат;
	КонецЕсли;
	
	// Если не заполнены ни тип параметра, ни текстовое описание, то выходим.
	ТипПараметра = СтрокаОписанияПараметра.ТипПараметра;
	ТекстовоеОписаниеПараметра = СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра;
	Если ПустаяСтрока(ТипПараметра) И ПустаяСтрока(ТекстовоеОписаниеПараметра) Тогда
		Возврат;
	КонецЕсли;
	
	// Получаем полную таблицу с описанием всех параметров.
	ТаблицаОписанияПараметров = СтрокаОписанияПараметра.Владелец();
	
	// Если текущий параметр - последний, то выходим.
	ИндексСтрокиОписанияПараметра = ТаблицаОписанияПараметров.Индекс(СтрокаОписанияПараметра);
	Если ИндексСтрокиОписанияПараметра >= ТаблицаОписанияПараметров.Количество() - 1 Тогда
		Возврат;
	КонецЕсли;
	
	// Получаем строку описания следующего параметра.
	СтрокаОписанияСледующегоПараметра = ТаблицаОписанияПараметров[ИндексСтрокиОписанияПараметра + 1];
	
	// Если текущий и следующий параметры находятся в разных секциях описания, то выходим.
	СекцияОписания = СтрокаОписанияПараметра.СекцияОписания;
	Если СекцияОписания <> СтрокаОписанияСледующегоПараметра.СекцияОписания Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим, является ли следующий описанный параметр параметром текущего метода.
	Если СекцияОписания = "Параметры" Тогда
		ИмяСледующегоПараметра = СтрокаОписанияСледующегоПараметра.ИмяПараметра;
		// Если следующий параметр является свойством предыдущего параметра, то проверять бессмысленно.
		Если НЕ СтрНачинаетсяС(ИмяСледующегоПараметра, "*") Тогда
			ТекущийОбрабатываемыйМетод = Контекст["ТекущийОбрабатываемыйМетод"];
			Если ТекущийОбрабатываемыйМетод <> Неопределено Тогда
				// Получаем массив параметров текущего метода.
				МассивПараметровМетода = ТекущийОбрабатываемыйМетод.МассивПараметров;
				Для Каждого ИмяПараметраМетода Из МассивПараметровМетода Цикл
					// Проверяем каждый параметр метода.
					ИмяПараметраМетода = ПолучитьИмяПараметра(ИмяПараметраМетода);
					Если СтрСравнить(ИмяПараметраМетода, ИмяСледующегоПараметра) = 0 Тогда
						// Нашли следующий параметр среди параметров текущего метода.
						// Двоеточие не нужно, выходим.
						Возврат;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Проверяем исключения для строк параметров, в которые не нужно добавлять двоеточие.
	МассивОписанийБезДобавленияДвоеточия = Контекст["МассивОписанийБезДобавленияДвоеточия"];
	Если СтрНайтиПоМассиву(ВРег(ПолноеОписаниеПараметра), МассивОписанийБезДобавленияДвоеточия).Успешно Тогда
		Возврат;
	КонецЕсли;
	
	// Инициализируем дополнительный флаг.
	ДобавитьДвоеточие = Ложь;
	
	// Если уровень вложенности следующего параметра больше текущего, то двоеточие нужно.
	Если СтрокаОписанияСледующегоПараметра.УровеньВложенностиПараметра > СтрокаОписанияПараметра.УровеньВложенностиПараметра Тогда
		ДобавитьДвоеточие = Истина;
	КонецЕсли;
	
	// Проверяем следующее условие.
	Если НЕ ДобавитьДвоеточие Тогда
		
		// Иногда уровень вложенности параметра (количество звездочек в имени параметра) установлено неверно.
		// Тогда определяем, является ли тип параметра составным.
		МассивСоставныхТиповПараметров = Контекст["МассивСоставныхТиповПараметров"];
		ЕстьСоставнойТип = Ложь;
		
		// Проверяем все типы параметра в массиве составных типов.
		// Ранее было разделение типов по строкам, поэтому массив типов параметра получаем, разделив строку по запятой и тире.
		МассивТиповПараметра = СтрРазделить(ТипПараметра, ",-", Ложь);
		Для Каждого ЭлементМассиваТиповПараметра Из МассивТиповПараметра Цикл
			ЭлементМассиваТиповПараметра = ПреобразоватьТекстДляСравнения(ЭлементМассиваТиповПараметра);
			// Если какой-то из типов параметра составной, то устанавливаем флаг.
			Если МассивСоставныхТиповПараметров.Найти(ЭлементМассиваТиповПараметра) <> Неопределено Тогда
				ЕстьСоставнойТип = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		// Если у параметра нет составного типа, то выходим.
		Если НЕ ЕстьСоставнойТип Тогда
			Возврат;
		КонецЕсли;
		
		// Если позиция имени параметра равна 0, то берем позицию типа параметра.
		ПозицияНачалаПараметра = СтрокаОписанияПараметра.ПозицияИмениПараметра;
		Если ПозицияНачалаПараметра = 0 Тогда
			ПозицияНачалаПараметра = СтрокаОписанияПараметра.ПозицияТипаПараметра;
		КонецЕсли;
		
		// Если отступ следующего параметра больше, чем у текущего параметра, то нужно добавить двоеточие.
		ПозицияИмениСледующегоПараметра = СтрокаОписанияСледующегоПараметра.ПозицияИмениПараметра;
		Если ПозицияИмениСледующегоПараметра > ПозицияНачалаПараметра Тогда
			ДобавитьДвоеточие = Истина;
		КонецЕсли;
		
		// Ранее в текущей строке описания мы заменили каждый таб на 2 пробела, поэтому отступы могут не совпадать.
		Если НЕ ДобавитьДвоеточие Тогда
			// Заменим табы на пробелы в строке описания следующего параметра.
			ЗаменитьТабыНаПробелыПередОписаниемПараметра(СтрокаОписанияСледующегоПараметра);
			ПозицияИмениСледующегоПараметра = СтрокаОписанияСледующегоПараметра.ПозицияИмениПараметра;
			// И сравним отступы текущего и следующего параметра еще раз.
			Если ПозицияИмениСледующегоПараметра > ПозицияНачалаПараметра Тогда
				ДобавитьДвоеточие = Истина;
			КонецЕсли;
		КонецЕсли;
		
		// Если текущий параметр является первой строкой описания возвращаемого значения,
		// и он составного типа (проверили выше),
		// и у следующего параметра заполнено наименование, то добавим двоеточие.
		Если НЕ ДобавитьДвоеточие Тогда
			Если СтрокаОписанияПараметра.ЭтоОписаниеВозвращаемогоЗначения Тогда
				Если НЕ ПустаяСтрока(СтрокаОписанияСледующегоПараметра.ИмяПараметра) Тогда
					ДобавитьДвоеточие = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// Если ни одно из условий не сработало, то выходим.
	Если НЕ ДобавитьДвоеточие Тогда
		Возврат;
	КонецЕсли;
	
	// В остальных случаях добавляем двоеточие и переопределяем колонки строки описания параметра.
	Если НЕ ПустаяСтрока(ТекстовоеОписаниеПараметра) Тогда
		СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра = УдалитьПоследнийНезначимыйСимволИзСтроки(ТекстовоеОписаниеПараметра) + ":";
	ИначеЕсли НЕ ПустаяСтрока(ТипПараметра) Тогда
		СтрокаОписанияПараметра.ТипПараметра = УдалитьПоследнийНезначимыйСимволИзСтроки(ТипПараметра) + ":";
	Иначе
		Возврат;
	КонецЕсли;
	
	СтрокаОписанияПараметра.ПолноеОписаниеПараметра = УдалитьПоследнийНезначимыйСимволИзСтроки(ПолноеОписаниеПараметра) + ":";
	СтрокаОписанияПараметра.СостояниеПараметра = "Изменен";
	
КонецПроцедуры

Процедура ФорматироватьОписаниеСекцииВозвращаемоеЗначение(СтрокаОписанияПараметра)
	
	// Если это не секция описания возвращаемого значения, то выходим.
	Если НЕ СтрокаОписанияПараметра.ЭтоОписаниеВозвращаемогоЗначения Тогда
		Возврат;
	КонецЕсли;
	
	// Если описание параметра не начинается с "// Возвращаемое значение", то выходим.
	ПолноеОписаниеПараметра = СтрокаОписанияПараметра.ПолноеОписаниеПараметра;
	ПолноеОписаниеПараметраБуфер = ПреобразоватьТекстДляСравнения(ПолноеОписаниеПараметра);
	ПолноеОписаниеПараметраБуфер = "//" + ПолноеОписаниеПараметраБуфер;
	МассивТекстВозвращаемоеЗначение = Контекст["МассивТекстВозвращаемоеЗначение"];
	
	Если НЕ СтрНачинаетсяСПоМассиву(ПолноеОписаниеПараметраБуфер, МассивТекстВозвращаемоеЗначение).Успешно Тогда
		Возврат;
	КонецЕсли;
	
	РезультатПоиска = СтрНайтиПоМассиву(ВРег(ПолноеОписаниеПараметра), МассивТекстВозвращаемоеЗначение,,, Истина);
	Если НЕ РезультатПоиска.Успешно Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВозвращаемоеЗначение = РезультатПоиска.НайденныйЭлемент;
	
	ТекстПослеВозвращаемогоЗначения = Сред(ПолноеОписаниеПараметра, РезультатПоиска.Позиция
		+ СтрДлина(ТекстВозвращаемоеЗначение));
	
	ТекстПослеВозвращаемогоЗначения = УдалитьПервыйНезначимыйСимволИзСтроки(ТекстПослеВозвращаемогоЗначения);
	Если СтрНачинаетсяС(ТекстПослеВозвращаемогоЗначения, "//") Тогда
		ТекстПослеВозвращаемогоЗначения = СтрЗаменить(ТекстПослеВозвращаемогоЗначения, "/", "");
		ТекстПослеВозвращаемогоЗначения = СокрЛ(ТекстПослеВозвращаемогоЗначения);
	КонецЕсли;
	
	ПолноеОписаниеПараметра = "// " + ТекстВозвращаемоеЗначение + ":"
		+ Символы.ПС
		+ "//   " + ТекстПослеВозвращаемогоЗначения;
	
	// Переопределяем остальные колонки строки описания параметра.
	НомерСтрокиНачалаОписанияПараметра = СтрокаОписанияПараметра.НомерСтрокиНачалаОписанияПараметра;
	НомерСтрокиКонцаОписанияПараметра = НомерСтрокиНачалаОписанияПараметра + СтрЧислоСтрок(ПолноеОписаниеПараметра) - 1;
	
	СтрокаОписанияПараметра.ПолноеОписаниеПараметра = ПолноеОписаниеПараметра;
	СтрокаОписанияПараметра.НомерСтрокиКонцаОписанияПараметра = НомерСтрокиКонцаОписанияПараметра;
	СтрокаОписанияПараметра.СостояниеПараметра = "Изменен";
	СтрокаОписанияПараметра.НеобходимоПовторноеФорматирование = Истина;
	
КонецПроцедуры

Процедура ДобавитьДополнительныйОтступДляПараметраОписанияВозвращаемогоЗначения(СтрокаОписанияПараметра)
	
	// Если это не секция описания возвращаемого значения, то выходим.
	Если НЕ СтрокаОписанияПараметра.ЭтоОписаниеВозвращаемогоЗначения Тогда
		Возврат;
	КонецЕсли;
	
	// Если заполнено имя или тип параметра, то выходим.
	Если (НЕ ПустаяСтрока(СтрокаОписанияПараметра.ИмяПараметра))
	 ИЛИ (НЕ ПустаяСтрока(СтрокаОписанияПараметра.ТипПараметра)) Тогда
		Возврат;
	КонецЕсли;
	
	// Получаем позицию текстового описания текущего параметра.
	ПозицияТекстовогоОписанияПараметра = СтрокаОписанияПараметра.ПозицияТекстовогоОписанияПараметра;
	Если ПозицияТекстовогоОписанияПараметра = 0 Тогда
		// Если не заполнено, то выходим.
		Возврат;
	КонецЕсли;
	
	// Ищем предыдущий параметр, получаем таблицу параметров.
	ТаблицаОписанияПараметров = СтрокаОписанияПараметра.Владелец();
	ИндексСтрокиТекущегоПараметра = ТаблицаОписанияПараметров.Индекс(СтрокаОписанияПараметра);
	Если ИндексСтрокиТекущегоПараметра = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаОписанияПредыдущегоПараметра = ТаблицаОписанияПараметров[ИндексСтрокиТекущегоПараметра - 1];
	
	// Если секции не равны, то выходим.
	Если СтрокаОписанияПредыдущегоПараметра.СекцияОписания <> СтрокаОписанияПараметра.СекцияОписания Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеОписаниеПредыдущегоПараметра = СтрокаОписанияПредыдущегоПараметра.ПолноеОписаниеПараметра;
	
	// Если между описанием предыдущего и текущего параметра есть пустая строка,
	// то, вероятно, отступ сделан специально, пропускаем такие случаи.
	Если (ИндексСтрокиТекущегоПараметра - ТаблицаОписанияПараметров.Индекс(СтрокаОписанияПредыдущегоПараметра)) = 1 Тогда
		
		// Проверяем номера строк текущего и предыдущего параметра.
		НомерСтрокиКонцаОписанияПредыдущегоПараметра = СтрокаОписанияПредыдущегоПараметра.НомерСтрокиКонцаОписанияПараметра;
		НомерСтрокиНачалаОписанияПараметра = СтрокаОписанияПараметра.НомерСтрокиНачалаОписанияПараметра;
		
		// Если номер строки окончания описания предыдущего подряд параметра отличается
		// от номера строки начала описания текущего параметра больше, чем на 1,
		// то считаем, что между параметрами есть пустая строка, тогда пропускаем.
		Если НомерСтрокиНачалаОписанияПараметра - НомерСтрокиКонцаОписанияПредыдущегоПараметра > 1 Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	СписокТекстСоответствие = Контекст["СписокТекстСоответствие"];
	МассивТекстСоответствиеИзКлючИЗначение = Новый Массив;
	Для Каждого ЭлементСписка Из СписокТекстСоответствие Цикл
		МассивТекстСоответствиеИзКлючИЗначение.Добавить(ЭлементСписка.Представление);
	КонецЦикла;
	МассивТекстСоответствиеИзКлючИЗначение = ПреобразоватьМассивДляСравнения(МассивТекстСоответствиеИзКлючИЗначение);
	
	// Если тип предыдущего параметра называется "Соответствие из КлючИЗначение",
	ТипПредыдущегоПараметра = ПреобразоватьТекстДляСравнения(СтрокаОписанияПредыдущегоПараметра.ТипПараметра);
	Если МассивТекстСоответствиеИзКлючИЗначение.Найти(ТипПредыдущегоПараметра) <> Неопределено Тогда
		// то проверим, нет ли в его описании свойства "* Значение".
		ТекстЗначение = "* " + Контекст["ТекстЗначение"] + " - ";
		ПозицияТекстаЗначение = СтрНайти(ПолноеОписаниеПредыдущегоПараметра, ТекстЗначение);
		Если ПозицияТекстаЗначение > 0 Тогда
			// Если нашли текст "* Значение", то в качестве полного описания предыдущего параметра берем строку со значением.
			НомерСтрокиТекстаЗначение = ПолучитьНомерСтрокиМодуля(ПолноеОписаниеПредыдущегоПараметра, ПозицияТекстаЗначение);
			ПолноеОписаниеПредыдущегоПараметра = СтрПолучитьСтроку(ПолноеОписаниеПредыдущегоПараметра, НомерСтрокиТекстаЗначение);
		КонецЕсли;
	КонецЕсли;
	
	// Если отступ текущего параметра больше предыдущего, то пропускаем.
	ПолноеОписаниеПараметра = СтрокаОписанияПараметра.ПолноеОписаниеПараметра;
	ОтступТекущегоПараметра = ПолучитьОтступПослеЗнакаКомментария(ПолноеОписаниеПараметра);
	ОтступПредыдущегоПараметра = ПолучитьОтступПослеЗнакаКомментария(ПолноеОписаниеПредыдущегоПараметра, Ложь);
	ДлинаОтступаТекущегоПараметра = СтрДлина(ОтступТекущегоПараметра);
	ДлинаОтступаПредыдущегоПараметра = СтрДлина(ОтступПредыдущегоПараметра);
	Если ДлинаОтступаТекущегоПараметра > ДлинаОтступаПредыдущегоПараметра Тогда
		Возврат;
	КонецЕсли;
	
	// Берем отступ предыдущего параметра, заменяем таб на 2 пробела.
	ОтступПредыдущегоПараметра = СтрЗаменить(ОтступПредыдущегоПараметра, Символы.Таб, "  ");
	
	// Если у предыдущего параметра нет имени и типа,
	Если ПустаяСтрока(СтрокаОписанияПредыдущегоПараметра.ИмяПараметра) И ПустаяСтрока(СтрокаОписанияПредыдущегоПараметра.ТипПараметра) Тогда
		
		// и отступы параметров равны, то пропускаем.
		Если (ДлинаОтступаТекущегоПараметра = ДлинаОтступаПредыдущегоПараметра) Тогда
			Возврат;
		КонецЕсли;
		
		// Если отступы не равны, то берем за основу отступ предыдущего параметра, т.к. он уже сдвинут.
		ОтступТекущегоПараметра = ОтступПредыдущегоПараметра;
		
	Иначе
		
		// Иначе добавляем в отступ предыдущего параметра 2 пробела.
		ОтступТекущегоПараметра = ОтступПредыдущегоПараметра + "  ";
		
	КонецЕсли;
	
	// Заменяем отступ в текущем описании параметра.
	ПолноеОписаниеПараметра = "//" + ОтступТекущегоПараметра + Сред(ПолноеОписаниеПараметра, ПозицияТекстовогоОписанияПараметра);
	
	// Переопределяем остальные колонки строки описания параметра.
	ПереопределитьОписаниеПараметра(СтрокаОписанияПараметра, СтрПолучитьСтроку(ПолноеОписаниеПараметра, 1));
	СтрокаОписанияПараметра.НеобходимоПовторноеФорматирование = Истина;
	
КонецПроцедуры

Процедура ДобавитьДополнительныйОтступДляСвойстваПараметраОписанияВозвращаемогоЗначения(СтрокаОписанияПараметра)
	
	// Флаг "ЭтоОписаниеВозвращаемогоЗначения" проверять бесполезно,
	// т.к. если имя или тип параметра начинается со "*",
	// то ему автоматически сбрасывается флаг ЭтоОписаниеВозвращаемогоЗначения = Ложь.
	
	// Проверяем секцию описания параметра. Если это не "ВозвращаемоеЗначение", тогда выходим.
	СекцияОписания = СтрокаОписанияПараметра.СекцияОписания;
	Если СекцияОписания <> "ВозвращаемоеЗначение" Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем флаг "ОписаниеПараметраНачинаетсяСоЗвездочки".
	Если НЕ СтрокаОписанияПараметра.ОписаниеПараметраНачинаетсяСоЗвездочки Тогда
		Возврат;
	КонецЕсли;
	
	// Если это не параметр верхнего уровня, то пропускаем.
	Если НЕ СтрокаОписанияПараметра.ЭтоПараметрВерхнегоУровня Тогда
		Возврат;
	КонецЕсли;
	
	ПозицияИмениПараметра = СтрокаОписанияПараметра.ПозицияИмениПараметра;
	Если ПозицияИмениПараметра = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Ищем предыдущий параметр верхнего уровня в секции "ВозвращаемоеЗначение", у которого отсутствует звездочка.
	СтрокаОписанияПредыдущегоПараметра = Неопределено;
	ТаблицаОписанияПараметров = СтрокаОписанияПараметра.Владелец();
	ИндексСтрокиОписанияПараметра = ТаблицаОписанияПараметров.Индекс(СтрокаОписанияПараметра);
	Для ИндексСтроки = 1 По ИндексСтрокиОписанияПараметра Цикл
		
		// Если секция не совпадает, то прерываем.
		ИндексСтрокиВверх = ИндексСтрокиОписанияПараметра - ИндексСтроки;
		СтрокаОписанияПараметраВверх = ТаблицаОписанияПараметров[ИндексСтрокиВверх];
		Если СтрокаОписанияПараметраВверх.СекцияОписания <> СекцияОписания Тогда
			Прервать;
		КонецЕсли;
		
		// Если это не параметр верхнего уровня, то пропускаем.
		Если НЕ СтрокаОписанияПараметраВверх.ЭтоПараметрВерхнегоУровня Тогда
			Продолжить;
		КонецЕсли;
		
		// Если параметр не начинается со звездочки, то прерываем.
		Если НЕ СтрокаОписанияПараметраВверх.ОписаниеПараметраНачинаетсяСоЗвездочки Тогда
			СтрокаОписанияПредыдущегоПараметра = СтрокаОписанияПараметраВверх;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	// Если не нашли параметр, который начинается со звездочки, то выходим.
	Если СтрокаОписанияПредыдущегоПараметра = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Устанавливаем отступ текущего параметра как отступ предыдущего + 2 пробела.
	ПолноеОписаниеПредыдущегоПараметра = СтрокаОписанияПредыдущегоПараметра.ПолноеОписаниеПараметра;
	ОтступПредыдущегоПараметра = ПолучитьОтступПослеЗнакаКомментария(ПолноеОписаниеПредыдущегоПараметра, Ложь);
	ОтступПредыдущегоПараметра = СтрЗаменить(ОтступПредыдущегоПараметра, Символы.Таб, "  ");
	
	НовыйОтступТекущегоПараметра = ОтступПредыдущегоПараметра + "  ";
	
	ПолноеОписаниеПараметра = СтрокаОписанияПараметра.ПолноеОписаниеПараметра;
	ПолноеОписаниеПараметра = "//" + НовыйОтступТекущегоПараметра + Сред(ПолноеОписаниеПараметра, ПозицияИмениПараметра);
	
	// Переопределяем остальные колонки строки описания параметра.
	ПерваяСтрокаПолногоОписанияПараметра = СтрПолучитьСтроку(ПолноеОписаниеПараметра, 1);
	ПереопределитьОписаниеПараметра(СтрокаОписанияПараметра, ПерваяСтрокаПолногоОписанияПараметра);
	СтрокаОписанияПараметра.ЭтоПараметрВерхнегоУровня = Ложь;
	
	// Сдвигаем все параметры ниже с уровнем вложенности больше текущего.
	УровеньВложенностиПараметра = СтрокаОписанияПараметра.УровеньВложенностиПараметра;
	Для ИндексСтроки = ИндексСтрокиОписанияПараметра + 1 По ТаблицаОписанияПараметров.Количество() - 1 Цикл
		
		// Если секция не совпадает, то прерываем.
		СтрокаОписанияСледующегоПараметра = ТаблицаОписанияПараметров[ИндексСтроки];
		Если СтрокаОписанияСледующегоПараметра.СекцияОписания <> СекцияОписания Тогда
			Прервать;
		КонецЕсли;
		
		// Если уровень вложенности следующего параметра не больше текущего, то прерываем.
		Если СтрокаОписанияСледующегоПараметра.УровеньВложенностиПараметра <= УровеньВложенностиПараметра Тогда
			Прервать;
		КонецЕсли;
		
		// Если имя параметра не определено, то пропускаем.
		ПозицияИмениСледующегоПараметра = СтрокаОписанияСледующегоПараметра.ПозицияИмениПараметра;
		Если ПозицияИмениСледующегоПараметра = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Сдвигаем параметр относительного текущего на 2 пробела.
		НовыйОтступСледующегоПараметра = НовыйОтступТекущегоПараметра + "  ";
		ПолноеОписаниеСледующегоПараметра = СтрокаОписанияСледующегоПараметра.ПолноеОписаниеПараметра;
		ПолноеОписаниеСледующегоПараметра = "//" + НовыйОтступСледующегоПараметра + Сред(ПолноеОписаниеСледующегоПараметра, ПозицияИмениСледующегоПараметра);
		
		ПерваяСтрокаПолногоОписанияСледующегоПараметра = СтрПолучитьСтроку(ПолноеОписаниеСледующегоПараметра, 1);
		ПереопределитьОписаниеПараметра(СтрокаОписанияСледующегоПараметра, ПерваяСтрокаПолногоОписанияСледующегоПараметра);
		СтрокаОписанияСледующегоПараметра.ЭтоПараметрВерхнегоУровня = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьЗвездочкуВПараметреОписанияВозвращаемогоЗначения(СтрокаОписанияПараметра)
	
	// Флаг "ЭтоОписаниеВозвращаемогоЗначения" проверять бесполезно,
	// т.к. если имя или тип параметра начинается со "*",
	// то ему автоматически сбрасывается флаг ЭтоОписаниеВозвращаемогоЗначения = Ложь.
	
	// Проверяем секцию описания параметра. Если это не "ВозвращаемоеЗначение", тогда выходим.
	МассивТекстВозвращаемоеЗначение = Контекст["МассивТекстВозвращаемоеЗначение"];
	СекцияОписания = СтрокаОписанияПараметра.СекцияОписания;
	Если МассивТекстВозвращаемоеЗначение.Найти(СекцияОписания) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем флаг "ОписаниеПараметраНачинаетсяСоЗвездочки".
	Если НЕ СтрокаОписанияПараметра.ОписаниеПараметраНачинаетсяСоЗвездочки Тогда
		Возврат;
	КонецЕсли;
	
	// Если это не параметр верхнего уровня, то пропускаем.
	Если НЕ СтрокаОписанияПараметра.ЭтоПараметрВерхнегоУровня Тогда
		Возврат;
	КонецЕсли;
	
	// Удаляем звездочку в начале описания параметра.
	ПолноеОписаниеПараметра = СтрокаОписанияПараметра.ПолноеОписаниеПараметра;
	ПозицияЗвездочки = СтрНайти(ПолноеОписаниеПараметра, "*");
	Если ПозицияЗвездочки = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеОписаниеПараметраДоЗвездочки = Лев(ПолноеОписаниеПараметра, ПозицияЗвездочки - 1);
	ПолноеОписаниеПараметраПослеЗвездочки = Сред(ПолноеОписаниеПараметра, ПозицияЗвездочки);
	
	Пока СтрНачинаетсяС(ПолноеОписаниеПараметраПослеЗвездочки, "*") Цикл
		ПолноеОписаниеПараметраПослеЗвездочки = Сред(ПолноеОписаниеПараметраПослеЗвездочки, 2);
		ПолноеОписаниеПараметраПослеЗвездочки = СокрЛ(ПолноеОписаниеПараметраПослеЗвездочки);
	КонецЦикла;
	
	ПолноеОписаниеПараметра = ПолноеОписаниеПараметраДоЗвездочки + ПолноеОписаниеПараметраПослеЗвездочки;
	ПерваяСтрокаПолногоОписанияПараметра = СтрПолучитьСтроку(ПолноеОписаниеПараметра, 1);
	
	// Переопределяем остальные колонки строки описания параметра.
	ПереопределитьОписаниеПараметра(СтрокаОписанияПараметра, ПерваяСтрокаПолногоОписанияПараметра);
	СтрокаОписанияПараметра.НеобходимоПовторноеФорматирование = Истина;
	
КонецПроцедуры

Процедура ЗаменитьОписаниеТипаПараметраСДлинойСтрокиИЧисла(СтрокаОписанияПараметра)
	
	// Если тип параметра не определен, то выходим.
	ТипПараметра = СтрокаОписанияПараметра.ТипПараметра;
	Если ПустаяСтрока(ТипПараметра) Тогда
		Возврат;
	КонецЕсли;
	
	ПозицияТипаПараметра = СтрокаОписанияПараметра.ПозицияТипаПараметра;
	Если ПозицияТипаПараметра = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Если в типе нет скобок, то выходим.
	ПозицияОткрывающейсяСкобки = СтрНайти(ТипПараметра, "(");
	Если ПозицияОткрывающейсяСкобки = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПозицияЗакрывающейсяСкобки = СтрНайти(ТипПараметра, ")");
	Если ПозицияЗакрывающейсяСкобки = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Если кроме скобок в типе параметра ничего не указано, то выходим.
	ТипПараметраБезДлины = Лев(ТипПараметра, ПозицияОткрывающейсяСкобки - 1);
	Если ПустаяСтрока(ТипПараметраБезДлины) Тогда
		Возврат;
	КонецЕсли;
	
	ТипПараметраБезДлины = СокрЛП(ТипПараметраБезДлины);
	
	// Получаем текст в скобках.
	ТекстДлиныТипаПараметраВСкобках = Сред(ТипПараметра, ПозицияОткрывающейсяСкобки + 1, ПозицияЗакрывающейсяСкобки - ПозицияОткрывающейсяСкобки - 1);
	// В скобках может быть указано несколько чисел через запятую, например, для типа "Число" будет указана длина и точность числа.
	МассивЭлементовДлины = СтрРазделить(ТекстДлиныТипаПараметраВСкобках, ",", Ложь);
	Если МассивЭлементовДлины.Количество() = 0 Тогда
		// Если текст пустой, то выходим.
		Возврат;
	КонецЕсли;
	
	// Берем только первое число в скобках.
	ДлинаТипаПараметра = МассивЭлементовДлины[0];
	Если НЕ апк_ЭтоЧисло(ДлинаТипаПараметра) Тогда
		// Если это не число, то выходим.
		Возврат;
	КонецЕсли;
	
	// Добавляем статичный текст, например, "строка длиной 25 символов" в начало текстового описания параметра.
	ДлинаТипаПараметра = Число(ДлинаТипаПараметра);
	
	Если КодОсновногоЯзыка = "ru" Тогда
		// Для русского языка получаем длину типа параметра в виде числа прописью и склонение слова "символ".
		ДлинаТипаПараметраПрописью = ЧислоПрописью(ДлинаТипаПараметра, НСтр("ru='Л=ru_RU'"), НСтр("ru='символ, символа, символов, м,,,,, 0'"));
		МассивСловТипаПараметраПрописью = СтрРазделить(ДлинаТипаПараметраПрописью, " ", Ложь);
		СловоСимволов = МассивСловТипаПараметраПрописью[МассивСловТипаПараметраПрописью.ВГраница()];
		
		ДополнительноеТекстовоеОписание = НРег(ТипПараметраБезДлины) + " длиной %1 %2";
		ДополнительноеТекстовоеОписание = СтрШаблон(ДополнительноеТекстовоеОписание, ДлинаТипаПараметра, СловоСимволов);
	Иначе
		ДополнительноеТекстовоеОписание = "a %1-character-long " + НРег(ТипПараметраБезДлины);
		ДополнительноеТекстовоеОписание = СтрШаблон(ДополнительноеТекстовоеОписание, ДлинаТипаПараметра);
	КонецЕсли;
	
	// Если исходное текстовое описание параметра не пустое, то добавляем запятую.
	ТекстовоеОписаниеПараметра = СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра;
	Если НЕ ПустаяСтрока(ТекстовоеОписаниеПараметра) Тогда
		// Если текстовое описание параметра расположено в той же строке, то добавляем пробел.
		// Если на следующей строке, то перенос.
		ДополнительноеТекстовоеОписание = ДополнительноеТекстовоеОписание + ","
			+ ?(СтрокаОписанияПараметра.ПозицияТекстовогоОписанияПараметра = 0, Символы.ПС, " ");
	КонецЕсли;
	
	// Переопределяем полное описание параметра.
	ПолноеОписаниеПараметра = СтрокаОписанияПараметра.ПолноеОписаниеПараметра;
	ПолноеОписаниеПараметраДоТипаПараметра = Лев(ПолноеОписаниеПараметра, ПозицияТипаПараметра - 1);
	
	ПолноеОписаниеПараметра = ПолноеОписаниеПараметраДоТипаПараметра + ТипПараметраБезДлины + " - "
		+ ДополнительноеТекстовоеОписание + ТекстовоеОписаниеПараметра;
	
	ПерваяСтрокаПолногоОписанияПараметра = СтрПолучитьСтроку(ПолноеОписаниеПараметра, 1);
	
	// Переопределяем остальные колонки строки описания параметра.
	ПереопределитьОписаниеПараметра(СтрокаОписанияПараметра, ПерваяСтрокаПолногоОписанияПараметра);
	
КонецПроцедуры

Процедура ДобавитьПробелПослеТекстаГиперссылкиСмВТекстовоеОписаниеПараметра(СтрокаОписанияПараметра)
	
	// Если текстовое описание параметра не заполнено, то выходим.
	ТекстовоеОписаниеПараметра = СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра;
	Если ПустаяСтрока(ТекстовоеОписаниеПараметра) Тогда
		Возврат;
	КонецЕсли;
	
	МассивТекстСм = Контекст["МассивТекстСм"];
	РезультатПоискаТекстаСм = СтрНачинаетсяСПоМассиву(ВРег(СокрЛ(ТекстовоеОписаниеПараметра)), МассивТекстСм);
	Если НЕ РезультатПоискаТекстаСм.Успешно Тогда
		// Если текстовое описание не начинается с текста гиперссылки "см.", то выходим.
		Возврат;
	КонецЕсли;
	
	// Если в текстовом описании уже есть текст "см." / "see" с пробелом, выходим.
	ТекстГиперссылкиСм = РезультатПоискаТекстаСм.НайденныйЭлемент;
	Если СтрНайти(ТекстГиперссылкиСм, " ") > 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Добавим пробел после литерала с учетом найденного текста гиперссылки "см.".
	ИсходноеТекстовоеОписаниеЛев = Лев(ТекстовоеОписаниеПараметра, СтрДлина(ТекстГиперссылкиСм));
	ИсходноеТекстовоеОписаниеПрав = Прав(ТекстовоеОписаниеПараметра, СтрДлина(ТекстовоеОписаниеПараметра) - СтрДлина(ТекстГиперссылкиСм));
	ИсходноеТекстовоеОписаниеПрав = СокрЛ(ИсходноеТекстовоеОписаниеПрав);
	
	// Если весь текст после гиперссылки "см." находится на следующей строке, то пробел не нужен, выходим.
	Если СтрНачинаетсяС(ИсходноеТекстовоеОписаниеПрав, "//") Тогда
		Возврат;
	КонецЕсли;
	
	НовоеТекстовоеОписание = ИсходноеТекстовоеОписаниеЛев + " " + ИсходноеТекстовоеОписаниеПрав;
	
	// Изменяем данные описания параметра.
	СтрокаОписанияПараметра.ТекстовоеОписаниеПараметра = НовоеТекстовоеОписание;
	СтрокаОписанияПараметра.ПолноеОписаниеПараметра = СтрЗаменить(СтрокаОписанияПараметра.ПолноеОписаниеПараметра, ТекстовоеОписаниеПараметра, НовоеТекстовоеОписание);
	СтрокаОписанияПараметра.СостояниеПараметра = "Изменен";
	
КонецПроцедуры

// Исправляет описание (комментарии) процедур и функций:
// - Удаляет комментарии после "КонецПроцедуры" и "КонецФункции" в той же строке.
// - Вставляет строку с пустым комментарием между комментарием и началом процедуры или функции.
// - Удаляет лишние символы из описания параметра, например, "- ,", ", -" или " - - ".
// - Удаляет лишний текст "обязательный" и "необязательный" из описания параметра.
// - Приводит см-описания параметров к стандарту "см. <Модуль.Функция>".
// - Определяет тип параметра из имени параметра, если он оформлен в скобках.
// - Определяет тип параметра в начале текстового описания параметра, если он не выделен явно.
// - Заменяет неправильное описание типа параметра на соответствующее языку платформы.
// - Заменяет тип параметра "Соответствие" на "Соответствие из КлючИЗначение",
//   если далее описаны свойства "Ключ" и "Значение".
// - Заменяет символы табуляции на пробелы в строке комментария перед описанием параметра: 1 таб на 2 пробела.
// - Выравнивает отступы типа параметра относительно предыдущего после замены табов на пробелы.
// - Разделяет множественный тип параметра (несколько типов через запятую) по отдельным строкам.
// - Удаляет незначащее текстовое описание параметра для структур, таблиц значений и деревьев значений.
// - Заменяет первую заглавную букву текстового описания параметра на строчную.
// - Удаляет лишний дефис в конце строки с описанием параметра.
// - Добавляет двоеточие в конце текстового описания параметра перед описанием свойств (колонок) составных типов.
// - Исправляет неправильное описание секции "Возвращаемое значение".
// - Добавляет дополнительный отступ в 2 пробела для параметров и свойств параметров,
//   являющихся описанием возвращаемого значения.
// - Удаляет лишние символы звездочек в начале параметров и типов описания возвращаемого значения.
// - Выносит длину типа параметра в текстовое описание, если в типе параметра указана длина строки или числа в скобках.
//
Функция ИсправитьОписаниеПроцедурИФункций(ДокументТекст, ЭтоПервыйЗапуск = Истина)
	
	ФайлИзменен = Ложь;
	
	КоличествоСтрок = ДокументТекст.КоличествоСтрок();
	Если КоличествоСтрок = 0 Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	ТекстМодуля = ДокументТекст.ПолучитьТекст();
	Если ПустаяСтрока(ТекстМодуля) Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	ТаблицаМетодовМодуля = ПолучитьТаблицуПроцедурИФункций(ТекстМодуля);
	КоличествоМетодов = ТаблицаМетодовМодуля.Количество();
	Если КоличествоМетодов = 0 Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	НеобходимоПовторноеФорматирование = Ложь;
	
	НомерПоследнегоМетода = КоличествоМетодов - 1;
	Для НомерМетодаМодуля = 0 По НомерПоследнегоМетода Цикл
		
		СтрокаТаблицыМетодовМодуля = ТаблицаМетодовМодуля[НомерПоследнегоМетода - НомерМетодаМодуля];
		
		// Удаляем комментарий после конструкций "КонецПроцедуры" и "КонецФункции".
		НомерСтрокиКонцаМетода = СтрокаТаблицыМетодовМодуля.НомерСтрокиКонцаМетода;
		СтрокаМодуляИсходная = ДокументТекст.ПолучитьСтроку(НомерСтрокиКонцаМетода);
		СтрокаМодуляРезультат = УдалитьКомментарийПослеКонецПроцедурыФункции(СтрокаМодуляИсходная);
		Если СтрокаМодуляРезультат <> СтрокаМодуляИсходная Тогда
			ДокументТекст.ЗаменитьСтроку(НомерСтрокиКонцаМетода, СтрокаМодуляРезультат);
			ФайлИзменен = Истина;
		КонецЕсли;
		
		ТекстКомментарияМетода = СтрокаТаблицыМетодовМодуля.ТекстКомментарияМетода;
		
		НомерСтрокиНачалаКомментарияМетода = СтрокаТаблицыМетодовМодуля.НомерСтрокиНачалаКомментарияМетода;
		НомерСтрокиКонцаКомментарияМетода  = СтрокаТаблицыМетодовМодуля.НомерСтрокиКонцаКомментарияМетода;
		
		// Для комментариев перед процедурами и функциями, начинающихся с корректной гиперссылки,
		// получаем только строку с гиперссылкой и служебные комментарии.
		НовыйТекстКомментарияМетода = ОчиститьКомментарийПередМетодомСодержащийГиперссылку(СтрокаТаблицыМетодовМодуля);
		Если НЕ ПустаяСтрока(НовыйТекстКомментарияМетода) Тогда
			
			// Если получили новый комментарий для процедуры (функции), то проверяем, изменился ли он.
			Если НовыйТекстКомментарияМетода <> ТекстКомментарияМетода Тогда
				
				// Если изменился, то заменяем его. Удаляем все строки комментария.
				Для НомерСтроки = НомерСтрокиНачалаКомментарияМетода По НомерСтрокиКонцаКомментарияМетода Цикл
					ДокументТекст.УдалитьСтроку(НомерСтрокиНачалаКомментарияМетода);
				КонецЦикла;
				
				// Вставляем новый комментарий построчно.
				КоличествоСтрокНовогоКомментарияМетода = СтрЧислоСтрок(НовыйТекстКомментарияМетода);
				Для НомерСтрокиКомментарияМетода = 1 По КоличествоСтрокНовогоКомментарияМетода Цикл
					СтрокаНовогоКомментарияМетода = СтрПолучитьСтроку(НовыйТекстКомментарияМетода, НомерСтрокиКомментарияМетода);
					ДокументТекст.ВставитьСтроку(НомерСтрокиНачалаКомментарияМетода + НомерСтрокиКомментарияМетода - 1, СтрокаНовогоКомментарияМетода);
				КонецЦикла;
				
				// Устанавливаем флаг, что файл с текстом модуля изменен.
				ФайлИзменен = Истина;
				
			КонецЕсли;
			
			// В любом случае, параметры и возвращаемое значение проверять не требуется, пропускаем.
			Продолжить;
			
		КонецЕсли;
		
		// Вставляем пустой комментарий перед началом процедуры и функции.
		Если ВставитьПустойКомментарийПередНачаломПроцедурыФункции(ТекстКомментарияМетода) Тогда
			ДокументТекст.ВставитьСтроку(НомерСтрокиКонцаКомментарияМетода + 1, "//");
			ФайлИзменен = Истина;
		КонецЕсли;
		
		Контекст.Вставить("ТекущийОбрабатываемыйМетод", СтрокаТаблицыМетодовМодуля);
		
		ТаблицаОписанияПараметровИсходная = ПолучитьТаблицуОписанияПараметровМетода(ТекстКомментарияМетода);
		ТаблицаОписанияПараметровИзмененная = ТаблицаОписанияПараметровИсходная.Скопировать();
		
		// Вводим дополнительные переменные.
		СекцияОписанияПараметраРодителя = "";
		ТекстовоеОписаниеПараметраРодителяЯвляетсяГиперссылкой = Ложь;
		УровеньВложенностиПараметраРодителя = 0;
		
		// Обрабатываем параметры в таблице описания параметров.
		Для Каждого СтрокаТаблицыОписанияПараметров Из ТаблицаОписанияПараметровИзмененная Цикл
			
			СекцияОписанияТекущегоПараметра = СтрокаТаблицыОписанияПараметров.СекцияОписания;
			УровеньВложенностиТекущегоПараметра = СтрокаТаблицыОписанияПараметров.УровеньВложенностиПараметра;
			
			// Для параметров-родителей, текстовое описание которых является гиперссылкой,
			// не обрабатываем подчиненные параметры или свойства с уровнем вложенности больше текущего параметра,
			// т.к. их необходимо удалить.
			Если ТекстовоеОписаниеПараметраРодителяЯвляетсяГиперссылкой
				И (СекцияОписанияТекущегоПараметра = СекцияОписанияПараметраРодителя)
				И (УровеньВложенностиТекущегоПараметра > УровеньВложенностиПараметраРодителя) Тогда
				
				СтрокаТаблицыОписанияПараметров.СостояниеПараметра = "Удален";
				Продолжить;
			КонецЕсли;
			
			// Удаляем лишние (мусорные) символы внутри описания параметра, например, "- ,".
			УдалитьЛишниеСимволыИзОписанияПараметра(СтрокаТаблицыОписанияПараметров);
			
			// Удаляем текст "обязательный" и "необязательный" из описания параметра.
			УдалитьТекстОбязательныйНеобязательныйИзОписанияПараметра(СтрокаТаблицыОписанияПараметров);
			
			// Переопределяем текстовое описание параметра в виде гиперссылки на объект, метод или параметр при ее наличии.
			УстановитьТекстГиперссылкиВОписаниеПараметра(СтрокаТаблицыОписанияПараметров);
			ТекстОшибки = СтрокаТаблицыОписанияПараметров.ТекстОшибки;
			Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
				НомерСтрокиНачалаОписанияПараметраВКомментарии = СтрокаТаблицыОписанияПараметров.НомерСтрокиНачалаОписанияПараметра;
				НомерСтрокиНачалаОписанияПараметраВМодуле = НомерСтрокиНачалаКомментарияМетода + НомерСтрокиНачалаОписанияПараметраВКомментарии - 1;
				ОбработатьИсключение(Контекст["ТекущийОбрабатываемыйФайл"], ТекстОшибки, НомерСтрокиНачалаОписанияПараметраВМодуле);
			КонецЕсли;
			
			// Иногда тип параметра указан в скобках после имени параметра, тогда он определяется как имя параметра.
			// Пытаемся выделить тип из имени параметра.
			УстановитьТипПараметраИзИмениПараметра(СтрокаТаблицыОписанияПараметров);
			
			// Пытаемся определить тип параметра из текстового описания, если он изначально не заполнен верно.
			УстановитьТипПараметраИзТекстовогоОписанияПараметра(СтрокаТаблицыОписанияПараметров);
			
			// Заменяем некорректно написанный тип параметра на соответствующий языку платформы.
			ЗаменитьНеправильноеОписаниеТипаПараметра(СтрокаТаблицыОписанияПараметров);
			
			// Заменяем тип параметра "Соответствие" на "Соответствие из КлючИЗначение".
			ЗаменитьОписаниеТипаПараметраСоответствие(СтрокаТаблицыОписанияПараметров);
			
			// Заменяем символы табуляции на пробелы перед описанием параметра: 1 таб на 2 пробела.
			ЗаменитьТабыНаПробелыПередОписаниемПараметра(СтрокаТаблицыОписанияПараметров);
			
			// Выравниваем отступ типа параметра относительно предыдущего после замены табов на пробелы.
			ВыровнятьТипПараметраОтносительноПредыдущего(СтрокаТаблицыОписанияПараметров);
			
			// 20.11.2020: функционал по переносу типов по строкам отключен, т.к. работает не всегда корректно.
			// Переносим каждый тип параметра на новую строку.
			//РазделитьТипыПараметраПоСтрокам(СтрокаТаблицыОписанияПараметров);
			
			// Удаляем текстовое описание параметра, если оно является незначимым.
			УдалитьНезначащееТекстовоеОписаниеПараметра(СтрокаТаблицыОписанияПараметров);
			
			// Добавить пробел после текста гиперссылки "см.".
			ДобавитьПробелПослеТекстаГиперссылкиСмВТекстовоеОписаниеПараметра(СтрокаТаблицыОписанияПараметров);
			
			// Устанавливаем первую букву текстового описания параметра в нижний регистр.
			УстановитьПервыйСимволТекстовогоОписанияПараметраВНижнийРегистр(СтрокаТаблицыОписанияПараметров);
			
			// Удаляем лишний дефис в конце строки описания параметра.
			УдалитьДефисВКонцеСтрокиОписанияПараметра(СтрокаТаблицыОписанияПараметров);
			
			// Добавляем двоеточие перед описанием свойств или колонок составных типов.
			ДобавитьДвоеточиеВКонцеСтрокиОписанияПараметра(СтрокаТаблицыОписанияПараметров);
			
			// Если секция "Возвращаемое значение" оформлена неправильно, то приводим ее к правильному формату.
			ФорматироватьОписаниеСекцииВозвращаемоеЗначение(СтрокаТаблицыОписанияПараметров);
			
			// Если описание параметра возвращаемого значения оформлено в несколько строк,
			// то каждая следующая строка с таким же отступом является отдельным параметром.
			// Для таких строк параметров добавляем дополнительный отступ в 2 пробела.
			ДобавитьДополнительныйОтступДляПараметраОписанияВозвращаемогоЗначения(СтрокаТаблицыОписанияПараметров);
			
			// Если параметр является свойством параметра описания возвращаемого значения
			// и его отступ равен отступу параметра описания возвращаемого значения,
			// то добавляем дополнительный отступ в 2 пробела.
			ДобавитьДополнительныйОтступДляСвойстваПараметраОписанияВозвращаемогоЗначения(СтрокаТаблицыОписанияПараметров);
			
			// У параметров описания возвращаемого значения, начинающихся со звездочки, удаляем все символы "*".
			УдалитьЗвездочкуВПараметреОписанияВозвращаемогоЗначения(СтрокаТаблицыОписанияПараметров);
			
			// Если в типе параметра указана длина строки или числа в скобках,
			// то выносим эту длину в текстовое описание параметра.
			ЗаменитьОписаниеТипаПараметраСДлинойСтрокиИЧисла(СтрокаТаблицыОписанияПараметров);
			
			// Запоминаем значение дополнительных переменных для проверки следующего параметра.
			СекцияОписанияПараметраРодителя = СекцияОписанияТекущегоПараметра;
			УровеньВложенностиПараметраРодителя = УровеньВложенностиТекущегоПараметра;
			ТекстовоеОписаниеПараметраРодителяЯвляетсяГиперссылкой = СтрокаТаблицыОписанияПараметров.ТекстовоеОписаниеПараметраЯвляетсяГиперссылкой;
			
			Если СтрокаТаблицыОписанияПараметров.НеобходимоПовторноеФорматирование Тогда
				НеобходимоПовторноеФорматирование = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		// Изменяем описание параметров в тексте модуля.
		НомерПоследнегоПараметра = ТаблицаОписанияПараметровИзмененная.Количество() - 1;
		Для НомерПараметра = 0 По НомерПоследнегоПараметра Цикл
			
			// Обрабатываем описание параметров в тексте модуля снизу вверх.
			НомерПараметраСКонцаТаблицыОписанияПараметров = НомерПоследнегоПараметра - НомерПараметра;
			СтрокаТаблицыОписанияПараметровИзмененная = ТаблицаОписанияПараметровИзмененная[НомерПараметраСКонцаТаблицыОписанияПараметров];
			
			Если СтрокаТаблицыОписанияПараметровИзмененная.СостояниеПараметра = "Исходный" Тогда
				Продолжить;
			КонецЕсли;
			
			ФайлИзменен = Истина;
			
			СтрокаТаблицыОписанияПараметровИсходная = ТаблицаОписанияПараметровИсходная[НомерПараметраСКонцаТаблицыОписанияПараметров];
			
			// Заменяем описание параметра в исходном текстовом документе из измененной таблицы описания параметров.
			НомерСтрокиНачалаОписанияПараметраВКомментарии = СтрокаТаблицыОписанияПараметровИсходная.НомерСтрокиНачалаОписанияПараметра;
			НомерСтрокиНачалаОписанияПараметраВМодулеИсходный = НомерСтрокиНачалаКомментарияМетода + НомерСтрокиНачалаОписанияПараметраВКомментарии - 1;
			
			НомерСтрокиКонцаОписанияПараметраВКомментарии = СтрокаТаблицыОписанияПараметровИсходная.НомерСтрокиКонцаОписанияПараметра;
			НомерСтрокиКонцаОписанияПараметраВМодулеИсходный = НомерСтрокиНачалаКомментарияМетода + НомерСтрокиКонцаОписанияПараметраВКомментарии - 1;
			
			// Сначала удаляем исходный текст.
			Для НомерСтроки = НомерСтрокиНачалаОписанияПараметраВМодулеИсходный По НомерСтрокиКонцаОписанияПараметраВМодулеИсходный Цикл
				ДокументТекст.УдалитьСтроку(НомерСтрокиНачалаОписанияПараметраВМодулеИсходный);
			КонецЦикла;
			
			// Если параметр был изменен, то вставляем измененные строки.
			Если СтрокаТаблицыОписанияПараметровИзмененная.СостояниеПараметра = "Изменен" Тогда
				
				НомерСтрокиНачалаОписанияПараметраВКомментарии = СтрокаТаблицыОписанияПараметровИзмененная.НомерСтрокиНачалаОписанияПараметра;
				НомерСтрокиНачалаОписанияПараметраВМодулеИзмененный = НомерСтрокиНачалаКомментарияМетода + НомерСтрокиНачалаОписанияПараметраВКомментарии - 1;
				
				НомерСтрокиКонцаОписанияПараметраВКомментарии = СтрокаТаблицыОписанияПараметровИзмененная.НомерСтрокиКонцаОписанияПараметра;
				НомерСтрокиКонцаОписанияПараметраВМодулеИзмененный = НомерСтрокиНачалаКомментарияМетода + НомерСтрокиКонцаОписанияПараметраВКомментарии - 1;
				
				ПолноеОписаниеПараметра = СтрокаТаблицыОписанияПараметровИзмененная.ПолноеОписаниеПараметра;
				
				Для НомерСтроки = НомерСтрокиНачалаОписанияПараметраВМодулеИзмененный По НомерСтрокиКонцаОписанияПараметраВМодулеИзмененный Цикл
					СтрокаПолногоОписанияПараметра = СтрПолучитьСтроку(ПолноеОписаниеПараметра, НомерСтроки - НомерСтрокиНачалаОписанияПараметраВМодулеИзмененный + 1);
					ДокументТекст.ВставитьСтроку(НомерСтроки, СтрокаПолногоОписанияПараметра);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Если необходим повторный запуск форматирования описаний процедур и функций, то перезапустим.
	Если НеобходимоПовторноеФорматирование И ЭтоПервыйЗапуск Тогда
		ИсправитьОписаниеПроцедурИФункций(ДокументТекст, Ложь);
	КонецЕсли;
	
	Возврат ФайлИзменен;
	
КонецФункции

Функция ЗаменитьДвойнойСимволТочкаСЗапятойНаОдинарный(ДокументТекст)
	
	ФайлИзменен = Ложь;
	
	КоличествоСтрок = ДокументТекст.КоличествоСтрок();
	Если КоличествоСтрок = 0 Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	ТекстМодуля = ДокументТекст.ПолучитьТекст();
	Если ПустаяСтрока(ТекстМодуля) Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	ТекстПоиска = ";;";
	ТекстЗамены = ";";
	
	ДлинаТекстаПоиска = СтрДлина(ТекстПоиска);
	
	ПозицияПоискаВМодуле = 0;
	Пока Истина Цикл
		
		ПозицияПоискаВМодуле = СтрНайти(ТекстМодуля, ТекстПоиска,, ПозицияПоискаВМодуле + 1);
		Если ПозицияПоискаВМодуле = 0 Тогда
			Прервать;
		КонецЕсли;
		
		ТекстМодуляДоТекстаПоиска = Лев(ТекстМодуля, ПозицияПоискаВМодуле - 1);
		
		СтрокаМодуля = ПолучитьПоследнююСтрокуМодуля(ТекстМодуляДоТекстаПоиска);
		Если СтрокаОткрыта(СтрокаМодуля) Тогда
			// Если двойной символ ";;" находится в кавычках, то пропускаем.
			Продолжить;
		КонецЕсли;
		
		СтрокаМодуляБезКомментария = УдалитьКомментарийИзСтроки(СтрокаМодуля);
		Если СтрокаМодуля <> СтрокаМодуляБезКомментария Тогда
			// Если после удаления комментария строка изменилась, значит, двойной символ ";;" находится в комментарии, пропускаем.
			Продолжить;
		КонецЕсли;
		
		ТекстМодуляПослеТекстаПоиска = Сред(ТекстМодуля, ПозицияПоискаВМодуле + ДлинаТекстаПоиска);
		ТекстМодуля = ТекстМодуляДоТекстаПоиска + ТекстЗамены + ТекстМодуляПослеТекстаПоиска;
		
		ФайлИзменен = Истина;
		
	КонецЦикла;
	
	Если ФайлИзменен Тогда
		ДокументТекст.УстановитьТекст(ТекстМодуля);
	КонецЕсли;
	
	Возврат ФайлИзменен;
	
КонецФункции

Функция СтрокаОткрыта(Знач СтрокаМодуля)
	
	Если СтрЧислоСтрок(СтрокаМодуля) > 1 Тогда
		СтрокаМодуля = ПолучитьПоследнююСтрокуМодуля(СтрокаМодуля);
	КонецЕсли;
	
	КоличествоКавычек = СтрЧислоВхождений(СтрокаМодуля, """");
	КоличествоКавычекЧетное = (КоличествоКавычек % 2 = 0);
	
	Возврат ?(СтрНачинаетсяС(СокрЛ(СтрокаМодуля), "|"), КоличествоКавычекЧетное, НЕ КоличествоКавычекЧетное);
	
КонецФункции

Функция ПолучитьПоследнююСтрокуМодуля(Знач ТекстМодуля)
	
	ДокументТекст = Новый ТекстовыйДокумент;
	ДокументТекст.УстановитьТекст(ТекстМодуля);
	
	НомерПоследнейСтроки = ДокументТекст.КоличествоСтрок();
	Возврат ДокументТекст.ПолучитьСтроку(НомерПоследнейСтроки);
	
КонецФункции

#КонецОбласти

#Область ЛокализацияДинамическихСписков

Функция УдалитьКомментарийИзСтроки(Знач СтрокаМодуля)
	
	Если ПустаяСтрока(СтрокаМодуля) Тогда
		Возврат СтрокаМодуля;
	КонецЕсли;
	
	ПозицияКомментария = СтрНайти(СтрокаМодуля, "//");
	Если ПозицияКомментария = 0 Тогда
		Возврат СтрокаМодуля;
	КонецЕсли;
	
	// Например, URLСтрока = "http://downloads.v8.1c.ru/tmplts/ITS/KLADR/"; - не проверяем на комментарий.
	СтрокаМодуля = СтрЗаменить(СтрокаМодуля, "://", "<<ВНЕШНЕЕСОЕДИНЕНИЕ>>");
	ПозицияКомментария = СтрНайти(СтрокаМодуля, "//");
	
	// Есть комментарий.
	Если ПозицияКомментария > 0 Тогда
		ПозицияКавычек = СтрНайти(СтрокаМодуля, """");
		СтрокаОткрыта = СтрНачинаетсяС(СокрЛ(СтрокаМодуля), "|");
		
		// Нет кавычек, удаляем комментарий.
		Если ПозицияКавычек = 0 Тогда
			СтрокаМодуля = Лев(СтрокаМодуля, ПозицияКомментария - 1);
			
		// Знак комментария в открытой строке, например:
		// |//////////////////";
		ИначеЕсли СтрокаОткрыта И ПозицияКавычек > 0 Тогда
			ПозицияКомментария = СтрНайти(СтрокаМодуля, "//",, ПозицияКавычек);
			Если ПозицияКомментария > 0 Тогда
				СтрокаМодуля = Лев(СтрокаМодуля, ПозицияКомментария - 1);
			КонецЕсли;
			
		// Строка не открыта, кавычки после комментария, удаляем комментарий.
		ИначеЕсли ПозицияКавычек > ПозицияКомментария Тогда
			СтрокаМодуля = Лев(СтрокаМодуля, ПозицияКомментария - 1);
			
		Иначе
			КоличествоКавычекДоКомментария = СтрЧислоВхождений(Лев(СтрокаМодуля, ПозицияКомментария), """");
			// Строка открывается и закрывается до комментария, удаляем комментарий.
			Если КоличествоКавычекДоКомментария % 2 = 0 Тогда
				СтрокаМодуля = Лев(СтрокаМодуля, ПозицияКомментария - 1);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтрЗаменить(СтрокаМодуля, "<<ВНЕШНЕЕСОЕДИНЕНИЕ>>", "://");;
	
КонецФункции

Функция ПолучитьТекстМодуляБезКомментариев(ТекстМодуля)
	
	РазборТекста = Новый ТекстовыйДокумент;
	РазборТекста.УстановитьТекст(ТекстМодуля);
	
	КоличествоСтрок = РазборТекста.КоличествоСтрок();
	
	Для Счетчик = 1 По КоличествоСтрок Цикл
		СтрокаМодуля = РазборТекста.ПолучитьСтроку(Счетчик);
		СтрокаМодуля = УдалитьКомментарийИзСтроки(СтрокаМодуля);
		РазборТекста.ЗаменитьСтроку(Счетчик, СтрокаМодуля);
	КонецЦикла;
	
	Возврат РазборТекста.ПолучитьТекст();
	
КонецФункции

Функция ПолучитьПсевдонимыРазыменованныхПолейТекстаЗапроса(Знач ТекстЗапроса)
	
	МассивРазыменованныхПолей = Новый Массив;
	
	МассивТекстВыбрать = Новый Массив;
	МассивТекстВыбрать.Добавить(" ВЫБРАТЬ ");
	МассивТекстВыбрать.Добавить(" SELECT ");
	
	МассивТекстИз = Новый Массив;
	МассивТекстИз.Добавить(" ИЗ ");
	МассивТекстИз.Добавить(" FROM ");
	
	МассивТекстКак = Новый Массив;
	МассивТекстКак.Добавить(" КАК ");
	МассивТекстКак.Добавить(" AS ");
	
	СтрокаОператоровЗапроса = "РАЗРЕШЕННЫЕ , РАЗЛИЧНЫЕ , КАК СТРОКА(, ALLOWED , DISTINCT , AS STRING(";
	МассивОператоровЗапроса = СтрРазделить(СтрокаОператоровЗапроса, ",");
	
	ТекстЗапросаВРег = ВРег(ТекстЗапроса);
	ТекстЗапросаВРег = СтрЗаменить(ТекстЗапросаВРег, Символы.ПС, " ");
	ТекстЗапросаВРег = СтрЗаменить(ТекстЗапросаВРег, Символы.Таб, " ");
	ТекстЗапросаВРег = СтрЗаменить(ТекстЗапросаВРег, "(", " ");
	ТекстЗапросаВРег = СтрЗаменить(ТекстЗапросаВРег, ")", " ");
	ТекстЗапросаВРег = СтрЗаменить(ТекстЗапросаВРег, "{", " ");
	ТекстЗапросаВРег = СтрЗаменить(ТекстЗапросаВРег, "}", " ");
	
	ТекстЗапросаВРег = " " + ТекстЗапросаВРег; // чтобы найти первый оператор "ВЫБРАТЬ".
	
	ПозицияВыбрать = 0;
	ПозицияИз = 0;
	Пока Истина Цикл
		
		РезультатПоиска = СтрНайтиПоМассиву(ТекстЗапросаВРег, МассивТекстВыбрать,, ПозицияВыбрать + 1, Истина);
		Если НЕ РезультатПоиска.Успешно Тогда
			Прервать;
		КонецЕсли;
		
		ПозицияВыбрать = РезультатПоиска.Позиция;
		
		РезультатПоискаТекстИз = СтрНайтиПоМассиву(ТекстЗапросаВРег, МассивТекстИз,, ПозицияВыбрать + 1, Истина);
		Если НЕ РезультатПоискаТекстИз.Успешно Тогда
			ПозицияИз = СтрДлина(ТекстЗапросаВРег);
		КонецЕсли;
		
		ПозицияИз = РезультатПоискаТекстИз.Позиция;
		СтрДлинаТекстВыбрать = СтрДлина(РезультатПоиска.НайденныйЭлемент);
		
		ПозицияВыбранныхПолей = ПозицияВыбрать + СтрДлинаТекстВыбрать - 1; // т.к. добавили лишний пробел в запрос.
		ТекстВыбранныхПолей = Сред(ТекстЗапроса, ПозицияВыбранныхПолей, ПозицияИз - ПозицияВыбранныхПолей);
		
		// Убираем табы, переносы и некоторые операторы запроса.
		ТекстВыбранныхПолей = СтрЗаменить(ТекстВыбранныхПолей, Символы.ПС, " ");
		ТекстВыбранныхПолей = СтрЗаменить(ТекстВыбранныхПолей, Символы.Таб, " ");
		Для Каждого ОператорЗапроса Из МассивОператоровЗапроса Цикл
			ТекстВыбранныхПолей = СтрЗаменить(ТекстВыбранныхПолей, ОператорЗапроса, " ");
		КонецЦикла;
		
		ТекстВыбранныхПолей = СокрЛП(ТекстВыбранныхПолей);
		
		МассивВыбранныхПолей = СтрРазделить(ТекстВыбранныхПолей, ",");
		Для Каждого ВыбранноеПоле Из МассивВыбранныхПолей Цикл
			
			// Проверяем, что указан псевдоним поля.
			РезультатПоискаТекстКак = СтрНайтиПоМассиву(ВРег(ВыбранноеПоле), МассивТекстКак,,, Истина);
			Если НЕ РезультатПоискаТекстКак.Успешно Тогда
				Продолжить;
			КонецЕсли;
			
			ПозицияКак = РезультатПоискаТекстКак.Позиция;
			СтрДлинаТекстКак = СтрДлина(РезультатПоискаТекстКак.НайденныйЭлемент);
			
			// Получаем псевдоним поля.
			ПсевдонимПоля = Сред(ВыбранноеПоле, ПозицияКак + СтрДлинаТекстКак);
			ПсевдонимПоля = СокрЛП(ПсевдонимПоля);
			
			// Если псевдоним совпадает с именем выбираемого поля, то пропускаем, т.к. поле не разыменовано.
			// Платформа при пустом заголовке колонки таблицы на форме подставит необходимое имя из синонима реквизита (поля).
			ВыбранноеПолеДоПсевдонима = Лев(ВыбранноеПоле, ПозицияКак - 1);
			ВыбранноеПолеДоПсевдонима = СокрП(ВыбранноеПолеДоПсевдонима);
			Если СтрЗаканчиваетсяНа(ВРег(ВыбранноеПолеДоПсевдонима), "." + ВРег(ПсевдонимПоля)) Тогда
				Продолжить;
			КонецЕсли;
			
			Если МассивРазыменованныхПолей.Найти(ПсевдонимПоля) = Неопределено Тогда
				МассивРазыменованныхПолей.Добавить(ПсевдонимПоля);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат МассивРазыменованныхПолей;
	
КонецФункции

#Область ЛокализацияДинамическихСписковXML

Функция ПолучитьТекстЗапросаРеквизитаДинамическийСписок(ДокументDOM, ЭлементDOMРеквизит)
	
	ВыражениеПолученияЗапроса = "xmlns:Settings/xmlns:QueryText";
	
	ТекстЗапроса = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath(ВыражениеПолученияЗапроса, ДокументDOM, ЭлементDOMРеквизит);
	Если ПустаяСтрока(ТекстЗапроса) Тогда
		Возврат "";
	КонецЕсли;
	
	Если СтрНайти(ТекстЗапроса, "//") > 0 Тогда
		ТекстЗапроса = ПолучитьТекстМодуляБезКомментариев(ТекстЗапроса);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Заполняет заголовки колонок таблицы формы, связанной с реквизитом формы типа "ДинамическийСписок".
// Заголовки заполняются путем преобразования наименования колонки (добавляются пробелы
// и первые буквы слов переводятся в нижний регистр).
// Заполняются заголовки только тех колонок, которые связаны с составными полями запроса динамического списка.
// Поле считается НЕ составным, если оно выбирается по шаблону "Таблица.Поле1.Поле2...",
// все остальные поля считаются составными (комбинация других полей, "ВЫБОР...КОГДА...ТОГДА" и др.).
//
Функция ЗаполнитьЗаголовкиПолейДинамическогоСписка(ДокументDOM)
	
	ФормаИзменена = Ложь;
	
	ВыражениеПоискаПоТипуШаблон = "//xmlns:Attributes/xmlns:Attribute/xmlns:Type/v8:Type[text()='%1']";
	ВыражениеПоискаПоПутиКДаннымШаблон = "//xmlns:ChildItems/*/xmlns:DataPath[text()='%1']";
	
	МассивТиповДинамическийСписок = Новый Массив;
	МассивТиповДинамическийСписок.Добавить("cfg:DynamicList");
	МассивТиповДинамическийСписок.Добавить("dl:DynamicList");
	
	Для Каждого ТипДинамическийСписок Из МассивТиповДинамическийСписок Цикл
		
		ВыражениеПоискаПоТипу = СтрШаблон(ВыражениеПоискаПоТипуШаблон, ТипДинамическийСписок);
		РезультатXPath = ВычислитьВыражениеXPath(ВыражениеПоискаПоТипу, ДокументDOM);
		Пока Истина Цикл
			
			ЭлементDOMv8Type = РезультатXPath.ПолучитьСледующий();
			Если ЭлементDOMv8Type = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
			ЭлементDOMType = ЭлементDOMv8Type.РодительскийУзел;
			Если ЭлементDOMType = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ЭлементDOMРеквизит = ЭлементDOMType.РодительскийУзел;
			Если ЭлементDOMРеквизит = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяРеквизита = ПолучитьИмяЭлемента(ДокументDOM, ЭлементDOMРеквизит);
			Если ПустаяСтрока(ИмяРеквизита) Тогда
				Продолжить;
			КонецЕсли;
			
			// Получаем текст запроса динамического списка.
			ТекстЗапроса = ПолучитьТекстЗапросаРеквизитаДинамическийСписок(ДокументDOM, ЭлементDOMРеквизит);
			Если ПустаяСтрока(ТекстЗапроса) Тогда
				// Пропускаем динамический список с пустым запросом.
				Продолжить;
			КонецЕсли;
			
			МассивРазыменованныхПолей = ПолучитьПсевдонимыРазыменованныхПолейТекстаЗапроса(ТекстЗапроса);
			Если МассивРазыменованныхПолей.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого РазыменованноеПоле Из МассивРазыменованныхПолей Цикл
				
				// Наименование колонки таблицы будет состоять из имени реквизита и псевдонима.
				ПутьКДанным = ИмяРеквизита + "." + РазыменованноеПоле;
				
				// Ищем по пути к данным псевдоним поля в колонках таблицы, связанной с реквизитом динамического списка.
				ВыражениеПоискаПоПутиКДанным = СтрШаблон(ВыражениеПоискаПоПутиКДаннымШаблон, ПутьКДанным);
				РезультатПоискаПоПутиКДанным = ВычислитьВыражениеXPath(ВыражениеПоискаПоПутиКДанным, ДокументDOM);
				Пока Истина Цикл
					
					ЭлементDOMПутьКДанным = РезультатПоискаПоПутиКДанным.ПолучитьСледующий();
					Если ЭлементDOMПутьКДанным = Неопределено Тогда
						Прервать;
					КонецЕсли;
					
					ЭлементDOMПоле = ЭлементDOMПутьКДанным.РодительскийУзел;
					Если ЭлементDOMПоле = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					ЗаголовокПоля = ПолучитьЗаголовокЭлемента(ДокументDOM, ЭлементDOMПоле);
					Если НЕ ПустаяСтрока(ЗаголовокПоля) Тогда
						Продолжить;
					КонецЕсли;
					
					ИмяПоля = ПолучитьИмяЭлемента(ДокументDOM, ЭлементDOMПоле);
					Если ПустаяСтрока(ИмяПоля) Тогда
						Продолжить;
					КонецЕсли;
					
					НовыйЗаголовокПоля = ПолучитьЗаголовокПоИмениЭлементаФормы(ИмяПоля);
					УстановитьЗаголовокЭлемента(ДокументDOM, ЭлементDOMПоле, НовыйЗаголовокПоля, КодОсновногоЯзыка);
					
					ФормаИзменена = Истина;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ФормаИзменена;
	
КонецФункции

#КонецОбласти

#Область ЛокализацияДинамическихСписковEDT

Функция ПолучитьТекстЗапросаРеквизитаДинамическийСписокEDT(ДокументDOM, ЭлементDOMРеквизит)
	
	ВыражениеПолученияЗапроса = "extInfo/queryText";
	
	ТекстЗапроса = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath(ВыражениеПолученияЗапроса, ДокументDOM, ЭлементDOMРеквизит);
	Если ПустаяСтрока(ТекстЗапроса) Тогда
		Возврат "";
	КонецЕсли;
	
	Если СтрНайти(ТекстЗапроса, "//") > 0 Тогда
		ТекстЗапроса = ПолучитьТекстМодуляБезКомментариев(ТекстЗапроса);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Заполняет заголовки колонок таблицы формы, связанной с реквизитом формы типа "ДинамическийСписок".
// Заголовки заполняются путем преобразования наименования колонки (добавляются пробелы
// и первые буквы слов переводятся в нижний регистр).
// Заполняются заголовки только тех колонок, которые связаны с составными полями запроса динамического списка.
// Поле считается НЕ составным, если оно выбирается по шаблону "Таблица.Поле1.Поле2...",
// все остальные поля считаются составными (комбинация других полей, "ВЫБОР...КОГДА...ТОГДА" и др.).
//
Функция ЗаполнитьЗаголовкиПолейДинамическогоСпискаEDT(ДокументDOM)
	
	ФормаИзменена = Ложь;
	
	ВыражениеПоискаПоТипу = "//attributes/valueType/types[text()='DynamicList']";
	ВыражениеПоискаПоПутиКДаннымШаблон = "//items/dataPath/paths/segments[text()='%1']";
	
	РезультатXPath = ВычислитьВыражениеXPath(ВыражениеПоискаПоТипу, ДокументDOM);
	Пока Истина Цикл
		
		ЭлементDOMv8Type = РезультатXPath.ПолучитьСледующий();
		Если ЭлементDOMv8Type = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		ЭлементDOMType = ЭлементDOMv8Type.РодительскийУзел;
		Если ЭлементDOMType = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементDOMРеквизит = ЭлементDOMType.РодительскийУзел;
		Если ЭлементDOMРеквизит = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяРеквизита = ПолучитьИмяЭлементаEDT(ДокументDOM, ЭлементDOMРеквизит);
		Если ПустаяСтрока(ИмяРеквизита) Тогда
			Продолжить;
		КонецЕсли;
		
		// Получаем текст запроса динамического списка.
		ТекстЗапроса = ПолучитьТекстЗапросаРеквизитаДинамическийСписокEDT(ДокументDOM, ЭлементDOMРеквизит);
		Если ПустаяСтрока(ТекстЗапроса) Тогда
			// Пропускаем динамический список с пустым запросом.
			Продолжить;
		КонецЕсли;
		
		МассивРазыменованныхПолей = ПолучитьПсевдонимыРазыменованныхПолейТекстаЗапроса(ТекстЗапроса);
		Если МассивРазыменованныхПолей.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого РазыменованноеПоле Из МассивРазыменованныхПолей Цикл
			
			// Наименование колонки таблицы будет состоять из имени реквизита и псевдонима.
			ПутьКДанным = ИмяРеквизита + "." + РазыменованноеПоле;
			
			// Ищем по пути к данным псевдоним поля в колонках таблицы, связанной с реквизитом динамического списка.
			ВыражениеПоискаПоПутиКДанным = СтрШаблон(ВыражениеПоискаПоПутиКДаннымШаблон, ПутьКДанным);
			РезультатПоискаПоПутиКДанным = ВычислитьВыражениеXPath(ВыражениеПоискаПоПутиКДанным, ДокументDOM);
			Пока Истина Цикл
				
				ЭлементDOMПутьКДанным = РезультатПоискаПоПутиКДанным.ПолучитьСледующий();
				Если ЭлементDOMПутьКДанным = Неопределено Тогда
					Прервать;
				КонецЕсли;
				
				ЭлементDOMdataPath = ЭлементDOMПутьКДанным.РодительскийУзел;
				Если ЭлементDOMdataPath = Неопределено Тогда
					Прервать;
				КонецЕсли;
				
				ЭлементDOMПоле = ЭлементDOMdataPath.РодительскийУзел;
				Если ЭлементDOMПоле = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ЗаголовокПоля = ПолучитьЗаголовокЭлементаEDT(ДокументDOM, ЭлементDOMПоле, КодОсновногоЯзыка);
				Если НЕ ПустаяСтрока(ЗаголовокПоля) Тогда
					Продолжить;
				КонецЕсли;
				
				ИмяПоля = ПолучитьИмяЭлементаEDT(ДокументDOM, ЭлементDOMПоле);
				Если ПустаяСтрока(ИмяПоля) Тогда
					Продолжить;
				КонецЕсли;
				
				НовыйЗаголовокПоля = ПолучитьЗаголовокПоИмениЭлементаФормы(ИмяПоля);
				УстановитьЗаголовокЭлементаEDT(ДокументDOM, ЭлементDOMПоле, НовыйЗаголовокПоля, КодОсновногоЯзыка);
				
				ФормаИзменена = Истина;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ФормаИзменена;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ЛокализацияСКД

Функция ЗаполнитьСинонимыДляВычисляемыхПолей(ДокументDOM, СтрокаПоискаПолейСКД)
	
	ФормаИзменена = Ложь;
	
	РезультатXPath = ВычислитьВыражениеXPath(СтрокаПоискаПолейСКД.ВыражениеПоискаПоТипу, ДокументDOM);
	Если РезультатXPath = Неопределено Тогда
		Возврат ФормаИзменена;
	КонецЕсли;
	
	Пока Истина Цикл
		
		ЭлементDOMv8Type = РезультатXPath.ПолучитьСледующий();
		Если ЭлементDOMv8Type = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		// Проверим наличие заголовка у элемента.
		Если СтрокаПоискаПолейСКД.ИспользоватьФорматированиеДляXML Тогда
			ЗаголовокРеквизита = ПолучитьЗаголовокПоляСКД(ДокументDOM, ЭлементDOMv8Type, СтрокаПоискаПолейСКД.ПрефиксТипа, КодОсновногоЯзыка);
		Иначе
			Если СтрокаПоискаПолейСКД.ФорматированиеПоляДляСКД Тогда
				ЗаголовокРеквизита = ПолучитьЗаголовокПоляСКД(ДокументDOM, ЭлементDOMv8Type, СтрокаПоискаПолейСКД.ПрефиксТипа, КодОсновногоЯзыка);
			Иначе
				ЗаголовокРеквизита = ПолучитьЗаголовокПоляДинамическогоСпискаEDT(ДокументDOM, ЭлементDOMv8Type, КодОсновногоЯзыка);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ЗаголовокРеквизита) Тогда
			// Если есть заголовок у реквизита, то нет необходимости его добавлять.
			Продолжить;
		КонецЕсли;
		
		// Получим имя реквизита.
		ПрефиксТипа = ?(СтрокаПоискаПолейСКД.ПрефиксТипа = "", "", СтрШаблон("%1:", СтрокаПоискаПолейСКД.ПрефиксТипа));
		ИмяРеквизита = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath(СтрШаблон("%1field", ПрефиксТипа), ДокументDOM, ЭлементDOMv8Type);
		Если ПустаяСтрока(ИмяРеквизита) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементDOMРеквизит = ЭлементDOMv8Type.РодительскийУзел;
		Если ЭлементDOMРеквизит = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстЗапроса = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath(СтрокаПоискаПолейСКД.УзелТекстаЗапроса, ДокументDOM, ЭлементDOMРеквизит);
		Если ПустаяСтрока(ТекстЗапроса) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрНайти(ТекстЗапроса, "//") > 0 Тогда
			ТекстЗапроса = ПолучитьТекстМодуляБезКомментариев(ТекстЗапроса);
		КонецЕсли;
		
		ТекстЗапроса = ПолучитьТекстЗапросаБезВложенныхТаблиц(ТекстЗапроса);
		МассивРазыменованныхПолей = ПолучитьПсевдонимыРазыменованныхПолейТекстаЗапроса(ТекстЗапроса);
		Если МассивРазыменованныхПолей.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Проверим, есть ли проверяемое поле в списке разыменованных полей.
		Если МассивРазыменованныхПолей.Найти(ИмяРеквизита) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Генерируем новый заголовок для элемента.
		ЗаголовокРеквизита = ПолучитьЗаголовокПоИмениЭлементаФормы(ИмяРеквизита);
		Если СтрокаПоискаПолейСКД.ИспользоватьФорматированиеДляXML Тогда
			УстановитьЗаголовокПоляСКД(ДокументDOM, ЭлементDOMv8Type, ЗаголовокРеквизита, СтрокаПоискаПолейСКД.ПрефиксТипа, КодОсновногоЯзыка);
		Иначе
			Если СтрокаПоискаПолейСКД.ФорматированиеПоляДляСКД Тогда
				УстановитьЗаголовокПоляСКД(ДокументDOM, ЭлементDOMv8Type, ЗаголовокРеквизита, СтрокаПоискаПолейСКД.ПрефиксТипа, КодОсновногоЯзыка);
			Иначе
				УстановитьЗаголовокПоляДинамическогоСпискаEDT(ДокументDOM, ЭлементDOMv8Type, ЗаголовокРеквизита, КодОсновногоЯзыка);
			КонецЕсли;
		КонецЕсли;
		
		ФормаИзменена = Истина;
		
	КонецЦикла;
	
	Возврат ФормаИзменена;
	
КонецФункции

Функция ПолучитьТекстЗапросаБезВложенныхТаблиц(Знач ТекстЗапроса)
	
	ТекстОткрытияВложеннойТаблицы = ".(";
	ТекстЗакрытияВложеннойТаблицы = ")";
	
	ПозицияОткрытияВложеннойТаблицы = 0;
	ПозицияЗакрытияВложеннойТаблицы = 0;
	Пока Истина Цикл
		
		ПозицияОткрытияВложеннойТаблицы = СтрНайти(ТекстЗапроса, ТекстОткрытияВложеннойТаблицы,, ПозицияОткрытияВложеннойТаблицы + 1);
		Если ПозицияОткрытияВложеннойТаблицы = 0 Тогда
			Прервать;
		КонецЕсли;
		
		ПозицияЗакрытияВложеннойТаблицы = СтрНайти(ТекстЗапроса, ТекстЗакрытияВложеннойТаблицы,, ПозицияОткрытияВложеннойТаблицы + 1);
		Если ПозицияЗакрытияВложеннойТаблицы = 0 Тогда
			ПозицияЗакрытияВложеннойТаблицы = СтрДлина(ТекстЗапроса);
		КонецЕсли;
		
		ТекстЗапросаДоВложеннойТаблицы = Лев(ТекстЗапроса, ПозицияОткрытияВложеннойТаблицы - 1);
		ТекстЗапросаПослеВложеннойТаблицы = Сред(ТекстЗапроса, ПозицияЗакрытияВложеннойТаблицы + 1);
		ТекстЗапроса = ТекстЗапросаДоВложеннойТаблицы + ТекстЗапросаПослеВложеннойТаблицы;
		
	КонецЦикла;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ЛокализацияЭлементовФорм

// Генерирует заголовок ЭФ из наименования по заглавным буквам.
// 
// Если в параметр "ЗаменитьАвтогенерируемыеЗаголовки" передано значение "Истина",
// то удаляются некоторые слова ("Группа", "Список" и т.д.), например:
//     СписокСотрудник - Сотрудник
//     ГруппаПодвал - Подвал
//     ГруппаОбластьОтображения - Область отображения
// 
// Исключения из удаления описаны в параметре ТаблицаИсключенийЗаголовковЭлементовФорм:
//     ГруппаПользовательскихНастроек -> Группа пользовательских настроек.
// 
// Если в параметр "ЗаменитьАвтогенерируемыеЗаголовки" передано значение "Ложь",
// то заголовок будет сгенерирован со словами "Группа", "Список" и т.д.
//     СписокСотрудник - Список сотрудник
//     ГруппаПодвал - Группа подвал
//     ГруппаОбластьОтображения - Группа область отображения
// 
// Для автоматически нумерованных групп, например, "Группа6", числовая нумерация будет удалена - вернется значение "Группа".
// 
// Учитывает случай аббревиатур и однобуквенных местоимений, например:
//     КодОКАТО -> Код ОКАТО;
//     ФНСРоссии -> ФНС России;
//     ЗаписатьИЗакрыть -> Записать и закрыть
// 
// Поддерживает частный случай, описанный в стандарте:
//     ГруппаШапка -> Шапка.
//
Функция ПолучитьЗаголовокПоИмениЭлементаФормы(Знач ИмяЭлементаФормы, ТаблицаИсключенийЗаголовковЭлементовФорм = Неопределено)
	
	Если ТаблицаИсключенийЗаголовковЭлементовФорм <> Неопределено Тогда
		СтрокаИсключения = ТаблицаИсключенийЗаголовковЭлементовФорм.Найти(ИмяЭлементаФормы, "Наименование");
		Если СтрокаИсключения <> Неопределено Тогда
			Возврат СтрокаИсключения.Заголовок;
		КонецЕсли;
	КонецЕсли;
	
	ИмяЭлементаФормы = СокрЛП(ИмяЭлементаФормы);
	ИмяЭлементаФормыИсходное = ИмяЭлементаФормы;
	
	Если СтрДлина(ИмяЭлементаФормы) <= 1 Тогда
		Возврат ИмяЭлементаФормы;
	КонецЕсли;
	
	МассивУдаляемыхСловИзЗаголовка = Новый Массив;
	МассивУдаляемыхСловИзЗаголовка.Добавить("Группа");
	МассивУдаляемыхСловИзЗаголовка.Добавить("Group");
	МассивУдаляемыхСловИзЗаголовка.Добавить("Список");
	МассивУдаляемыхСловИзЗаголовка.Добавить("List");
	
	СтруктураПоискаУдаляемыхСлов = СтрНачинаетсяСПоМассиву(ИмяЭлементаФормы, МассивУдаляемыхСловИзЗаголовка);
	Если СтруктураПоискаУдаляемыхСлов.Успешно Тогда
		
		// Имя элемента начинается со слова "Группа" или "Список".
		// Получаем имя элемента формы без найденного слова.
		НайденныйЭлемент = СтруктураПоискаУдаляемыхСлов.НайденныйЭлемент;
		ИмяЭлементаФормы = Сред(ИмяЭлементаФормы, СтрДлина(НайденныйЭлемент) + 1);
		
		// Заголовок состоит только из слова "Группа" или "Список".
		Если ПустаяСтрока(ИмяЭлементаФормы) Тогда
			Возврат ИмяЭлементаФормыИсходное;
		КонецЕсли;
		
		Если апк_ЭтоЧисло(ИмяЭлементаФормы) Тогда
			// После найденного слова в заголовке только числовой постфикс, оставляем имя элемента без него.
			ИмяЭлементаФормы = НайденныйЭлемент;
		КонецЕсли;
		
	КонецЕсли;
	
	Заголовок = "";
	КоличествоСимволов = СтрДлина(ИмяЭлементаФормы);
	
	Для НомерСимвола = 1 По КоличествоСимволов Цикл
		
		ТекущийСимвол = Сред(ИмяЭлементаФормы, НомерСимвола, 1);
		
		Если ТекущийСимвол = "_" Тогда
			Заголовок = Заголовок + " ";
		ИначеЕсли ВРег(ТекущийСимвол) = ТекущийСимвол Тогда
			Заголовок = Заголовок + " " + ТекущийСимвол;
		Иначе
			Заголовок = Заголовок + ТекущийСимвол;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПустаяСтрока(Заголовок) Тогда
		Возврат "";
	КонецЕсли;
	
	МассивСлов = СтрРазделить(Заголовок, " ", Ложь);
	НомерПоследнегоСлова = МассивСлов.ВГраница();
	
	Заголовок = МассивСлов[0];
	
	ПредыдущееСлово = Заголовок;
	Для НомерСлова = 1 По НомерПоследнегоСлова Цикл
		
		ТекущееСлово = МассивСлов[НомерСлова];
		
		// Если длина слова больше 1 символа, то добавляем слово с пробелом и продолжаем.
		Если СтрДлина(ТекущееСлово) > 1 Тогда
			Заголовок = Заголовок + " " + НРег(ТекущееСлово);
			Продолжить;
		КонецЕсли;
		
		// Текущее слово состоит из 1 символа, проверяем предыдущее и следующее слово.
		// Если предыдущее слово также состояло из 1 символа, то началась аббревиатура.
		Если СтрДлина(МассивСлов[НомерСлова - 1]) = 1 Тогда
			Заголовок = Заголовок + ТекущееСлово;
			Продолжить;
		КонецЕсли;
		
		// Если это слово последнее, то добавим текущее с пробелом и с маленькой буквы.
		Если НомерСлова >= НомерПоследнегоСлова Тогда
			Заголовок = Заголовок + " " + НРег(ТекущееСлово);
			Продолжить;
		КонецЕсли;
		
		// Если следующее слово также из одного символа, то аббревиатура продолжается.
		Если СтрДлина(МассивСлов[НомерСлова + 1]) = 1 Тогда
			Заголовок = Заголовок + " " + ТекущееСлово;
			Продолжить;
		КонецЕсли;
		
		// Если предыдущее и следующее слово длиннее 1 символа, то текущее слово - союз или предлог.
		Заголовок = Заголовок + " " + НРег(ТекущееСлово);
		
	КонецЦикла;
	
	Заголовок = СокрЛП(Заголовок);
	Заголовок = ВРег(Лев(Заголовок, 1)) + Сред(Заголовок, 2);
	
	Возврат Заголовок;
	
КонецФункции

#Область ЛокализацияЭлементовФормXML

// Удаляет подсказки для элементов форм с типом "Группа", у которых они совпадают с синонимом или образованы из имени.
//
Функция ОчиститьПодсказкиГруппФормы(ДокументDOM)
	
	ФормаИзменена = Ложь;
	
	МассивТиповЭлементовФормы = Новый Массив;
	МассивТиповЭлементовФормы.Добавить("UsualGroup");
	МассивТиповЭлементовФормы.Добавить("Pages");
	МассивТиповЭлементовФормы.Добавить("Page");
	МассивТиповЭлементовФормы.Добавить("CommandBar");
	МассивТиповЭлементовФормы.Добавить("ColumnGroup");
	МассивТиповЭлементовФормы.Добавить("Popup");
	МассивТиповЭлементовФормы.Добавить("ButtonGroup");
	
	ВыражениеПоискаПоТипуЭлементаШаблон = "//xmlns:ChildItems/xmlns:%1";
	
	Для Каждого ТипЭлементаФормы Из МассивТиповЭлементовФормы Цикл
		
		ВыражениеПоискаПоТипуЭлемента = СтрШаблон(ВыражениеПоискаПоТипуЭлементаШаблон, ТипЭлементаФормы);
		РезультатXPath = ВычислитьВыражениеXPath(ВыражениеПоискаПоТипуЭлемента, ДокументDOM);
		Пока Истина Цикл
			
			ЭлементDOMЭлементаФормы = РезультатXPath.ПолучитьСледующий();
			Если ЭлементDOMЭлементаФормы = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
			ПодсказкаЭлементаФормы = ПолучитьПодсказкуЭлемента(ДокументDOM, ЭлементDOMЭлементаФормы);
			Если ПустаяСтрока(ПодсказкаЭлементаФормы) Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаголовокЭлементаФормы = ПолучитьЗаголовокЭлемента(ДокументDOM, ЭлементDOMЭлементаФормы,, КодОсновногоЯзыка);
			ИмяЭлементаФормы = ПолучитьИмяЭлемента(ДокументDOM, ЭлементDOMЭлементаФормы);
			
			ПодсказкаЭлементаФормы = ПреобразоватьТекстДляСравнения(ПодсказкаЭлементаФормы, "Группа");
			ЗаголовокЭлементаФормы = ПреобразоватьТекстДляСравнения(ЗаголовокЭлементаФормы, "Группа");
			ИмяЭлементаФормы = ПреобразоватьТекстДляСравнения(ИмяЭлементаФормы, "Группа");
			
			Если (ПодсказкаЭлементаФормы = ЗаголовокЭлементаФормы)
			 ИЛИ (ПодсказкаЭлементаФормы = ИмяЭлементаФормы) Тогда
				ОчиститьПодсказкуЭлемента(ДокументDOM, ЭлементDOMЭлементаФормы);
				ФормаИзменена = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ФормаИзменена;
	
КонецФункции

// Устанавливает заголовки для элементов форм с типом "Таблица" и "Группа", у которых заголовок не заполнен.
// Генерацию заголовков производит из наименования элемента формы по заглавным буквам.
//
Функция ЗаполнитьЗаголовкиТаблицИГруппФормыXML(ДокументDOM, ТаблицаИсключенийЗаголовковЭлементовФорм,
	ТаблицаТиповЭлементовФормы)
	
	ФормаИзменена = Ложь;
	
	ВыражениеПоискаПоТипуЭлементаШаблон = "//xmlns:ChildItems/xmlns:%1";
	
	МассивПоискаТЧ = Контекст["МассивВыраженийПоискаТабличныхЧастейXML"];
	ТаблицаСинонимовТабличныхЧастей = ПолучитьТаблицуСинонимовТабличныхЧастейXML(ДокументDOM, МассивПоискаТЧ);
	
	Для Каждого СтрокаТаблицы Из ТаблицаТиповЭлементовФормы Цикл
		
		ТипЭлементаФормы = СтрокаТаблицы.ИмяЭлемента;
		
		ВыражениеПоискаПоТипуЭлемента = СтрШаблон(ВыражениеПоискаПоТипуЭлементаШаблон, ТипЭлементаФормы);
		РезультатXPath = ВычислитьВыражениеXPath(ВыражениеПоискаПоТипуЭлемента, ДокументDOM);
		Пока Истина Цикл
			
			ЭлементDOMЭлементаФормы = РезультатXPath.ПолучитьСледующий();
			Если ЭлементDOMЭлементаФормы = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
			// Очищаем заголовок таблицы, если она связана с табличной частью и заголовок таблицы совпадает с синонимом ТЧ.
			Если СтрСравнить(ТипЭлементаФормы, "Table") = 0 Тогда
				Если ОчиститьЗаголовокТаблицыФормыXML(ДокументDOM, ЭлементDOMЭлементаФормы, ТаблицаСинонимовТабличныхЧастей) Тогда
					ФормаИзменена = Истина;
				КонецЕсли;
				
				// Положение заголовка не меняем, поэтому переходим к следующему элементу формы.
				Продолжить;
			КонецЕсли;
			
			ИмяЭлементаФормы = ПолучитьИмяЭлемента(ДокументDOM, ЭлементDOMЭлементаФормы);
			ЗаголовокЭлементаФормы = ПолучитьЗаголовокЭлемента(ДокументDOM, ЭлементDOMЭлементаФормы);
			
			// Пропускаем элементы, у которых заголовок заполнен и установлен вручную, а не сгенерирован автоматически:
			// ГруппаСуммаОплаты -> Группа сумма оплаты (в данном случае необходимо установить заголовок "Сумма оплаты").
			ИмяДляСравнения = ПреобразоватьТекстДляСравнения(ИмяЭлементаФормы);
			ЗаголовокДляСравнения = СтрЗаменить(ЗаголовокЭлементаФормы, " ", "");
			ЗаголовокДляСравнения = ВРег(СокрЛП(ЗаголовокДляСравнения));
			Если (НЕ ПустаяСтрока(ЗаголовокЭлементаФормы)) И (ИмяДляСравнения <> ЗаголовокДляСравнения) Тогда
				Продолжить;
			КонецЕсли;
			
			НовыйЗаголовокЭлементаФормы = ПолучитьЗаголовокПоИмениЭлементаФормы(ИмяЭлементаФормы,
				ТаблицаИсключенийЗаголовковЭлементовФорм);
			
			// Новые пустые заголовки пропускаем.
			// Аналогично пропускаем случаи, когда заголовок не изменился, например, он есть в таблице исключений.
			Если ПустаяСтрока(НовыйЗаголовокЭлементаФормы) ИЛИ (ЗаголовокЭлементаФормы = НовыйЗаголовокЭлементаФормы) Тогда
				Продолжить;
			КонецЕсли;
			
			УстановитьЗаголовокЭлемента(ДокументDOM, ЭлементDOMЭлементаФормы, НовыйЗаголовокЭлементаФормы, КодОсновногоЯзыка);
			
			// Для обычных групп и групп с типом "страница" устанавливаем свойство "ОтображатьЗаголовок" = Ложь.
			Если СтрокаТаблицы.ОчищатьФлагОтображатьЗаголовок Тогда
				
				// Обрабатываем только обычные группы с обычным поведением и группу с типом "страница".
				ЭлементDOMПоведение = ПолучитьЭлементDOMПоВыражениюXPath("xmlns:Behavior", ДокументDOM, ЭлементDOMЭлементаФормы);
				Если (ЭлементDOMПоведение = Неопределено)
				 ИЛИ (СтрСравнить(ЭлементDOMПоведение.ТекстовоеСодержимое, "Usual") = 0) Тогда
					УстановитьОтображатьЗаголовокЭлементаФормы(ДокументDOM, ЭлементDOMЭлементаФормы);
				КонецЕсли;
				
			ИначеЕсли СтрСравнить(ТипЭлементаФормы, "Table") = 0 Тогда
				// Установим свойство "ПоложениеЗаголовка" в значение "Ложь" для таблицы.
				УстановитьПоложениеЗаголовкаДляЭлементаФормы(ДокументDOM, ЭлементDOMЭлементаФормы);
			КонецЕсли;
			
			ФормаИзменена = Истина;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ФормаИзменена;
	
КонецФункции

Функция ПолучитьТаблицуСинонимовТабличныхЧастейXML(ДокументDOM, МассивВыраженийПоискаТЧ)
	
	ТаблицаСинонимовТабличныхЧастей = Новый ТаблицаЗначений;
	ТаблицаСинонимовТабличныхЧастей.Колонки.Добавить("Имя");
	ТаблицаСинонимовТабличныхЧастей.Колонки.Добавить("КодЯзыка");
	ТаблицаСинонимовТабличныхЧастей.Колонки.Добавить("Синоним");
	
	ДокументDOMРодитель = ПолучитьДокументDOMРодителяОбъекта(ДокументDOM);
	
	Если ДокументDOMРодитель = Неопределено Тогда
		Возврат ТаблицаСинонимовТабличныхЧастей;
	КонецЕсли;
	
	ИмяТабличнойЧасти = "";
	
	СоответствиеИменСтандартныхТабличныхЧастей = Контекст["СоответствиеИменСтандартныхТабличныхЧастей"];
	
	// Получаем элементы объекта.
	МассивЭлементовDOMОбъекта = ПолучитьЭлементыDOMОбъектаПоВыражениюПоиска(ДокументDOMРодитель, МассивВыраженийПоискаТЧ);
	
	// Каждую найденную табличную часть добавляем в таблицу синонимов.
	Для Каждого ЭлементDOMОбъекта Из МассивЭлементовDOMОбъекта Цикл
		
		// Получаем имя табличной части.
		ИмяТабличнойЧасти = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath("xmlns:Name", ДокументDOMРодитель, ЭлементDOMОбъекта);
		
		// Для стандартных табличных частей особое поведение - нужно смотреть атрибут в ЭлементDOMОбъекта
		Если ПустаяСтрока(ИмяТабличнойЧасти) Тогда
			Если НЕ ЭлементDOMОбъекта.ЕстьАтрибуты() Тогда
				Продолжить;
			КонецЕсли;
			
			АтрибутDOMИмяУзла = ЭлементDOMОбъекта.Атрибуты.ПолучитьИменованныйЭлемент("name");
			Если АтрибутDOMИмяУзла = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяТабличнойЧасти = СоответствиеИменСтандартныхТабличныхЧастей[АтрибутDOMИмяУзла.ТекстовоеСодержимое];
			
			Если ПустаяСтрока(ИмяТабличнойЧасти) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ЭлементDOMСиноним = ПолучитьЭлементDOMПоВыражениюXPath("xmlns:Synonym", ДокументDOMРодитель, ЭлементDOMОбъекта);
		
		Если ЭлементDOMСиноним = Неопределено Тогда
			// Для стандартных табличных частей особое поведение.
			ЭлементDOMСиноним = ПолучитьЭлементDOMПоВыражениюXPath("xr:Synonym", ДокументDOMРодитель, ЭлементDOMОбъекта);
			Если ЭлементDOMСиноним = Неопределено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		// Получаем код языка и синоним для каждого языка.
		Для Каждого ДочернийЭлементDOM Из ЭлементDOMСиноним.ДочерниеУзлы Цикл
			
			КодЯзыка = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath("v8:lang", ДокументDOMРодитель, ДочернийЭлементDOM);
			Если ПустаяСтрока(КодЯзыка) Тогда
				Прервать;
			КонецЕсли;
			
			Синоним = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath("v8:content", ДокументDOMРодитель, ДочернийЭлементDOM);
			Если ПустаяСтрока(КодЯзыка) Тогда
				Прервать;
			КонецЕсли;
			
			НоваяСтрокаТаблицыСинонимов = ТаблицаСинонимовТабличныхЧастей.Добавить();
			НоваяСтрокаТаблицыСинонимов.Имя      = ИмяТабличнойЧасти;
			НоваяСтрокаТаблицыСинонимов.КодЯзыка = КодЯзыка;
			НоваяСтрокаТаблицыСинонимов.Синоним  = Синоним;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаСинонимовТабличныхЧастей;
	
КонецФункции

Функция ПолучитьТаблицуСинонимовТабличныхЧастейEDT(ДокументDOM, МассивВыраженийПоискаТЧ)
	
	ТаблицаСинонимовТабличныхЧастей = Новый ТаблицаЗначений;
	ТаблицаСинонимовТабличныхЧастей.Колонки.Добавить("Имя");
	ТаблицаСинонимовТабличныхЧастей.Колонки.Добавить("КодЯзыка");
	ТаблицаСинонимовТабличныхЧастей.Колонки.Добавить("Синоним");
	
	ДокументDOMРодитель = ПолучитьДокументDOMРодителяОбъекта(ДокументDOM);
	
	Если ДокументDOMРодитель = Неопределено Тогда
		Возврат ТаблицаСинонимовТабличныхЧастей;
	КонецЕсли;
	
	// Получаем подчиненные элементы.
	МассивЭлементовDOMОбъекта = ПолучитьЭлементыDOMОбъектаПоВыражениюПоиска(ДокументDOMРодитель, МассивВыраженийПоискаТЧ);
	
	ИмяТабличнойЧасти = "";
	
	// Каждую найденную табличную часть добавляем в таблицу синонимов.
	Для Каждого ЭлементDOMОбъекта Из МассивЭлементовDOMОбъекта Цикл
		
		ИмяТабличнойЧасти = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath("name", ДокументDOMРодитель, ЭлементDOMОбъекта);
		Если ПустаяСтрока(ИмяТабличнойЧасти) Тогда
			Продолжить;
		КонецЕсли;
		
		РезультатXPath = ВычислитьВыражениеXPath("synonym", ДокументDOMРодитель, ЭлементDOMОбъекта);
		
		Пока Истина Цикл
			
			ЭлементDOMСиноним = РезультатXPath.ПолучитьСледующий();
			Если ЭлементDOMСиноним = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
			КодЯзыка = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath("key", ДокументDOMРодитель, ЭлементDOMСиноним);
			Если ПустаяСтрока(КодЯзыка) Тогда
				Продолжить;
			КонецЕсли;
			
			Синоним = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath("value", ДокументDOMРодитель, ЭлементDOMСиноним);
			Если ПустаяСтрока(Синоним) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрокаТаблицыСинонимов = ТаблицаСинонимовТабличныхЧастей.Добавить();
			НоваяСтрокаТаблицыСинонимов.Имя      = ИмяТабличнойЧасти;
			НоваяСтрокаТаблицыСинонимов.КодЯзыка = КодЯзыка;
			НоваяСтрокаТаблицыСинонимов.Синоним  = Синоним;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаСинонимовТабличныхЧастей;
	
КонецФункции

Функция ПолучитьДокументDOMРодителяОбъекта(ДокументDOM)
	
	// Получаем путь к файлу формы.
	ПутьКФайлуФормы = СтрЗаменить(ДокументDOM.БазовыйURI, "sfile://", "");
	ПутьКФайлуФормы = СтрЗаменить(ПутьКФайлуФормы, "/", РазделительПути);
	
	НайденнаяСтрокаТаблицыРезультат = Результат.Найти(ПутьКФайлуФормы, "ПолноеИмяФайла");

	
	Если НайденнаяСтрокаТаблицыРезультат = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Получаем путь к родителю объекта (формы).
	РодительОбъекта = НайденнаяСтрокаТаблицыРезультат.РодительОбъекта;
	
	Если ПустаяСтрока(РодительОбъекта) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Копируем из таблицы Результат строки объектов, соответствующих родителю формы.
	МассивСтрокРодительОбъекта = Результат.НайтиСтроки(Новый Структура("Объект", РодительОбъекта));
	
	// Получим имя файла родителя объекта для отбора.
	МассивТекстРодительОбъекта = СтрРазделить(РодительОбъекта, ".");
	ИмяРодителяОбъекта         = МассивТекстРодительОбъекта[МассивТекстРодительОбъекта.ВГраница()];
	ИмяФайлаРодителяОбъекта    = ИмяРодителяОбъекта + РазделительПути + ?(ЭтоВыгрузкаXMLФайлов(), ".xml", ".mdo");
	
	ПутьКФайлуРодителя = "";
	
	Для Каждого СтрокаРодительОбъекта Из МассивСтрокРодительОбъекта Цикл
		// Получаем путь к файлу родителя формы.
		Если СтрЗаканчиваетсяНа(СтрокаРодительОбъекта.ПолноеИмяФайла, ИмяФайлаРодителяОбъекта) Тогда
			ПутьКФайлуРодителя = СтрокаРодительОбъекта.ПолноеИмяФайла;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ПустаяСтрока(ПутьКФайлуРодителя) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДокументDOM(ПутьКФайлуРодителя);
	
КонецФункции

Функция ПолучитьЭлементыDOMОбъектаПоВыражениюПоиска(ДокументDOM, МассивВыраженийПоиска)
	
	МассивРезультат = Новый Массив;
	
	Для Каждого ВыражениеПоиска Из МассивВыраженийПоиска Цикл
		РезультатXPath = ВычислитьВыражениеXPath(ВыражениеПоиска, ДокументDOM);
		
		Пока Истина Цикл
			
			ЭлементDOMТабличнойЧасти = РезультатXPath.ПолучитьСледующий();
			Если ЭлементDOMТабличнойЧасти = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
			МассивРезультат.Добавить(ЭлементDOMТабличнойЧасти);
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат МассивРезультат;
	
КонецФункции

Функция ОчиститьЗаголовокТаблицыФормыXML(ДокументDOM, ЭлементDOMЭлементаФормы, ТаблицаСинонимовТабличныхЧастей)
	
	// Получаем дочерний элемент DataPath.
	ЭлементDOMПутьКДанным = ПолучитьЭлементDOMПоВыражениюXPath("xmlns:DataPath", ДокументDOM, ЭлементDOMЭлементаФормы);
	
	Если ЭлементDOMПутьКДанным = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПутьКДанным = ЭлементDOMПутьКДанным.ТекстовоеСодержимое;
	
	МассивТекстОбъект = Контекст["МассивТекстОбъектСТочкой"];
	
	ЭтоТабличнаяЧасть = Ложь;
	
	// Если в пути к данным нет "Объект." - то это не табличная часть, пропускаем.
	Для Каждого ТекстОбъект Из МассивТекстОбъект Цикл
		Если СтрНачинаетсяС(ПутьКДанным, ТекстОбъект) Тогда
			ЭтоТабличнаяЧасть = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЭтоТабличнаяЧасть Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Получаем имя табличной части без "Объект.".
	ИмяТабличнойЧасти = ПутьКДанным;
	Для Каждого ТекстОбъект Из МассивТекстОбъект Цикл
		ИмяТабличнойЧасти = СтрЗаменить(ИмяТабличнойЧасти, ТекстОбъект, "");
	КонецЦикла;
	
	// Для стандартных табличных частей заменяем имя.
	СоответствиеИменСтандартныхТабличныхЧастей = Контекст["СоответствиеИменСтандартныхТабличныхЧастей"];
	Если СоответствиеИменСтандартныхТабличныхЧастей[ИмяТабличнойЧасти] <> Неопределено Тогда
		ИмяТабличнойЧасти = СоответствиеИменСтандартныхТабличныхЧастей[ИмяТабличнойЧасти];
	КонецЕсли;
	
	// Получаем заголовок.
	ЭлементDOMЗаголовок = ПолучитьЭлементDOMПоВыражениюXPath("xmlns:Title", ДокументDOM, ЭлементDOMЭлементаФормы);
	Если ЭлементDOMЗаголовок = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МассивЭлементовDOMДляУдаления = Новый Массив;
	
	// Проходимся по дочерним элементам. Каждый из них - заголовок на одном языке.
	Для Каждого ДочернийЭлементDOM Из ЭлементDOMЗаголовок.ДочерниеУзлы Цикл
		
		КодЯзыка       = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath("v8:lang",    ДокументDOM, ДочернийЭлементDOM);
		ТекстЗаголовка = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath("v8:content", ДокументDOM, ДочернийЭлементDOM);
		
		Если ПустаяСтрока(КодЯзыка) ИЛИ ПустаяСтрока(ТекстЗаголовка) Тогда
			Продолжить;
		КонецЕсли;
		
		// Ищем в таблице синонимов ТЧ строки, соответствующие пути к данным, языку и тексту заголовка.
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Имя",      ИмяТабличнойЧасти);
		СтруктураПоиска.Вставить("КодЯзыка", КодЯзыка);
		СтруктураПоиска.Вставить("Синоним",  ТекстЗаголовка);
		
		// Ищем строки в таблице синонимов.
		НайденныеСтрокиТаблицыСинонимов = ТаблицаСинонимовТабличныхЧастей.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтрокиТаблицыСинонимов.Количество() > 0 Тогда
			МассивЭлементовDOMДляУдаления.Добавить(ДочернийЭлементDOM);
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивЭлементовDOMДляУдаления.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Удаляем заголовки.
	Для Каждого ЭлементDOMДляУдаления Из МассивЭлементовDOMДляУдаления Цикл
		ЭлементDOMЗаголовок.УдалитьДочерний(ЭлементDOMДляУдаления);
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ОчиститьЗаголовокТаблицыФормыEDT(ДокументDOM, ЭлементDOMЭлементаФормы, ТаблицаСинонимовТабличныхЧастей)
	
	// Получаем дочерний элемент DataPath.
	ЭлементDOMПутьКДанным = ПолучитьЭлементDOMПоВыражениюXPath("dataPath/segments", ДокументDOM, ЭлементDOMЭлементаФормы);
	
	Если ЭлементDOMПутьКДанным = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПутьКДанным = ЭлементDOMПутьКДанным.ТекстовоеСодержимое;
	
	МассивТекстОбъект = Контекст["МассивТекстОбъектСТочкой"];
	
	ЭтоТабличнаяЧасть = Ложь;
	
	// Если в пути к данным нет "Объект." - то это не табличная часть, пропускаем.
	Для Каждого ТекстОбъект Из МассивТекстОбъект Цикл
		Если СтрНайти(ПутьКДанным, ТекстОбъект) > 0 Тогда
			ЭтоТабличнаяЧасть = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЭтоТабличнаяЧасть Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Получаем имя табличной части без "Объект.".
	ИмяТабличнойЧасти = ПутьКДанным;
	Для Каждого ТекстОбъект Из МассивТекстОбъект Цикл
		ИмяТабличнойЧасти = СтрЗаменить(ИмяТабличнойЧасти, ТекстОбъект, "");
	КонецЦикла;
	
	МассивЭлементовDOMДляУдаления = Новый Массив;
	
	РезультатXPath = ВычислитьВыражениеXPath("title", ДокументDOM, ЭлементDOMЭлементаФормы);
	
	// Проходимся по дочерним элементам. Каждый из них - заголовок на одном языке.
	Пока Истина Цикл
		
		ЭлементDOMЗаголовок = РезультатXPath.ПолучитьСледующий();
		Если ЭлементDOMЗаголовок = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		КодЯзыка       = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath("key",   ДокументDOM, ЭлементDOMЗаголовок);
		ТекстЗаголовка = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath("value", ДокументDOM, ЭлементDOMЗаголовок);
		
		Если ПустаяСтрока(КодЯзыка) ИЛИ ПустаяСтрока(ТекстЗаголовка) Тогда
			Продолжить;
		КонецЕсли;
		
		// Ищем в таблице синонимов ТЧ строки, соответствующие пути к данным, языку и тексту заголовка.
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Имя",      ИмяТабличнойЧасти);
		СтруктураПоиска.Вставить("КодЯзыка", КодЯзыка);
		СтруктураПоиска.Вставить("Синоним",  ТекстЗаголовка);
		
		НайденныеСтрокиТаблицыСинонимов = ТаблицаСинонимовТабличныхЧастей.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтрокиТаблицыСинонимов.Количество() > 0 Тогда
			МассивЭлементовDOMДляУдаления.Добавить(ЭлементDOMЗаголовок);
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивЭлементовDOMДляУдаления.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Удаляем заголовки.
	Для Каждого ЭлементDOMДляУдаления Из МассивЭлементовDOMДляУдаления Цикл
		ЭлементDOMЭлементаФормы.УдалитьДочерний(ЭлементDOMДляУдаления);
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ЗаполнитьЗаголовкиКолонокРеквизитаФормы(ДокументDOM, ТаблицаИсключенийЗаголовковЭлементовФорм)
	
	ФормаИзменена = Ложь;
	
	ВыражениеПоискаКолонокРеквизита = "xmlns:Columns";
	ВыражениеПоискаПоТипуРеквизита = "//xmlns:Attributes/xmlns:Attribute/xmlns:Type/v8:Type[text()='v8:ValueTable']";
	
	РезультатXPath = ВычислитьВыражениеXPath(ВыражениеПоискаПоТипуРеквизита, ДокументDOM);
	Пока Истина Цикл
		
		// Получаем элемент, у которого тип "Таблица значений".
		ЭлементDOMТипТаблицаЗначений = РезультатXPath.ПолучитьСледующий();
		Если ЭлементDOMТипТаблицаЗначений = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		// Получаем элемент, который является родителем найденного элемента. У родителя тег Type.
		ЭлементDOMType = ЭлементDOMТипТаблицаЗначений.РодительскийУзел;
		Если ЭлементDOMType = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Получаем реквизит.
		ЭлементDOMРеквизит = ЭлементDOMType.РодительскийУзел;
		Если ЭлементDOMРеквизит = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Получаем имя найденного реквизита. Оно будет нужно для формирования полного имени реквизита.
		ИмяРеквизита = ПолучитьИмяЭлемента(ДокументDOM, ЭлементDOMРеквизит);
		Если ПустаяСтрока(ИмяРеквизита) Тогда
			Продолжить;
		КонецЕсли;
		
		// Получаем все колонки у реквизита формы.
		ЭлементDOMКолонки = ПолучитьЭлементDOMПоВыражениюXPath(ВыражениеПоискаКолонокРеквизита, ДокументDOM, ЭлементDOMРеквизит);
		Если ЭлементDOMКолонки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементDOMКолонкиДочерниеЭлементы = ЭлементDOMКолонки.ДочерниеУзлы;
		Для Каждого ЭлементDOMКолонка Из ЭлементDOMКолонкиДочерниеЭлементы Цикл
			
			ЗаголовокКолонки = ПолучитьЗаголовокЭлемента(ДокументDOM, ЭлементDOMКолонка);
			Если НЕ ПустаяСтрока(ЗаголовокКолонки) Тогда
				Продолжить;
			КонецЕсли;
			
			// Получаем имя колонки реквизита. Оно будет нужно для формирования полного имени реквизита.
			ИмяКолонки = ПолучитьИмяЭлемента(ДокументDOM, ЭлементDOMКолонка);
			Если ПустаяСтрока(ИмяКолонки) Тогда
				Продолжить;
			КонецЕсли;
			
			// Формируем полное имя реквизита.
			ПутьКДанным = ИмяРеквизита + "." + ИмяКолонки;
			
			// Получаем все элементы, у которых в пути к данным задано полное имя реквизита.
			МассивЭлементов = ПолучитьЭлементыФормыПоРеквизиту(ДокументDOM, ПутьКДанным);
			Если МассивЭлементов.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗаголовокРеквизита = Ложь;
			
			// Проверяем все заголовки найденных реквизитов.
			Для Каждого ЭлементМассива Из МассивЭлементов Цикл
				ЗаголовокЭлементаНаФорме = ПолучитьЗаголовокЭлемента(ДокументDOM, ЭлементМассива);
				Если ПустаяСтрока(ЗаголовокЭлементаНаФорме) Тогда
					ЗаполнитьЗаголовокРеквизита = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ЗаполнитьЗаголовокРеквизита Тогда
				НовыйЗаголовокРеквизитаФормы = ПолучитьЗаголовокПоИмениЭлементаФормы(ИмяКолонки, ТаблицаИсключенийЗаголовковЭлементовФорм);
				УстановитьЗаголовокЭлемента(ДокументDOM, ЭлементDOMКолонка, НовыйЗаголовокРеквизитаФормы);
				ФормаИзменена = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ФормаИзменена;
	
КонецФункции

Функция ПолучитьЭлементыФормыПоРеквизиту(ДокументDOM, ПолноеИмяРеквизита)
	
	ВыражениеПоискаПоПутиКДаннымШаблон = "//xmlns:ChildItems/*/xmlns:DataPath[text()='%1']";
	МассивЭлементовФормы = Новый Массив;
	
	// Получаем все элементы формы, у которого в свойстве ПутьКДанным указано полное имя реквизита.
	ВыражениеПоискаПоПутиКДанным = СтрШаблон(ВыражениеПоискаПоПутиКДаннымШаблон, ПолноеИмяРеквизита);
	РезультатПоискаПоПутиКДанным = ВычислитьВыражениеXPath(ВыражениеПоискаПоПутиКДанным, ДокументDOM);
	
	Пока Истина Цикл
		
		ЭлементDOMПутьКДанным = РезультатПоискаПоПутиКДанным.ПолучитьСледующий();
		Если ЭлементDOMПутьКДанным = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		ЭлементDOMПоле = ЭлементDOMПутьКДанным.РодительскийУзел;
		Если ЭлементDOMПоле = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МассивЭлементовФормы.Добавить(ЭлементDOMПоле);
		
	КонецЦикла;
	
	Возврат МассивЭлементовФормы;
	
КонецФункции

Функция ПолучитьРеквизитФормыПоЭлементу(ДокументDOM, ЭлементDOMЭлементаФормы)
	
	ИмяРеквизита = "";
	Если ЭтоВыгрузкаXMLФайлов() Тогда
		ИмяРеквизита = ЭлементDOMЭлементаФормы.ТекстовоеСодержимое;
	Иначе
		ЭлементDOMsegments = ЭлементDOMЭлементаФормы.ПервыйДочерний;
		Если ЭлементDOMsegments <> Неопределено Тогда
			ИмяРеквизита = ЭлементDOMsegments.ТекстовоеСодержимое;
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяРеквизита) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаРеквизитовФормы = ?(ЭтоВыгрузкаXMLФайлов(), ПолучитьРеквизитыФормы(ДокументDOM), ПолучитьРеквизитыФормыEDT(ДокументDOM));
	
	СтрокаРеквизитаФормы = ТаблицаРеквизитовФормы.Найти(ИмяРеквизита, "ИмяРеквизита");
	Если СтрокаРеквизитаФормы = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЭлементDOMРеквизитаФормы = СтрокаРеквизитаФормы.ЭлементDOM;
	
	Возврат ЭлементDOMРеквизитаФормы;
	
КонецФункции

Функция ПолучитьКомандуФормыПоЭлементу(ДокументDOM, ЭлементDOM)
	
	ТекстовоеСодержимое = ЭлементDOM.ТекстовоеСодержимое;
	Если НЕ ЗначениеЗаполнено(ТекстовоеСодержимое) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяКоманды = СтрЗаменить(ТекстовоеСодержимое, "Form.Command.", "");
	
	ВыражениеXPath = ?(ЭтоВыгрузкаXMLФайлов(), "//xmlns:Form/xmlns:Commands/xmlns:Command[@name = '%1']", "//formCommands/name[text() = '%1']/..");
	ВыражениеПоискаПоПутиКДанным = СтрШаблон(ВыражениеXPath, ИмяКоманды);
	РезультатПоискаПоПутиКДанным = ВычислитьВыражениеXPath(ВыражениеПоискаПоПутиКДанным, ДокументDOM);
	
	Возврат РезультатПоискаПоПутиКДанным.ПолучитьСледующий();
	
КонецФункции

Функция ПолучитьЭлементыDOMЭлементовФормы(ДокументDOM)
	
	// Получаем все элементы, у которых заполнено свойство "ПутьКДанным".
	МассивЭлементовФормы = Новый Массив;
	
	ВыражениеПоискаПоПутиКДанным = ?(ЭтоВыгрузкаXMLФайлов(), "//xmlns:ChildItems/*/xmlns:DataPath", "//dataPath");
	РезультатПоискаПоПутиКДанным = ВычислитьВыражениеXPath(ВыражениеПоискаПоПутиКДанным, ДокументDOM);
	
	Пока Истина Цикл
		
		ЭлементDOMПутьКДанным = РезультатПоискаПоПутиКДанным.ПолучитьСледующий();
		Если ЭлементDOMПутьКДанным = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		МассивЭлементовФормы.Добавить(ЭлементDOMПутьКДанным);
		
	КонецЦикла;
	
	Возврат МассивЭлементовФормы;
	
КонецФункции

Функция ПолучитьЭлементыDOMКомандФормы(ДокументDOM)
	
	// Получаем все элементы, у которых заполнено свойство "ИмяКоманды".
	МассивЭлементовФормы = Новый Массив;
	
	ВыражениеПоискаПоПутиКДанным = ?(ЭтоВыгрузкаXMLФайлов(), "//xmlns:ChildItems/*/xmlns:CommandName", "//commandName");
	РезультатПоискаПоПутиКДанным = ВычислитьВыражениеXPath(ВыражениеПоискаПоПутиКДанным, ДокументDOM);
	
	Пока Истина Цикл
		
		ЭлементDOMПутьКДанным = РезультатПоискаПоПутиКДанным.ПолучитьСледующий();
		Если ЭлементDOMПутьКДанным = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		МассивЭлементовФормы.Добавить(ЭлементDOMПутьКДанным);
		
	КонецЦикла;
	
	Возврат МассивЭлементовФормы;
	
КонецФункции

Функция ПолучитьЭлементыФормыПоРеквизитуEDT(ДокументDOM, ПолноеИмяРеквизита)
	
	ВыражениеПоискаПоПутиКДаннымШаблон = "//dataPath/segments[text()='%1']";
	
	МассивЭлементовФормы = Новый Массив;
	
	// Получаем все элементы формы, у которого в свойстве ПутьКДанным указано полное имя реквизита.
	ВыражениеПоискаПоПутиКДанным = СтрШаблон(ВыражениеПоискаПоПутиКДаннымШаблон, ПолноеИмяРеквизита);
	РезультатПоискаПоПутиКДанным = ВычислитьВыражениеXPath(ВыражениеПоискаПоПутиКДанным, ДокументDOM);
	
	Пока Истина Цикл
		
		ЭлементDOMSegments = РезультатПоискаПоПутиКДанным.ПолучитьСледующий();
		Если ЭлементDOMSegments = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		ЭлементDOMDataPath = ЭлементDOMSegments.РодительскийУзел;
		Если ЭлементDOMDataPath = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементDOMПоле= ЭлементDOMDataPath.РодительскийУзел;
		Если ЭлементDOMПоле = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МассивЭлементовФормы.Добавить(ЭлементDOMПоле);
		
	КонецЦикла;
	
	Возврат МассивЭлементовФормы;
	
КонецФункции

Функция ЗаполнитьЗаголовкиСвойствСпискаЗначений(ДокументDOM)
	
	ФормаИзменена = Ложь;
	
	СвойстваЭлементаСпискаЗначений = Новый СписокЗначений;
	СвойстваЭлементаСпискаЗначений.Добавить("Value", "Значение");
	СвойстваЭлементаСпискаЗначений.Добавить("Picture", "Картинка");
	СвойстваЭлементаСпискаЗначений.Добавить("Check", "Пометка");
	СвойстваЭлементаСпискаЗначений.Добавить("Presentation", "Представление");
	СвойстваЭлементаСпискаЗначений.Добавить("Значение", "Значение");
	СвойстваЭлементаСпискаЗначений.Добавить("Картинка", "Картинка");
	СвойстваЭлементаСпискаЗначений.Добавить("Пометка", "Пометка");
	СвойстваЭлементаСпискаЗначений.Добавить("Представление", "Представление");
	
	ВыражениеПоискаПоТипуРеквизита = "//xmlns:Attributes/xmlns:Attribute/xmlns:Type/v8:Type[text()='v8:ValueListType']";
	РезультатXPath = ВычислитьВыражениеXPath(ВыражениеПоискаПоТипуРеквизита, ДокументDOM);
	Пока Истина Цикл
		
		ЭлементDOMv8Type = РезультатXPath.ПолучитьСледующий();
		Если ЭлементDOMv8Type = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		ЭлементDOMType = ЭлементDOMv8Type.РодительскийУзел;
		Если ЭлементDOMType = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементDOMРеквизит = ЭлементDOMType.РодительскийУзел;
		Если ЭлементDOMРеквизит = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяРеквизита = ПолучитьИмяЭлемента(ДокументDOM, ЭлементDOMРеквизит);
		Если ПустаяСтрока(ИмяРеквизита) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СвойствоЭлементаСпискаЗначений Из СвойстваЭлементаСпискаЗначений Цикл
			
			ИмяСвойства = СвойствоЭлементаСпискаЗначений.Значение;
			ПолноеИмяСвойстваЭлемента = СтрШаблон("%1.%2", ИмяРеквизита, ИмяСвойства);
			МассивЭлементов = ПолучитьЭлементыФормыПоРеквизиту(ДокументDOM, ПолноеИмяСвойстваЭлемента);
			
			Если МассивЭлементов.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаголовокСвойства = СвойствоЭлементаСпискаЗначений.Представление;
			
			Для Каждого ЭлементDOMЭлементаФормы Из МассивЭлементов Цикл
				
				ЗаголовокЭлемента = ПолучитьЗаголовокЭлемента(ДокументDOM, ЭлементDOMЭлементаФормы);
				Если ПустаяСтрока(ЗаголовокЭлемента) Тогда
					УстановитьЗаголовокЭлемента(ДокументDOM, ЭлементDOMЭлементаФормы, ЗаголовокСвойства, КодОсновногоЯзыка);
					ФормаИзменена = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ФормаИзменена;
	
КонецФункции

Функция ЗаполнитьЗаголовкиЭлементовФорм(ДокументDOM)
	
	ФормаИзменена = Ложь;
	
	ЯзыкиКонфигурации         = Контекст["ТаблицаЯзыковКонфигурации"];
	ЭлементыDOMЭлементовФормы = ПолучитьЭлементыDOMЭлементовФормы(ДокументDOM);
	ЭлементыDOMКомандФормы    = ПолучитьЭлементыDOMКомандФормы(ДокументDOM);
	
	ЭлементыИКоманды = Новый Массив;
	ДополнитьМассив(ЭлементыИКоманды, ЭлементыDOMЭлементовФормы);
	ДополнитьМассив(ЭлементыИКоманды, ЭлементыDOMКомандФормы);
	
	Для Каждого ЭлементDOMdataPath Из ЭлементыИКоманды Цикл
		
		ЭлементDOMЭлементФормы = ЭлементDOMdataPath.РодительскийУзел;
		Если ЭлементDOMЭлементФормы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ЯзыкКонфигурации Из ЯзыкиКонфигурации Цикл
			
			КодЯзыка = ЯзыкКонфигурации.КодЯзыка;
			
			Если ЭтоВыгрузкаXMLФайлов() Тогда
				ЗаголовокЭлемента = ПолучитьЗаголовокЭлемента(ДокументDOM, ЭлементDOMЭлементФормы,, КодЯзыка);
			Иначе
				ЗаголовокЭлемента = ПолучитьЗаголовокЭлементаEDT(ДокументDOM, ЭлементDOMЭлементФормы, КодЯзыка);
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(ЗаголовокЭлемента) Тогда
				Продолжить;
			КонецЕсли;
			
			НайденныйЭлементDOM = Неопределено;
			Если СтрСравнить(ЭлементDOMdataPath.ИмяУзла, "DataPath") = 0 Тогда
				НайденныйЭлементDOM = ПолучитьРеквизитФормыПоЭлементу(ДокументDOM, ЭлементDOMdataPath);
			ИначеЕсли СтрСравнить(ЭлементDOMdataPath.ИмяУзла, "CommandName") = 0 Тогда
				НайденныйЭлементDOM = ПолучитьКомандуФормыПоЭлементу(ДокументDOM, ЭлементDOMdataPath);
			КонецЕсли;
			
			Если НайденныйЭлементDOM = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЭтоВыгрузкаXMLФайлов() Тогда
				ЗаголовокРеквизита = ПолучитьЗаголовокЭлемента(ДокументDOM, НайденныйЭлементDOM,, КодЯзыка);
			Иначе
				ЗаголовокРеквизита = ПолучитьЗаголовокЭлементаEDT(ДокументDOM, НайденныйЭлементDOM, КодЯзыка);
			КонецЕсли;
			
			Если ПустаяСтрока(ЗаголовокРеквизита) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЭтоВыгрузкаXMLФайлов() Тогда
				УстановитьЗаголовокЭлемента(ДокументDOM, ЭлементDOMЭлементФормы, ЗаголовокРеквизита, КодЯзыка);
			Иначе
				УстановитьЗаголовокЭлементаEDT(ДокументDOM, ЭлементDOMЭлементФормы, ЗаголовокРеквизита, КодЯзыка);
			КонецЕсли;
			
			ФормаИзменена = Истина;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ФормаИзменена;
	
КонецФункции

#КонецОбласти

#Область ЛокализацияЭлементовФормEDT

// Удаляет подсказки для элементов форм с типом "Групп", у которых они совпадают с синонимом или образованы из имени.
//
Функция ОчиститьПодсказкиГруппФормыEDT(ДокументDOM)
	
	ФормаИзменена = Ложь;
	
	МассивТиповЭлементовФормы = Новый Массив;
	МассивТиповЭлементовФормы.Добавить("UsualGroup");
	МассивТиповЭлементовФормы.Добавить("Pages");
	МассивТиповЭлементовФормы.Добавить("Page");
	МассивТиповЭлементовФормы.Добавить("CommandBar");
	МассивТиповЭлементовФормы.Добавить("ColumnGroup");
	МассивТиповЭлементовФормы.Добавить("Popup");
	МассивТиповЭлементовФормы.Добавить("ButtonGroup");
	
	ТекстГруппа = Контекст["ТекстГруппа"];
	
	ВыражениеПоискаПоТипуЭлементаШаблон = "//items/type[text()='%1']";
	
	Для Каждого ТипЭлементаФормы Из МассивТиповЭлементовФормы Цикл
		
		ВыражениеПоискаПоТипуЭлемента = СтрШаблон(ВыражениеПоискаПоТипуЭлементаШаблон, ТипЭлементаФормы);
		РезультатXPath = ВычислитьВыражениеXPath(ВыражениеПоискаПоТипуЭлемента, ДокументDOM);
		Пока Истина Цикл
			
			ЭлементDOMТипЭлементаФормы = РезультатXPath.ПолучитьСледующий();
			Если ЭлементDOMТипЭлементаФормы = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
			ЭлементDOMЭлементаФормы = ЭлементDOMТипЭлементаФормы.РодительскийУзел;
			
			ПодсказкаЭлементаФормы = ПолучитьПодсказкуЭлементаEDT(ДокументDOM, ЭлементDOMЭлементаФормы);
			Если ПустаяСтрока(ПодсказкаЭлементаФормы) Тогда
				УдалитьПодсказкуЭлементаEDT(ДокументDOM, ЭлементDOMЭлементаФормы);
				ФормаИзменена = Истина;
				Продолжить;
			КонецЕсли;
			
			ЗаголовокЭлементаФормы = ПолучитьЗаголовокЭлементаEDT(ДокументDOM, ЭлементDOMЭлементаФормы, КодОсновногоЯзыка);
			ИмяЭлементаФормы = ПолучитьИмяЭлементаEDT(ДокументDOM, ЭлементDOMЭлементаФормы);
			
			ПодсказкаЭлементаФормы = ПреобразоватьТекстДляСравнения(ПодсказкаЭлементаФормы, ТекстГруппа);
			ЗаголовокЭлементаФормы = ПреобразоватьТекстДляСравнения(ЗаголовокЭлементаФормы, ТекстГруппа);
			ИмяЭлементаФормы = ПреобразоватьТекстДляСравнения(ИмяЭлементаФормы, ТекстГруппа);
			
			Если (ПодсказкаЭлементаФормы = ЗаголовокЭлементаФормы)
			 ИЛИ (ПодсказкаЭлементаФормы = ИмяЭлементаФормы) Тогда
				УдалитьПодсказкуЭлементаEDT(ДокументDOM, ЭлементDOMЭлементаФормы);
				ФормаИзменена = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ФормаИзменена;
	
КонецФункции

// Устанавливает заголовки для элементов форм с типом "Таблица" и "Группа", у которых заголовок не заполнен.
// Генерацию заголовков производит из наименования элемента формы по заглавным буквам.
//
Функция ЗаполнитьЗаголовкиТаблицИГруппФормыEDT(ДокументDOM, ТаблицаИсключенийЗаголовковЭлементовФорм,
	ТаблицаПоискаТаблицИГрупп)
	
	ФормаИзменена = Ложь;
	
	МассивПоискаТЧ = Контекст["МассивВыраженийПоискаТабличныхЧастейEDT"];
	ТаблицаСинонимовТабличныхЧастей = ПолучитьТаблицуСинонимовТабличныхЧастейEDT(ДокументDOM, МассивПоискаТЧ);
	
	Для Каждого СтрокаТипа Из ТаблицаПоискаТаблицИГрупп Цикл
		
		ТипЭлементаФормы = СтрокаТипа.ТипЭлемента;
		ВыражениеПоискаПоТипуЭлемента = СтрокаТипа.ВыражениеПоиска;
		ПолучатьРодителя = СтрокаТипа.ПолучатьРодителя;
		
		РезультатXPath = ВычислитьВыражениеXPath(ВыражениеПоискаПоТипуЭлемента, ДокументDOM);
		Пока Истина Цикл
			
			ЭлементDOMТипЭлементаФормы = РезультатXPath.ПолучитьСледующий();
			Если ЭлементDOMТипЭлементаФормы = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
			Если ПолучатьРодителя Тогда
				ЭлементDOMЭлементаФормы = ЭлементDOMТипЭлементаФормы.РодительскийУзел;
			Иначе
				ЭлементDOMЭлементаФормы = ЭлементDOMТипЭлементаФормы;
			КонецЕсли;
			
			// Очищаем заголовок таблицы, если она связана с табличной частью и заголовок таблицы совпадает с синонимом ТЧ.
			Если СтрСравнить(ТипЭлементаФормы, "Table") = 0 Тогда
				Если ОчиститьЗаголовокТаблицыФормыEDT(ДокументDOM, ЭлементDOMЭлементаФормы, ТаблицаСинонимовТабличныхЧастей) Тогда
					ФормаИзменена = Истина;
				КонецЕсли;
				
				// Положение заголовка не меняем, поэтому переходим к следующему элементу формы.
				Продолжить;
			КонецЕсли;
			
			Если ТипЭлементаФормы = "UsualGroup" Тогда
				// Обрабатываем только обычные группы.
				ЭлементDOMПоведение = ПолучитьЭлементDOMПоВыражениюXPath("extInfo/behavior", ДокументDOM, ЭлементDOMЭлементаФормы);
				Если (ЭлементDOMПоведение <> Неопределено)
					И (СтрСравнить(ЭлементDOMПоведение.ТекстовоеСодержимое, "Usual") <> 0) Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			ИмяЭлементаФормы = ПолучитьИмяЭлементаEDT(ДокументDOM, ЭлементDOMЭлементаФормы);
			ЗаголовокЭлементаФормы = ПолучитьЗаголовокЭлементаEDT(ДокументDOM, ЭлементDOMЭлементаФормы, КодОсновногоЯзыка);
			
			// Пропускаем элементы, у которых заголовок заполнен и установлен вручную, а не сгенерирован автоматически:
			// ГруппаСуммаОплаты -> Группа сумма оплаты (в данном случае необходимо установить заголовок "Сумма оплаты").
			ИмяДляСравнения = ПреобразоватьТекстДляСравнения(ИмяЭлементаФормы);
			ЗаголовокДляСравнения = СтрЗаменить(ЗаголовокЭлементаФормы, " ", "");
			ЗаголовокДляСравнения = ВРег(СокрЛП(ЗаголовокДляСравнения));
			Если (НЕ ПустаяСтрока(ЗаголовокЭлементаФормы)) И (ИмяДляСравнения <> ЗаголовокДляСравнения) Тогда
				Продолжить;
			КонецЕсли;
			
			НовыйЗаголовокЭлементаФормы = ПолучитьЗаголовокПоИмениЭлементаФормы(ИмяЭлементаФормы,
				ТаблицаИсключенийЗаголовковЭлементовФорм);
			
			// Новые пустые заголовки пропускаем.
			// Аналогично пропускаем случаи, когда заголовок не изменился, например, он есть в таблице исключений.
			Если (ТипЭлементаФормы <> "Table")
					И (ПустаяСтрока(НовыйЗаголовокЭлементаФормы) ИЛИ (ЗаголовокЭлементаФормы = НовыйЗаголовокЭлементаФормы)) Тогда
				Продолжить;
			КонецЕсли;
			
			УстановитьЗаголовокЭлементаEDT(ДокументDOM, ЭлементDOMЭлементаФормы, НовыйЗаголовокЭлементаФормы);
			
			// Для обычных групп и страниц устанавливаем свойство "ОтображатьЗаголовок" = Ложь.
			Если СтрокаТипа.ОчищатьФлагОтображатьЗаголовок Тогда
				
				// Обрабатываем только обычные группы.
				ЭлементDOMПоведение = ПолучитьЭлементDOMПоВыражениюXPath("extInfo/behavior", ДокументDOM, ЭлементDOMЭлементаФормы);
				Если (ЭлементDOMПоведение = Неопределено)
				 ИЛИ (СтрСравнить(ЭлементDOMПоведение.ТекстовоеСодержимое, "Usual") = 0) Тогда
					УдалитьОтображениеЗаголовкаЭлементаФормыEDT(ДокументDOM, ЭлементDOMЭлементаФормы);
				КонецЕсли;
				
			ИначеЕсли СтрСравнить(ТипЭлементаФормы, "Table") = 0 Тогда
				// Установим свойство "ПоложениеЗаголовка" в значение "Ложь" для таблицы.
				УстановитьПоложениеЗаголовкаДляЭлементаФормыEDT(ДокументDOM, ЭлементDOMЭлементаФормы);
			КонецЕсли;
			
			ФормаИзменена = Истина;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ФормаИзменена;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ЛокализацияРеквизитовФорм

#Область ЛокализацияРеквизитовФормXML

Функция ОчиститьЗаголовкиРеквизитовФормыНеРазмещенныхНаФорме(ДокументDOM)
	
	ФормаИзменена = Ложь;
	
	МассивРеквизитов = ПолучитьРеквизитыФормыНеРазмещенныеНаФорме(ДокументDOM);
	
	Для Каждого ЭлементDOMРеквизит Из МассивРеквизитов Цикл
		
		ВыражениеXPath = "xmlns:Title";
		ЭлементDOMЗаголовок = ПолучитьЭлементDOMПоВыражениюXPath(ВыражениеXPath, ДокументDOM, ЭлементDOMРеквизит);
		Если ЭлементDOMЗаголовок <> Неопределено Тогда
			ЭлементDOMЗаголовок.ТекстовоеСодержимое = "";
			ФормаИзменена = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ФормаИзменена;
	
КонецФункции

Функция ПолучитьРеквизитыФормыНеРазмещенныеНаФорме(ДокументDOM)
	
	МассивРеквизитов = Новый Массив;
	
	ТаблицаРеквизитов = ПолучитьРеквизитыФормы(ДокументDOM);
	Для Каждого СтрокаТаблицы Из ТаблицаРеквизитов Цикл
		
		ЭлементDOMРеквизит = СтрокаТаблицы.ЭлементDOM;
		МассивВозможныхПутей = СтрокаТаблицы.МассивВозможныхПутей;
		
		РеквизитНайден = Ложь;
		ШаблонДляПоиска = "//*[xmlns:DataPath=""%1""]";
		
		Для Каждого ЭлементМассива Из МассивВозможныхПутей Цикл
			ВыражениеПоиска = СтрШаблон(ШаблонДляПоиска, ЭлементМассива);
			
			ЭлементDOMПутьКРеквизиту = ПолучитьЭлементDOMПоВыражениюXPath(ВыражениеПоиска, ДокументDOM);
			Если ЭлементDOMПутьКРеквизиту <> Неопределено Тогда
				РеквизитНайден = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ РеквизитНайден Тогда
			МассивРеквизитов.Добавить(ЭлементDOMРеквизит);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивРеквизитов;
	
КонецФункции

Функция ПолучитьРеквизитыФормы(ДокументDOM, ПолучитьПодчиненныеРеквизиты = Истина)
	
	ТаблицаРеквизитов = Новый ТаблицаЗначений;
	ТаблицаРеквизитов.Колонки.Добавить("ЭлементDOM");
	ТаблицаРеквизитов.Колонки.Добавить("ИмяРеквизита");
	ТаблицаРеквизитов.Колонки.Добавить("МассивВозможныхПутей");
	
	СоответствиеРеквизитовДляПоиска = Новый Соответствие;
	
	РезультатXPath = ВычислитьВыражениеXPath("/xmlns:Form/xmlns:Attributes/xmlns:Attribute/@name", ДокументDOM);
	Пока Истина Цикл
		
		АтрибутDOMИмяРеквизита = РезультатXPath.ПолучитьСледующий();
		Если АтрибутDOMИмяРеквизита = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		ИмяРеквизита = АтрибутDOMИмяРеквизита.ТекстовоеСодержимое;
		Если ПустаяСтрока(ИмяРеквизита) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементDOMРеквизит = АтрибутDOMИмяРеквизита.ЭлементВладелец;
		СоответствиеРеквизитовДляПоиска.Вставить(ИмяРеквизита, ЭлементDOMРеквизит);
		
		МассивВозможныхПутей = Новый Массив;
		МассивВозможныхПутей.Добавить(ИмяРеквизита);
		
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ЭлементDOM = ЭлементDOMРеквизит;
		НоваяСтрока.ИмяРеквизита = ИмяРеквизита;
		НоваяСтрока.МассивВозможныхПутей = МассивВозможныхПутей;
		
	КонецЦикла;
	
	Если ПолучитьПодчиненныеРеквизиты Тогда
		
		Для Каждого ЭлементСоответствия Из СоответствиеРеквизитовДляПоиска Цикл
			
			ВыражениеДляПоиска = "xmlns:Columns/xmlns:Column/@name";
			
			РезультатXPath = ВычислитьВыражениеXPath(ВыражениеДляПоиска, ДокументDOM, ЭлементСоответствия.Значение);
			Пока Истина Цикл
				
				АтрибутDOMИмяРеквизита = РезультатXPath.ПолучитьСледующий();
				Если АтрибутDOMИмяРеквизита = Неопределено Тогда
					Прервать;
				КонецЕсли;
				
				ИмяРеквизита = АтрибутDOMИмяРеквизита.ТекстовоеСодержимое;
				Если ПустаяСтрока(ИмяРеквизита) Тогда
					Продолжить;
				КонецЕсли;
				
				ПутьРеквизита = СтрШаблон("%1.%2", ЭлементСоответствия.Ключ, ИмяРеквизита);
				
				МассивВозможныхПутей = Новый Массив;
				МассивВозможныхПутей.Добавить(ПутьРеквизита);
				МассивВозможныхПутей.Добавить(СтрШаблон("%1[0].%2", ЭлементСоответствия.Ключ, ИмяРеквизита));
				МассивВозможныхПутей.Добавить(СтрШаблон("Items.%1.CurrentData.%2", ЭлементСоответствия.Ключ, ИмяРеквизита));
				
				НоваяСтрока = ТаблицаРеквизитов.Добавить();
				НоваяСтрока.ЭлементDOM = АтрибутDOMИмяРеквизита.ЭлементВладелец;
				НоваяСтрока.ИмяРеквизита = ПутьРеквизита;
				НоваяСтрока.МассивВозможныхПутей = МассивВозможныхПутей;
				
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаРеквизитов;
	
КонецФункции

#КонецОбласти

#Область ЛокализацияРеквизитовФормEDT

Функция ОчиститьЗаголовкиРеквизитовФормыНеРазмещенныхНаФормеEDT(ДокументDOM)
	
	ФормаИзменена = Ложь;
	
	МассивРеквизитов = ПолучитьРеквизитыФормыНеРазмещенныеНаФормеEDT(ДокументDOM);
	
	Для Каждого ЭлементDOMРеквизит Из МассивРеквизитов Цикл
		
		РезультатXPath = ВычислитьВыражениеXPath("title/value", ДокументDOM, ЭлементDOMРеквизит);
		Пока Истина Цикл
			
			ЭлементDOMЗаголовок = РезультатXPath.ПолучитьСледующий();
			Если ЭлементDOMЗаголовок = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
			Если ПустаяСтрока(ЭлементDOMЗаголовок.ТекстовоеСодержимое) Тогда
				Продолжить;
			КонецЕсли;
			
			ЭлементDOMЗаголовок.ТекстовоеСодержимое = "";
			ФормаИзменена = Истина;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ФормаИзменена;
	
КонецФункции

Функция ПолучитьРеквизитыФормыНеРазмещенныеНаФормеEDT(ДокументDOM)
	
	МассивРеквизитов = Новый Массив;
	
	ТаблицаРеквизитов = ПолучитьРеквизитыФормыEDT(ДокументDOM);
	Для Каждого СтрокаТаблицы Из ТаблицаРеквизитов Цикл
		
		ЭлементDOMРеквизит = СтрокаТаблицы.ЭлементDOM;
		МассивВозможныхПутей = СтрокаТаблицы.МассивВозможныхПутей;
		
		РеквизитНайден = Ложь;
		ШаблонДляПоиска = "//dataPath[segments=""%1""]|//dataPath/paths[segments=""%1""]";
		
		Для Каждого ЭлементМассива Из МассивВозможныхПутей Цикл
			ВыражениеПоиска = СтрШаблон(ШаблонДляПоиска, ЭлементМассива);
			
			ЭлементDOMПутьКРеквизиту = ПолучитьЭлементDOMПоВыражениюXPath(ВыражениеПоиска, ДокументDOM);
			Если ЭлементDOMПутьКРеквизиту <> Неопределено Тогда
				РеквизитНайден = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ РеквизитНайден Тогда
			МассивРеквизитов.Добавить(ЭлементDOMРеквизит);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивРеквизитов;
	
КонецФункции

Функция ПолучитьРеквизитыФормыEDT(ДокументDOM, ПолучитьПодчиненныеРеквизиты = Истина)
	
	ТаблицаРеквизитов = Новый ТаблицаЗначений;
	ТаблицаРеквизитов.Колонки.Добавить("ЭлементDOM");
	ТаблицаРеквизитов.Колонки.Добавить("ИмяРеквизита");
	ТаблицаРеквизитов.Колонки.Добавить("МассивВозможныхПутей");
	
	СоответствиеРеквизитовДляПоиска = Новый Соответствие;
	
	РезультатXPath = ВычислитьВыражениеXPath("/form:Form/attributes/name", ДокументDOM);
	Пока Истина Цикл
		
		ЭлементDOMИмяРеквизита = РезультатXPath.ПолучитьСледующий();
		Если ЭлементDOMИмяРеквизита = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		ИмяРеквизита = ЭлементDOMИмяРеквизита.ТекстовоеСодержимое;
		Если ПустаяСтрока(ИмяРеквизита) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементDOMРеквизит = ЭлементDOMИмяРеквизита.РодительскийУзел;
		СоответствиеРеквизитовДляПоиска.Вставить(ИмяРеквизита, ЭлементDOMРеквизит);
		
		МассивВозможныхПутей = Новый Массив;
		МассивВозможныхПутей.Добавить(ИмяРеквизита);
		
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ЭлементDOM = ЭлементDOMРеквизит;
		НоваяСтрока.ИмяРеквизита = ИмяРеквизита;
		НоваяСтрока.МассивВозможныхПутей = МассивВозможныхПутей;
		
	КонецЦикла;
	
	Если ПолучитьПодчиненныеРеквизиты Тогда
		
		Для Каждого ЭлементСоответствия Из СоответствиеРеквизитовДляПоиска Цикл
			
			ВыражениеДляПоиска = "columns/name";
			
			РезультатXPath = ВычислитьВыражениеXPath(ВыражениеДляПоиска, ДокументDOM, ЭлементСоответствия.Значение);
			Пока Истина Цикл
				
				ЭлементDOMИмяРеквизита = РезультатXPath.ПолучитьСледующий();
				Если ЭлементDOMИмяРеквизита = Неопределено Тогда
					Прервать;
				КонецЕсли;
				
				ИмяРеквизита = ЭлементDOMИмяРеквизита.ТекстовоеСодержимое;
				Если ПустаяСтрока(ИмяРеквизита) Тогда
					Продолжить;
				КонецЕсли;
				
				ПутьРеквизита = СтрШаблон("%1.%2", ЭлементСоответствия.Ключ, ИмяРеквизита);
				
				МассивВозможныхПутей = Новый Массив;
				МассивВозможныхПутей.Добавить(ПутьРеквизита);
				МассивВозможныхПутей.Добавить(СтрШаблон("%1[0].%2", ЭлементСоответствия.Ключ, ИмяРеквизита));
				МассивВозможныхПутей.Добавить(СтрШаблон("Элементы.%1.ТекущиеДанные.%2", ЭлементСоответствия.Ключ, ИмяРеквизита));
				МассивВозможныхПутей.Добавить(СтрШаблон("Items.%1.CurrentData.%2", ЭлементСоответствия.Ключ, ИмяРеквизита));
				
				НоваяСтрока = ТаблицаРеквизитов.Добавить();
				НоваяСтрока.ЭлементDOM = ЭлементDOMИмяРеквизита.РодительскийУзел;
				НоваяСтрока.ИмяРеквизита = ПутьРеквизита;
				НоваяСтрока.МассивВозможныхПутей = МассивВозможныхПутей;
				
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаРеквизитов;
	
КонецФункции

Функция ЗаполнитьЗаголовкиКолонокРеквизитаФормыEDT(ДокументDOM, ТаблицаИсключенийЗаголовковЭлементовФорм)
	
	ФормаИзменена = Ложь;
	
	ВыражениеПоискаПоТипуРеквизита = "//attributes/valueType/types[text()='ValueTable']";
	ВыражениеПоискаКолонокРеквизита = "columns";
	
	РезультатXPath = ВычислитьВыражениеXPath(ВыражениеПоискаПоТипуРеквизита, ДокументDOM);
	
	Пока Истина Цикл
		
		// Получаем элемент, у которого тип "Таблица значений".
		ЭлементDOMТипТаблицаЗначений = РезультатXPath.ПолучитьСледующий();
		Если ЭлементDOMТипТаблицаЗначений = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		// Получаем элемент, который является родителем найденного элемента. У родителя тег Type.
		ЭлементDOMValueType = ЭлементDOMТипТаблицаЗначений.РодительскийУзел;
		Если ЭлементDOMValueType = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Получаем реквизит.
		ЭлементDOMРеквизит = ЭлементDOMValueType.РодительскийУзел;
		Если ЭлементDOMРеквизит = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Получаем имя найденного реквизита. Оно будет нужно для формирования полного имени реквизита.
		ИмяРеквизита = ПолучитьИмяЭлементаEDT(ДокументDOM, ЭлементDOMРеквизит);
		Если ПустаяСтрока(ИмяРеквизита) Тогда
			Продолжить;
		КонецЕсли;
		
		РезультатXPathДляКолонок = ВычислитьВыражениеXPath(ВыражениеПоискаКолонокРеквизита, ДокументDOM, ЭлементDOMРеквизит);
		
		Пока Истина Цикл
			
			// Перебираем все колонки у реквизита формы.
			ЭлементDOMКолонка = РезультатXPathДляКолонок.ПолучитьСледующий();
			Если ЭлементDOMКолонка = Неопределено Тогда
				Прервать;
			КонецЕсли;
		
			ЗаголовокКолонки = ПолучитьЗаголовокЭлементаEDT(ДокументDOM, ЭлементDOMКолонка, КодОсновногоЯзыка);
			Если НЕ ПустаяСтрока(ЗаголовокКолонки) Тогда
				Продолжить;
			КонецЕсли;
			
			// Получаем имя колонки реквизита. Оно будет нужно для формирования полного имени реквизита.
			ИмяКолонки = ПолучитьИмяЭлементаEDT(ДокументDOM, ЭлементDOMКолонка);
			Если ПустаяСтрока(ИмяКолонки) Тогда
				Продолжить;
			КонецЕсли;
			
			// Формируем полное имя реквизита.
			ПутьКДанным = ИмяРеквизита + "." + ИмяКолонки;
			
			// Получаем все элементы, у которых в пути к данным задано полное имя реквизита.
			МассивЭлементов = ПолучитьЭлементыФормыПоРеквизитуEDT(ДокументDOM, ПутьКДанным);
			Если МассивЭлементов.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗаголовокРеквизита = Ложь;
			
			// Проверяем все заголовки найденных реквизитов.
			Для Каждого ЭлементМассива Из МассивЭлементов Цикл
				ЗаголовокЭлементаНаФорме = ПолучитьЗаголовокЭлементаEDT(ДокументDOM, ЭлементМассива, КодОсновногоЯзыка);
				Если ПустаяСтрока(ЗаголовокЭлементаНаФорме) Тогда
					ЗаполнитьЗаголовокРеквизита = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ЗаполнитьЗаголовокРеквизита Тогда
				НовыйЗаголовокРеквизитаФормы = ПолучитьЗаголовокПоИмениЭлементаФормы(ИмяКолонки, ТаблицаИсключенийЗаголовковЭлементовФорм);
				УстановитьЗаголовокЭлементаEDT(ДокументDOM, ЭлементDOMКолонка, НовыйЗаголовокРеквизитаФормы, КодОсновногоЯзыка);
				ФормаИзменена = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ФормаИзменена;
	
КонецФункции

Функция ЗаполнитьЗаголовкиСвойствСпискаЗначенийEDT(ДокументDOM)
	
	ФормаИзменена = Ложь;
	
	СвойстваЭлементаСпискаЗначений = Новый СписокЗначений;
	СвойстваЭлементаСпискаЗначений.Добавить("Value", "Значение");
	СвойстваЭлементаСпискаЗначений.Добавить("Picture", "Картинка");
	СвойстваЭлементаСпискаЗначений.Добавить("Check", "Пометка");
	СвойстваЭлементаСпискаЗначений.Добавить("Presentation", "Представление");
	СвойстваЭлементаСпискаЗначений.Добавить("Значение", "Значение");
	СвойстваЭлементаСпискаЗначений.Добавить("Картинка", "Картинка");
	СвойстваЭлементаСпискаЗначений.Добавить("Пометка", "Пометка");
	СвойстваЭлементаСпискаЗначений.Добавить("Представление", "Представление");
	
	ВыражениеПоискаПоТипуРеквизита = "//attributes/valueType/types[text()='ValueList']";
	РезультатXPath = ВычислитьВыражениеXPath(ВыражениеПоискаПоТипуРеквизита, ДокументDOM);
	Пока Истина Цикл
		
		ЭлементDOMv8Types = РезультатXPath.ПолучитьСледующий();
		Если ЭлементDOMv8Types = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		ЭлементDOMValueType = ЭлементDOMv8Types.РодительскийУзел;
		Если ЭлементDOMValueType = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементDOMРеквизит = ЭлементDOMValueType.РодительскийУзел;
		Если ЭлементDOMРеквизит = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяРеквизита = ПолучитьИмяЭлементаEDT(ДокументDOM, ЭлементDOMРеквизит);
		Если ПустаяСтрока(ИмяРеквизита) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СвойствоЭлементаСпискаЗначений Из СвойстваЭлементаСпискаЗначений Цикл
			
			ИмяСвойства = СвойствоЭлементаСпискаЗначений.Значение;
			ПолноеИмяСвойстваЭлемента = СтрШаблон("%1.%2", ИмяРеквизита, ИмяСвойства);
			МассивЭлементов = ПолучитьЭлементыФормыПоРеквизитуEDT(ДокументDOM, ПолноеИмяСвойстваЭлемента);
			
			Если МассивЭлементов.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаголовокСвойства = СвойствоЭлементаСпискаЗначений.Представление;
			
			Для Каждого ЭлементDOMЭлементаФормы Из МассивЭлементов Цикл
				
				ЗаголовокЭлемента = ПолучитьЗаголовокЭлементаEDT(ДокументDOM, ЭлементDOMЭлементаФормы);
				Если ПустаяСтрока(ЗаголовокЭлемента) Тогда
					УстановитьЗаголовокЭлементаEDT(ДокументDOM, ЭлементDOMЭлементаФормы, ЗаголовокСвойства, КодОсновногоЯзыка);
					ФормаИзменена = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ФормаИзменена;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ЛокализацияРегламентныхЗаданий

#Область ЛокализацияРегламентныхЗаданийXML

// Очищает наименование предопределенного регламентного задания, если оно совпадает с синонимом.
//
Функция ОчиститьНаименованиеПредопределенногоРегламентногоЗадания(ДокументDOM)
	
	ОбъектИзменен = Ложь;
	
	// Если регламентное задание не предопределенное, то выходим.
	Предопределенное = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath("//xmlns:Predefined", ДокументDOM,, Ложь);
	Если НЕ Булево(Предопределенное) Тогда
		Возврат ОбъектИзменен;
	КонецЕсли;
	
	ЭлементDOMНаименование = ПолучитьЭлементDOMПоВыражениюXPath("//xmlns:Description", ДокументDOM);
	Если ЭлементDOMНаименование = Неопределено Тогда
		// Если наименование не задано, то очищать нечего, выходим.
		Возврат ОбъектИзменен;
	КонецЕсли;
	
	Наименование = ЭлементDOMНаименование.ТекстовоеСодержимое;
	Если ПустаяСтрока(Наименование) Тогда
		// Если наименование не задано, то очищать нечего, выходим.
		Возврат ОбъектИзменен;
	КонецЕсли;
	
	Наименование = ПреобразоватьТекстДляСравнения(Наименование);
	
	// Получаем синонимы регламентного задания на различных языках.
	РезультатXPath = ВычислитьВыражениеXPath("//xmlns:Synonym/v8:item/v8:content", ДокументDOM);
	Пока Истина Цикл
		
		ЭлементDOMСиноним = РезультатXPath.ПолучитьСледующий();
		Если ЭлементDOMСиноним = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		Синоним = ЭлементDOMСиноним.ТекстовоеСодержимое;
		Если ПустаяСтрока(Синоним) Тогда
			Продолжить;
		КонецЕсли;
		
		// Если синоним совпадает с наименованием, то прерываем.
		Если ПреобразоватьТекстДляСравнения(Синоним) = Наименование Тогда
			ОбъектИзменен = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОбъектИзменен Тогда
		// Если синоним совпадает с наименованием, то очищаем наименование.
		ЭлементDOMНаименование.ТекстовоеСодержимое = "";
	КонецЕсли;
	
	Возврат ОбъектИзменен;
	
КонецФункции

#КонецОбласти

#Область ЛокализацияРегламентныхЗаданийEDT

// Очищает наименование предопределенного регламентного задания, если оно совпадает с синонимом.
//
Функция ОчиститьНаименованиеПредопределенногоРегламентногоЗаданияEDT(ДокументDOM)
	
	ОбъектИзменен = Ложь;
	
	Предопределенное = ПолучитьЗначениеЭлементаDOMПоВыражениюXPath("/mdclass:ScheduledJob/predefined", ДокументDOM,, Ложь);
	Если НЕ Булево(Предопределенное) Тогда
		// Если регламентное задание не предопределенное, то выходим.
		Возврат ОбъектИзменен;
	КонецЕсли;
	
	ЭлементDOMНаименование = ПолучитьЭлементDOMПоВыражениюXPath("/mdclass:ScheduledJob/description", ДокументDOM);
	Если ЭлементDOMНаименование = Неопределено Тогда
		// Если наименование не задано, то очищать нечего, выходим.
		Возврат ОбъектИзменен;
	КонецЕсли;
	
	Наименование = ЭлементDOMНаименование.ТекстовоеСодержимое;
	Если ПустаяСтрока(Наименование) Тогда
		// Если наименование не задано, то очищать нечего, выходим.
		Возврат ОбъектИзменен;
	КонецЕсли;
	
	Наименование = ПреобразоватьТекстДляСравнения(Наименование);
	
	// Получаем синонимы регламентного задания на различных языках.
	РезультатXPath = ВычислитьВыражениеXPath("/mdclass:ScheduledJob/synonym/value", ДокументDOM);
	Пока Истина Цикл
		
		ЭлементDOMСиноним = РезультатXPath.ПолучитьСледующий();
		Если ЭлементDOMСиноним = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		Синоним = ЭлементDOMСиноним.ТекстовоеСодержимое;
		Если ПустаяСтрока(Синоним) Тогда
			Продолжить;
		КонецЕсли;
		
		// Если синоним совпадает с наименованием, то прерываем.
		Если ПреобразоватьТекстДляСравнения(Синоним) = Наименование Тогда
			ОбъектИзменен = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОбъектИзменен Тогда
		// Если синоним совпадает с наименованием, то очищаем наименование.
		ЭлементDOMНаименование.ТекстовоеСодержимое = "";
	КонецЕсли;
	
	Возврат ОбъектИзменен;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбщиеТребованияККонфигурации

Функция ТаблицыЗначенийРавны(Таблица1, Таблица2)
	
	Если Таблица1.Колонки.Количество() <> Таблица2.Колонки.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Таблица1.Количество() <> Таблица2.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТаблицыРавны = Истина;
	Для Каждого Таблица1Колонка Из Таблица1.Колонки Цикл
		// Проверяем наличие каждой колонки одной таблицы в другой.
		ИмяКолонки = Таблица1Колонка.Имя;
		Если Таблица2.Колонки.Найти(ИмяКолонки) = Неопределено Тогда
			ТаблицыРавны = Ложь;
			Прервать;
		КонецЕсли;
		
		Для НомерСтроки = 0 По Таблица1.Количество() - 1 Цикл
			
			Если Таблица1[НомерСтроки][ИмяКолонки] <> Таблица2[НомерСтроки][ИмяКолонки] Тогда
				ТаблицыРавны = Ложь;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ ТаблицыРавны Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицыРавны;
	
КонецФункции

Функция УдалитьБитыеСсылкиНаОбъектыПодсистемы(ДокументDOM)
	
	ФайлИзменен = Ложь;
	
	Если ЭтоВыгрузкаXMLФайлов Тогда
		ЭлементDOMПодчиненныеОбъекты = ПолучитьЭлементDOMПоВыражениюXPath("//xmlns:Content", ДокументDOM);
	Иначе
		ЭлементDOMПодчиненныеОбъекты = ПолучитьЭлементDOMПоВыражениюXPath("/mdclass:Subsystem", ДокументDOM);
	КонецЕсли;
	
	Если ЭлементDOMПодчиненныеОбъекты = Неопределено Тогда
		// Если подчиненных объектов нет, выходим.
		Возврат ФайлИзменен;
	КонецЕсли;
	
	ДочерниеУзлы = ЭлементDOMПодчиненныеОбъекты.ДочерниеУзлы;
	Если ДочерниеУзлы.Количество() = 0 Тогда
		// Если подчиненных объектов нет, выходим.
		Возврат ФайлИзменен;
	КонецЕсли;
	
	МассивДочернихУзловБитыхСсылок = Новый Массив;
	Для Каждого ДочернийУзел Из ДочерниеУзлы Цикл
		
		// Для выгрузки EDT проверяем имя узла.
		Если (НЕ ЭтоВыгрузкаXMLФайлов) И (ДочернийУзел.ИмяУзла <> "content") Тогда
			Продолжить;
		КонецЕсли;
		
		НаименованиеУдаленногоОбъекта = ДочернийУзел.ТекстовоеСодержимое;
		
		// Если наименование дочернего узла - это уникальный идентификатор, то добавляем дочерний узел в отдельный массив.
		Если ЭтоУникальныйИдентификатор(НаименованиеУдаленногоОбъекта) Тогда
			МассивДочернихУзловБитыхСсылок.Добавить(ДочернийУзел);
		КонецЕсли;
		
	КонецЦикла;
	
	// Если в массиве для удаления нет дочерних узлов, то выходим.
	Если МассивДочернихУзловБитыхСсылок.Количество() = 0 Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	ФайлИзменен = Истина;
	
	Для Каждого ДочернийУзелБитойСсылки Из МассивДочернихУзловБитыхСсылок Цикл
		ЭлементDOMПодчиненныеОбъекты.УдалитьДочерний(ДочернийУзелБитойСсылки);
	КонецЦикла;
	
	Возврат ФайлИзменен;
	
КонецФункции

Функция СортироватьОбъектыМетаданных(ДокументDOM)
	
	ПорядокИзменен = Ложь;
	
	Если ЭтоВыгрузкаXMLФайлов Тогда
		ЭлементDOMПодчиненныеОбъекты = ПолучитьЭлементDOMПоВыражениюXPath("//xmlns:ChildObjects", ДокументDOM);
	Иначе
		ЭлементDOMПодчиненныеОбъекты = ПолучитьЭлементDOMПоВыражениюXPath("/mdclass:Configuration", ДокументDOM);
	КонецЕсли;
	
	Если ЭлементDOMПодчиненныеОбъекты = Неопределено Тогда
		// Если подчиненных объектов нет, выходим.
		Возврат ПорядокИзменен;
	КонецЕсли;
	
	ДочерниеУзлы = ЭлементDOMПодчиненныеОбъекты.ДочерниеУзлы;
	Если ДочерниеУзлы.Количество() = 0 Тогда
		// Если подчиненных объектов нет, выходим.
		Возврат ПорядокИзменен;
	КонецЕсли;
	
	ТаблицаТиповОбъектовИнициализировать();
	
	// Заполним подчиненные объекты в таблицу значений для сортировки.
	ТаблицаОбъектов = Новый ТаблицаЗначений;
	ТаблицаОбъектов.Колонки.Добавить("ДочернийУзел");
	ТаблицаОбъектов.Колонки.Добавить("ИмяОбъекта");
	ТаблицаОбъектов.Колонки.Добавить("ТипОбъекта");
	ТаблицаОбъектов.Колонки.Добавить("НомерТипаОбъекта");       // Поле для сортировки.
	ТаблицаОбъектов.Колонки.Добавить("НомерОбъектаИсключения"); // Поле для сортировки.
	ТаблицаОбъектов.Колонки.Добавить("ПрефиксУдалить");         // Поле для сортировки.
	
	// Типы объектов, которые могут располагаться в любом порядке.
	МассивИсключенийТиповОбъектов = Новый Массив;
	МассивИсключенийТиповОбъектов.Добавить(ВРег("CommonAttribute"));
	МассивИсключенийТиповОбъектов.Добавить(ВРег("CommandGroup"));
	
	// Типы объектов, которые содержат данные.
	МассивТиповОбъектовСодержащихДанные = Контекст["МассивТиповОбъектовСодержащихДанные"];
	
	МассивТекстУдалить = Контекст["МассивТекстУдалить"];
	
	НомерТипаОбъекта = -1;
	НомерОбъектаИсключения = -1;
	
	Для Каждого ДочернийУзел Из ДочерниеУзлы Цикл
		
		ТипОбъекта = ДочернийУзел.ИмяЭлемента;
		ИмяОбъекта = ДочернийУзел.ТекстовоеСодержимое;
		
		// Файл конфигурации со списком объектов в проекте EDT отличается от стандартной выгрузки XML.
		// Обработаем этот файл в отдельном условии.
		Если НЕ ЭтоВыгрузкаXMLФайлов Тогда
			
			// В выгрузке EDT в имени элемента дочернего узла хранится тип объекта с маленькой буквы.
			// Заменим первую букву на верхний регистр.
			ТипОбъекта = ВРег(Лев(ТипОбъекта, 1)) + Сред(ТипОбъекта, 2);
			
			// В выгрузке EDT по заданному "/mdclass:Configuration" содержится большое количество лишней информации,
			// например, свойства конфигурации,
			// поэтому проверяем имя узла (тип объекта) в таблице всех типов.
			Если ТаблицаТиповОбъектов.Найти(ТипОбъекта, "ИмяАнглМнФормы") = Неопределено Тогда
				// Если не нашли, то пропускаем, т.к. это скорее всего не объект.
				Продолжить;
			КонецЕсли;
			
			// В выгрузке EDT языки выгружаются в структуре, отличной от других объектов.
			ЭтоЯзык = (СтрСравнить(ТипОбъекта, "Languages") = 0);
			Если ЭтоЯзык Тогда
				// Наименование самого языка хранится внутри дочернего узла.
				СписокЭлементов = ДочернийУзел.ПолучитьЭлементыПоИмени("name");
				Если СписокЭлементов.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ТипОбъекта = "Language";
				ИмяОбъекта = СписокЭлементов[0].ТекстовоеСодержимое;
			Иначе
				// В выгрузке EDT в текстовом содержимом дочернего узла хранится тип в ед.ч. и имя объекта.
				// Переопределим тип и имя объекта оттуда.
				МассивЭлементовИмени = СтрРазделить(ИмяОбъекта, ".", Ложь);
				Если МассивЭлементовИмени.Количество() < 2 Тогда
					Продолжить;
				КонецЕсли;
				
				ТипОбъекта = МассивЭлементовИмени[0];
				ИмяОбъекта = МассивЭлементовИмени[1];
			КонецЕсли;
			
		КонецЕсли;
		
		// Устанавливаем номер типа объекта в таблице объектов.
		СтрокаОбъекта = ТаблицаОбъектов.Найти(ТипОбъекта, "ТипОбъекта");
		НомерТипаОбъекта = ?(СтрокаОбъекта = Неопределено, НомерТипаОбъекта + 1, СтрокаОбъекта.НомерТипаОбъекта);
		
		ТипОбъектаВРег = ВРег(ТипОбъекта);
		
		// Устанавливаем номера для объектов из типов-исключений, которые не надо сортировать.
		НомерОбъектаИсключения = ?(МассивИсключенийТиповОбъектов.Найти(ТипОбъектаВРег) = Неопределено, - 1, НомерОбъектаИсключения + 1);
		
		// Устанавливаем флаг "ПрефиксУдалить" для объектов, которые содержат данные.
		ПрефиксУдалить = Ложь;
		Если МассивТиповОбъектовСодержащихДанные.Найти(ТипОбъектаВРег) <> Неопределено Тогда
			ПрефиксУдалить = СтрНачинаетсяСПоМассиву(ВРег(ИмяОбъекта), МассивТекстУдалить).Успешно;
		КонецЕсли;
		
		СтрокаОбъекта = ТаблицаОбъектов.Добавить();
		СтрокаОбъекта.ДочернийУзел = ДочернийУзел;
		СтрокаОбъекта.ИмяОбъекта = ИмяОбъекта;
		СтрокаОбъекта.ТипОбъекта = ТипОбъекта;
		СтрокаОбъекта.НомерТипаОбъекта = НомерТипаОбъекта;
		СтрокаОбъекта.НомерОбъектаИсключения = НомерОбъектаИсключения;
		СтрокаОбъекта.ПрефиксУдалить = ПрефиксУдалить;
		
	КонецЦикла;
	
	ТаблицаОбъектовИсходная = ТаблицаОбъектов.Скопировать();
	
	ТаблицаОбъектов.Сортировать("НомерТипаОбъекта, НомерОбъектаИсключения, ПрефиксУдалить, ИмяОбъекта");
	
	Если ТаблицыЗначенийРавны(ТаблицаОбъектов, ТаблицаОбъектовИсходная) Тогда
		Возврат ПорядокИзменен;
	КонецЕсли;
	
	ПорядокИзменен = Истина;
	
	// Если объекты одного или нескольких типов были отсортированы не по порядку, то заполняем дочерние узлы заново.
	Для Каждого СтрокаОбъекта Из ТаблицаОбъектов Цикл
		ЭлементDOMПодчиненныеОбъекты.ДобавитьДочерний(СтрокаОбъекта.ДочернийУзел);
	КонецЦикла;
	
	Возврат ПорядокИзменен;
	
КонецФункции

Функция УдалитьИзбыточноеОбращениеКОбъектуВКодеМодуля(Знач ПолноеИмяФайла, ДокументТекст)
	
	ФайлИзменен = Ложь;
	
	ТипМодуля = ПолучитьТипМодуляПоИмениФайла(ПолноеИмяФайла);
	
	// Пропускаем модули менеджеров, т.к. в них невозможно обращение по "ЭтотОбъект.".
	Если ТипМодуля = "МодульМенеджера" Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	ПолноеИмяФайла = ВРег(ПолноеИмяФайла);
	
	// Пропускаем следующие типы объектов с модулями, т.к. не имеют свойства ЭтотОбъект или ЭтаФорма.
	МассивИсключенийТипов = Новый Массив;
	МассивИсключенийТипов.Добавить("WebServices");      // - WebСервисы
	МассивИсключенийТипов.Добавить("HTTPServices");     // - HTTPСервисы
	МассивИсключенийТипов.Добавить("DocumentJournals"); // - ЖурналыДокументов
	МассивИсключенийТипов.Добавить("Enums");            // - Перечисления
	МассивИсключенийТипов.Добавить("SettingsStorages"); // - ХранилищаНастроек
	МассивИсключенийТипов.Добавить("Ext");              // - Конфигурация
	
	КаталогВыгрузкиКопия = ОтредактироватьПутьККаталогу(КаталогВыгрузкиРезультат);
	
	ОбъектЯвляетсяИсключением = Ложь;
	Для Каждого ИсключениеТипа Из МассивИсключенийТипов Цикл
		
		Если ЭтоВыгрузкаXMLФайлов Тогда
			КаталогТиповОбъектов = КаталогВыгрузкиКопия + ИсключениеТипа + РазделительПути;
		Иначе
			КаталогТиповОбъектов = СтрШаблон("%1src%2%3%2", КаталогВыгрузкиКопия, РазделительПути, ИсключениеТипа);
		КонецЕсли;
		
		Если СтрНачинаетсяС(ПолноеИмяФайла, ВРег(КаталогТиповОбъектов)) Тогда
			ОбъектЯвляетсяИсключением = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОбъектЯвляетсяИсключением Тогда
		Возврат ФайлИзменен;
	КонецЕсли;
	
	// Заполняем массив обращений для поиска в зависимости от типа объекта.
	МассивОбращений = Новый Массив;
	
	Если ТипМодуля = "ОбщийМодуль" Тогда
		
		// Если это общий модуль, то учитываем обращение по имени, кроме модулей с повторным использованием.
		Если ЭтоВыгрузкаXMLФайлов Тогда
			КаталогОбщихМодулей = КаталогВыгрузкиКопия + "CommonModules" + РазделительПути;
		Иначе
			КаталогОбщихМодулей = КаталогВыгрузкиКопия + "src" + РазделительПути + "CommonModules" + РазделительПути;
		КонецЕсли;
		
		ИмяМодуля = СтрЗаменить(ПолноеИмяФайла, ВРег(КаталогОбщихМодулей), "");
		МассивКаталогов = СтрРазделить(ИмяМодуля, РазделительПути, Ложь);
		Если МассивКаталогов.Количество() = 0 Тогда
			Возврат ФайлИзменен;
		КонецЕсли;
		
		ИмяМодуля = МассивКаталогов[0];
		
		// Пропускаем общие модули с постфиксом "ПовтИсп".
		Если СтрНайти(ИмяМодуля, ВРег(НСтр("ru='ПовтИсп'; en='Cached'", КодОсновногоЯзыка))) > 0 Тогда
			Возврат ФайлИзменен;
		КонецЕсли;
		
		МассивОбращений.Добавить(ИмяМодуля + ".");
		
	ИначеЕсли ТипМодуля = "МодульФормы" Тогда
		// Если это форма, то пропускаем ее, т.к. удалять для нее нечего:
		// Обращение "ЭтаФорма" удалять нельзя, т.к. очень часто реквизиты на форму добавляются программно,
		// и обращение к ним возможно только через "ЭтаФорма", например, "ЭтаФорма.Объект".
		// Обращение "ЭтотОбъект" удалять нельзя, т.к. в большинстве случаев это обращение к родительскому объекту формы, и без него будет синтаксическая ошибка.
		Возврат ФайлИзменен;
	Иначе
		// Для любого другого объекта учитываем только обращение "ЭтотОбъект".
		МассивОбращений.Добавить(ВРег("ЭтотОбъект") + ".");
		МассивОбращений.Добавить(ВРег("ThisObject") + ".");
	КонецЕсли;
	
	СтрокаДоступныхСимволов = " (,;+-*/=<>" + Символы.Таб + Символы.ПС;
	
	ТекстМодуляИсходный = ДокументТекст.ПолучитьТекст();
	ТекстМодуля = ВРег(ТекстМодуляИсходный);
	
	ТаблицаМетодов = ПолучитьТаблицуПроцедурИФункций(ТекстМодуляИсходный);
	
	Для Каждого Обращение Из МассивОбращений Цикл
		
		ОбращениеБезТочки = СтрЗаменить(Обращение, ".", "");
		ОбращениеБезТочки = СокрЛП(ОбращениеБезТочки);
		
		ПозицияПоиска = 0;
		Пока Истина Цикл
			
			ПозицияПоиска = СтрНайти(ТекстМодуля, Обращение,, ПозицияПоиска + 1);
			Если ПозицияПоиска = 0 Тогда
				Прервать;
			КонецЕсли;
			
			// Проверяем символ перед обращением.
			// Если его нет среди разрешенных, то ищем дальше.
			ПредыдущийСимвол = Сред(ТекстМодуля, ПозицияПоиска - 1, 1);
			Если СтрНайти(СтрокаДоступныхСимволов, ПредыдущийСимвол) = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			// Ищем процедуру или функцию, в которой найдено обращение.
			МассивПараметров = Новый Массив;
			Для Каждого СтрокаМетода Из ТаблицаМетодов Цикл
				Если (ПозицияПоиска > СтрокаМетода.ПозицияКонцаОписания)
				   И (ПозицияПоиска < СтрокаМетода.ПозицияКонцаМетода) Тогда
					МассивПараметров = СтрокаМетода.МассивПараметров;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			// Проверяем параметры процедуры или функции, в которой найдено обращение.
			// Если у метода есть параметр, совпадающий с обращением, например, "ЭтотОбъект",
			// то такое обращение удалять нельзя, пропускаем.
			НайденПараметрПоИмениОбращения = Ложь;
			Для Каждого ПараметрМетода Из МассивПараметров Цикл
				ПараметрМетода = ПолучитьИмяПараметра(ПараметрМетода);
				Если ВРег(ПараметрМетода) = ОбращениеБезТочки Тогда
					НайденПараметрПоИмениОбращения = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НайденПараметрПоИмениОбращения Тогда
				Продолжить;
			КонецЕсли;
			
			НомерСтроки = ПолучитьНомерСтрокиМодуля(ТекстМодуля, ПозицияПоиска);
			
			// Получаем строку в исходном виде.
			СтрокаМодуляИсходная = ДокументТекст.ПолучитьСтроку(НомерСтроки);
			СтрокаМодуля = ВРег(СтрокаМодуляИсходная);
			СтрокаМодуля = УдалитьКомментарийИзСтроки(СтрокаМодуля);
			
			Если ПустаяСтрока(СтрокаМодуля) Тогда
				Продолжить;
			КонецЕсли;
			
			ПозицияПоискаВСтроке = СтрНайти(СтрокаМодуля, Обращение);
			Если ПозицияПоискаВСтроке = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			// Проверяем находится ли найденное обращение в кавычках.
			СтрокаДоОбращения = Лев(СтрокаМодуля, ПозицияПоискаВСтроке - 1);
			СтрокаДоОбращения = СокрЛ(СтрокаДоОбращения);
			КоличествоКавычекДоОбращения = СтрЧислоВхождений(СтрокаДоОбращения, """");
			
			КоличествоКавычекЧетное = (КоличествоКавычекДоОбращения % 2 = 0);
			
			// Если обращение в кавычках, то пропускаем.
			Если (КоличествоКавычекЧетное И СтрНачинаетсяС(СтрокаДоОбращения, "|"))
			 ИЛИ (НЕ КоличествоКавычекЧетное) Тогда
				Продолжить;
			КонецЕсли;
			
			// Удаляем обращение к объекту, т.к. оно лишнее.
			СтрокаМодуляДо = Лев(СтрокаМодуляИсходная, ПозицияПоискаВСтроке - 1);
			СтрокаМодуляПосле = Сред(СтрокаМодуляИсходная, ПозицияПоискаВСтроке + СтрДлина(Обращение));
			СтрокаМодуляЗамена = СтрокаМодуляДо + СтрокаМодуляПосле;
			
			ДокументТекст.ЗаменитьСтроку(НомерСтроки, СтрокаМодуляЗамена);
			ФайлИзменен = Истина;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ФайлИзменен;
	
КонецФункции

#КонецОбласти

#Область ПодсказкаИПроверкаЗаполнения

#Область ПодсказкаИПроверкаЗаполненияXML

// Удаляет подсказки у реквизитов, измерений, ресурсов и т.п., у которых они совпадают с синонимом или образованы из имени.
//
Функция ОчиститьПодсказкиРеквизитов(ДокументDOM, ТаблицаТиповОбъектовРеквизит)
	
	РеквизитИзменен = Ложь;
	
	Для Каждого СтрокаТипаОбъектаРеквизит Из ТаблицаТиповОбъектовРеквизит Цикл
		
		ТипОбъекта = СтрокаТипаОбъектаРеквизит.ТипОбъекта;
		ВыражениеПоискаПоРеквизиту = СтрокаТипаОбъектаРеквизит.ВыражениеПоиска;
		Префикс = СтрокаТипаОбъектаРеквизит.Префикс;
		ТипПолучения = СтрокаТипаОбъектаРеквизит.ТипПолучения;
		
		РезультатXPath = ВычислитьВыражениеXPath(ВыражениеПоискаПоРеквизиту, ДокументDOM);
		Пока Истина Цикл
			
			ЭлементDOMРеквизита = РезультатXPath.ПолучитьСледующий();
			Если ЭлементDOMРеквизита = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
			ПодсказкаРеквизита = ПолучитьПодсказкуЭлемента(ДокументDOM, ЭлементDOMРеквизита, Префикс);
			Если ПустаяСтрока(ПодсказкаРеквизита) Тогда
				Продолжить;
			КонецЕсли;
			
			СинонимРеквизита = ПолучитьСинонимОбъекта(ДокументDOM, ЭлементDOMРеквизита, Префикс);
			
			ПодсказкаРеквизита = ПреобразоватьТекстДляСравнения(ПодсказкаРеквизита);
			СинонимРеквизита   = ПреобразоватьТекстДляСравнения(СинонимРеквизита);
			
			Если ПодсказкаРеквизита = СинонимРеквизита Тогда
				ОчиститьПодсказкуЭлемента(ДокументDOM, ЭлементDOMРеквизита, Префикс);
				РеквизитИзменен = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат РеквизитИзменен;
	
КонецФункции

#КонецОбласти

#Область ПодсказкаИПроверкаЗаполненияEDT

// Удаляет подсказки у реквизитов, измерений, ресурсов и т.п., у которых они совпадают с синонимом или образованы из имени.
//
Функция ОчиститьПодсказкиРеквизитовEDT(ДокументDOM, ТипОбъектаРодителя, ТаблицаТиповОбъектовРеквизит)
	
	РеквизитИзменен = Ложь;
	
	Для Каждого СтрокаТипаОбъектаРеквизит Из ТаблицаТиповОбъектовРеквизит Цикл
		
		ТипОбъекта = СтрокаТипаОбъектаРеквизит.ТипОбъекта;
		ВыражениеПоискаПоРеквизиту = СтрШаблон(СтрокаТипаОбъектаРеквизит.ВыражениеПоиска, ТипОбъектаРодителя);
		
		РезультатXPath = ВычислитьВыражениеXPath(ВыражениеПоискаПоРеквизиту, ДокументDOM);
		Пока Истина Цикл
			
			ЭлементDOMРеквизита = РезультатXPath.ПолучитьСледующий();
			Если ЭлементDOMРеквизита = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
			ПодсказкаРеквизита = ПолучитьПодсказкуЭлементаEDT(ДокументDOM, ЭлементDOMРеквизита);
			Если ПустаяСтрока(ПодсказкаРеквизита) Тогда
				УдалитьПодсказкуЭлементаEDT(ДокументDOM, ЭлементDOMРеквизита);
				Продолжить;
			КонецЕсли;
			
			СинонимРеквизита = ПолучитьСинонимОбъектаEDT(ДокументDOM, ЭлементDOMРеквизита);
			
			ПодсказкаРеквизита = ПреобразоватьТекстДляСравнения(ПодсказкаРеквизита);
			СинонимРеквизита   = ПреобразоватьТекстДляСравнения(СинонимРеквизита);
			
			Если ПодсказкаРеквизита = СинонимРеквизита Тогда
				УдалитьПодсказкуЭлементаEDT(ДокументDOM, ЭлементDOMРеквизита);
				РеквизитИзменен = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат РеквизитИзменен;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область УстановкаПризнакаИспользоватьВсегда

Функция УстановитьПризнакиИспользоватьВсегдаДляПолейДинамическихСписков(ДокументDOM)
	
	ФормаИзменена = Ложь;
	
	ВыражениеПоискаПоТипуШаблон = "//xmlns:Attributes/xmlns:Attribute/xmlns:Type/v8:Type[text()='%1']";
	ВыражениеПоискаПоПутиКДаннымШаблон = "//xmlns:ChildItems/*/xmlns:DataPath[text()='%1']";
	ВыражениеПоискаИспользуемыхВсегдаШаблон = "//xmlns:UseAlways/xmlns:Field[text()='%1']";
	
	МассивСсылокШаблон = Новый Массив;
	МассивСсылокШаблон.Добавить(".Ссылка");
	МассивСсылокШаблон.Добавить(".Ref");
	
	МассивТиповДинамическийСписок = Новый Массив;
	МассивТиповДинамическийСписок.Добавить("cfg:DynamicList");
	МассивТиповДинамическийСписок.Добавить("dl:DynamicList");
	
	Для Каждого ТипДинамическийСписок Из МассивТиповДинамическийСписок Цикл
		
		ВыражениеПоискаПоТипу = СтрШаблон(ВыражениеПоискаПоТипуШаблон, ТипДинамическийСписок);
		РезультатXPath = ВычислитьВыражениеXPath(ВыражениеПоискаПоТипу, ДокументDOM);
		Пока Истина Цикл
			
			ЭлементDOMv8Type = РезультатXPath.ПолучитьСледующий();
			Если ЭлементDOMv8Type = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
			ЭлементDOMType = ЭлементDOMv8Type.РодительскийУзел;
			Если ЭлементDOMType = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ЭлементDOMРеквизит = ЭлементDOMType.РодительскийУзел;
			Если ЭлементDOMРеквизит = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяРеквизита = ПолучитьИмяЭлемента(ДокументDOM, ЭлементDOMРеквизит);
			Если ПустаяСтрока(ИмяРеквизита) Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого СсылкаШаблон Из МассивСсылокШаблон Цикл
				ИмяРеквизитаСсылка = ИмяРеквизита + СсылкаШаблон;
				
				ВыражениеПоискаПоПутиКДанным = СтрШаблон(ВыражениеПоискаПоПутиКДаннымШаблон, ИмяРеквизитаСсылка);
				РезультатПоискаПоПутиКДанным = ВычислитьВыражениеXPath(ВыражениеПоискаПоПутиКДанным, ДокументDOM);
				
				ЭлементDOMСсылка = РезультатПоискаПоПутиКДанным.ПолучитьСледующий();
				Если ЭлементDOMСсылка <> Неопределено Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЭлементDOMСсылка = Неопределено Тогда
				// Не найден элементом формы с типом <ИмяДинамическогоСписка>.Ссылка
				Продолжить;
			КонецЕсли;
			
			ВыражениеПоискаИспользуемыхВсегда = СтрШаблон(ВыражениеПоискаИспользуемыхВсегдаШаблон, ИмяРеквизитаСсылка);
			РезультатПоискаПоПутиКДанным = ВычислитьВыражениеXPath(ВыражениеПоискаИспользуемыхВсегда, ДокументDOM);
			
			ЭлементDOMИспользоватьВсегда = РезультатПоискаПоПутиКДанным.ПолучитьСледующий();
			Если ЭлементDOMИспользоватьВсегда = Неопределено Тогда
				УстановитьПризнакИспользоватьВсегда(ДокументDOM, ЭлементDOMРеквизит, ИмяРеквизитаСсылка);
				ФормаИзменена = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ФормаИзменена;
	
КонецФункции

Функция УстановитьПризнакиИспользоватьВсегдаДляПолейДинамическихСписковEDT(ДокументDOM)
	
	ФормаИзменена = Ложь;
	
	ВыражениеПоискаПоТипу = "//attributes/valueType/types[text()='DynamicList']";
	ВыражениеПоискаПоПутиКДаннымШаблон = "//items/dataPath/paths/segments[text()='%1']";
	ВыражениеПоискаИспользуемыхВсегдаШаблон = "//notDefaultUseAlwaysAttributes/segments[text()='%1']";
	
	МассивСсылокШаблон = Новый Массив;
	МассивСсылокШаблон.Добавить(".Ссылка");
	МассивСсылокШаблон.Добавить(".Ref");
	
	РезультатXPath = ВычислитьВыражениеXPath(ВыражениеПоискаПоТипу, ДокументDOM);
	Пока Истина Цикл
		
		ЭлементDOMv8Type = РезультатXPath.ПолучитьСледующий();
		Если ЭлементDOMv8Type = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		ЭлементDOMType = ЭлементDOMv8Type.РодительскийУзел;
		Если ЭлементDOMType = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементDOMРеквизит = ЭлементDOMType.РодительскийУзел;
		Если ЭлементDOMРеквизит = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяРеквизита = ПолучитьИмяЭлементаEDT(ДокументDOM, ЭлементDOMРеквизит);
		Если ПустаяСтрока(ИмяРеквизита) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СсылкаШаблон Из МассивСсылокШаблон Цикл
			ИмяРеквизитаСсылка = ИмяРеквизита + СсылкаШаблон;
			
			ВыражениеПоискаПоПутиКДанным = СтрШаблон(ВыражениеПоискаПоПутиКДаннымШаблон, ИмяРеквизитаСсылка);
			РезультатПоискаПоПутиКДанным = ВычислитьВыражениеXPath(ВыражениеПоискаПоПутиКДанным, ДокументDOM);
			
			ЭлементDOMСсылка = РезультатПоискаПоПутиКДанным.ПолучитьСледующий();
			Если ЭлементDOMСсылка <> Неопределено Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЭлементDOMСсылка = Неопределено Тогда
			// Не найден элементом формы с типом <ИмяДинамическогоСписка>.Ссылка
			Продолжить;
		КонецЕсли;
		
		ВыражениеПоискаИспользуемыхВсегда = СтрШаблон(ВыражениеПоискаИспользуемыхВсегдаШаблон, ИмяРеквизитаСсылка);
		РезультатПоискаПоПутиКДанным = ВычислитьВыражениеXPath(ВыражениеПоискаИспользуемыхВсегда, ДокументDOM, ЭлементDOMРеквизит);
		
		ЭлементDOMИспользоватьВсегда = РезультатПоискаПоПутиКДанным.ПолучитьСледующий();
		Если ЭлементDOMИспользоватьВсегда = Неопределено Тогда
			УстановитьПризнакИспользоватьВсегдаEDT(ДокументDOM, ЭлементDOMРеквизит, ИмяРеквизитаСсылка);
			ФормаИзменена = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ФормаИзменена;
	
КонецФункции

#КонецОбласти

#Область ИсправлениеФайловФормПроектаEDT

Функция ПолучитьТекстТегаКорневогоЭлементаEDT(ПолноеИмяФайла)
	
	ТекстXML = ПолучитьТекстФайла(ПолноеИмяФайла, КодировкаТекста.UTF8, Ложь);
	Если ПустаяСтрока(ТекстXML) Тогда
		Возврат "";
	КонецЕсли;
	
	// Тег корневого элемента для XML-файла формы проекта EDT должен начинаться с "<form:Form".
	ПозицияОткрытияТега = СтрНайти(ТекстXML, Контекст["ТегКорневогоЭлементаФайлаXMLФормыПроектаEDT"]);
	Если ПозицияОткрытияТега = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	// Если нашли, то ищем символ закрытия тега ">".
	ПозицияЗакрытияТега = СтрНайти(ТекстXML, ">",, ПозицияОткрытияТега);
	Если ПозицияЗакрытияТега = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстТегаКорневогоЭлемента = Сред(ТекстXML, ПозицияОткрытияТега, ПозицияЗакрытияТега - ПозицияОткрытияТега + 1);
	
	Возврат ТекстТегаКорневогоЭлемента;
	
КонецФункции

Функция ИсправитьТегКорневогоЭлементаEDT(ТекстXML, ТекстТегаКорневогоЭлемента)
	
	Если ПустаяСтрока(ТекстТегаКорневогоЭлемента) Тогда
		Возврат ТекстXML;
	КонецЕсли;
	
	// Тег корневого элемента для XML-файла формы проекта EDT должен начинаться с "<form:Form".
	ПозицияОткрытияТега = СтрНайти(ТекстXML, Контекст["ТегКорневогоЭлементаФайлаXMLФормыПроектаEDT"]);
	Если ПозицияОткрытияТега = 0 Тогда
		Возврат ТекстXML;
	КонецЕсли;
	
	// Если нашли, то ищем символ закрытия тега ">".
	ПозицияЗакрытияТега = СтрНайти(ТекстXML, ">",, ПозицияОткрытияТега);
	Если ПозицияЗакрытияТега = 0 Тогда
		Возврат ТекстXML;
	КонецЕсли;
	
	ИсправленныйТекстXML = Лев(ТекстXML, ПозицияОткрытияТега - 1) + ТекстТегаКорневогоЭлемента + Сред(ТекстXML, ПозицияЗакрытияТега + 1);
	
	Возврат ИсправленныйТекстXML;
	
КонецФункции

Функция ИсправитьКавычкиВТекстеXMLEDT(Знач ТекстXML)
	
	ТаблицаТеговПоискаКавычекEDT = Контекст["ТаблицаТеговПоискаКавычекEDT"];
	
	Для Каждого СтрокаТаблицы Из ТаблицаТеговПоискаКавычекEDT Цикл
		
		ТекстНачалоТега = СтрокаТаблицы.НачалоТега;
		ТекстКонецТега  = СтрокаТаблицы.КонецТега;
		ДлинаНачалоТега = СтрДлина(ТекстНачалоТега);
		
		ПозицияКонцаТега = 0;
		Пока Истина Цикл
			
			// Определяем позицию открывающего тега.
			ПозицияНачалаТега = СтрНайти(ТекстXML, ТекстНачалоТега,, ПозицияКонцаТега + 1);
			Если ПозицияНачалаТега = 0 Тогда
				Прервать;
			КонецЕсли;
			
			// Определяем позицию закрывающего тега.
			ПозицияКонцаТега = СтрНайти(ТекстXML, ТекстКонецТега,, ПозицияНачалаТега);
			Если ПозицияКонцаТега = 0 Тогда
				Прервать;
			КонецЕсли;
			
			ПозицияНачалаТега = ПозицияНачалаТега + ДлинаНачалоТега;
			
			// Получаем значение тега.
			СтрокаМеждуТегами = Сред(ТекстXML, ПозицияНачалаТега, ПозицияКонцаТега - ПозицияНачалаТега);
			
			// Ищем кавычки в значении тега.
			Если СтрНайти(СтрокаМеждуТегами, """") = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			// Меняем кавычки на "&quot;".
			СтрокаЗамены = СтрЗаменить(СтрокаМеждуТегами, """", Контекст["ЗаменаСимволаКавычкаДляXML"]);
			ТекстXML = Лев(ТекстXML, ПозицияНачалаТега - 1) + СтрокаЗамены + Сред(ТекстXML, ПозицияКонцаТега);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТекстXML;
	
КонецФункции

Процедура ИсправитьФайлXMLПроектаEDT(ПолноеИмяФайла, ПараметрыЗаписи)
	
	Кодировка = ПараметрыЗаписи.Кодировка;
	
	ИсходныйТекстXML = ПолучитьТекстФайла(ПолноеИмяФайла, Кодировка, Ложь);
	Если ПустаяСтрока(ИсходныйТекстXML) Тогда
		Возврат;
	КонецЕсли;
	
	// При записи файла XML проекта EDT изменяется порядок атрибутов корневого элемента формы.
	// Возвращаем прежний текст тега из XML-файла формы.
	ТекстТегаКорневогоЭлемента = ПараметрыЗаписи.ТекстТегаКорневогоЭлемента;
	
	ТекстXML = ИсправитьТегКорневогоЭлементаEDT(ИсходныйТекстXML, ТекстТегаКорневогоЭлемента);
	
	// Заменяем текст "&gt;" на символ ">".
	ТекстXML = СтрЗаменить(ТекстXML, Контекст["ЗаменаСимволаБольшеДляXML"], ">");
	
	// Заменяем кавычки в значениях тегов и в текстах запросов динамических списков на "&quot;".
	ТекстXML = ИсправитьКавычкиВТекстеXMLEDT(ТекстXML);
	
	// Заменяем сокращенные пустые теги на полные.
	ЗаменитьСокращенныеПустыеТегиНаПолные(ТекстXML);
	
	// Проверяем наличие разделителя строк в конце текста файла.
	ТекстXML = СокрП(ТекстXML);
	Если ПараметрыЗаписи.ЕстьПустаяСтрокаВКонце Тогда
		// Добавляем разделитель строк в конец текста, если в исходном тексте разделитель есть.
		ТекстXML = ТекстXML + ПараметрыЗаписи.РазделительСтрок;
	КонецЕсли;
	
	Если ИсходныйТекстXML = ТекстXML Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьТекстовыйФайл(ПолноеИмяФайла, ТекстXML, ПараметрыЗаписи);
	
КонецПроцедуры

Процедура ЗаменитьСокращенныеПустыеТегиНаПолные(ТекстXML)
	
	ТаблицаПустыхТегов = Контекст["ТаблицаПустыхТегов"];
	
	Для Каждого СтрокаТаблицыПустыхТегов Из ТаблицаПустыхТегов Цикл
		ТекстXML = СтрЗаменить(ТекстXML, СтрокаТаблицыПустыхТегов.СокращенныйТег, СтрокаТаблицыПустыхТегов.ПолныйТег);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбщиеТребованияПоЛокализацииКонфигурации

Функция ОчиститьИзлишнююЛокализацию(ДокументDOM)
	
	ОбъектИзменен = Ложь;
	
	ТаблицаЯзыковКонфигурации = Контекст["ТаблицаЯзыковКонфигурации"];
	Если ТаблицаЯзыковКонфигурации.Количество() = 0 Тогда
		Возврат ОбъектИзменен;
	КонецЕсли;
	
	МассивВыраженийПеревода = Новый Массив;
	МассивВыраженийПеревода.Добавить("//xmlns:languageInfo/xmlns:id");
	МассивВыраженийПеревода.Добавить("//v8:item/v8:lang");
	Если НЕ ЭтоВыгрузкаXMLФайлов Тогда
		МассивВыраженийПеревода.Добавить("//synonym/key");
		МассивВыраженийПеревода.Добавить("//title/key");
	КонецЕсли;
	
	Для Каждого ВыражениеПеревода Из МассивВыраженийПеревода Цикл
		
		РезультатXPath = ВычислитьВыражениеXPath(ВыражениеПеревода, ДокументDOM);
		Если РезультатXPath = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Пока Истина Цикл
			
			ЭлементDOMКодЯзыка = РезультатXPath.ПолучитьСледующий();
			Если ЭлементDOMКодЯзыка = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
			КодЯзыка = ЭлементDOMКодЯзыка.ТекстовоеСодержимое;
			
			// Если код языка есть среди языков конфигурации, то пропускаем.
			Если ТаблицаЯзыковКонфигурации.Найти(КодЯзыка, "КодЯзыка") <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			// Если не нашли, то удаляем перевод целиком вместе с узлом языка.
			ЭлементDOMУзелЯзыка = ЭлементDOMКодЯзыка.РодительскийУзел;
			Если ЭлементDOMУзелЯзыка = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ЭлементDOMУзелЯзыкаРодитель = ЭлементDOMУзелЯзыка.РодительскийУзел;
			Если ЭлементDOMУзелЯзыкаРодитель = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ЭлементDOMУзелЯзыкаРодитель.УдалитьДочерний(ЭлементDOMУзелЯзыка);
			
			ОбъектИзменен = Истина;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ОбъектИзменен;
	
КонецФункции

#КонецОбласти

#Область ИмяСинонимКомментарий

Функция ИзменитьСинонимОбъекта(ДокументDOM, ПараметрыИзмененияСинонима)
	
	ОбъектИзменен = Ложь;
	
	ЭлементDOMСвойства = ПолучитьЭлементDOMПоВыражениюXPath(ПараметрыИзмененияСинонима.ВыражениеПоискаСвойств, ДокументDOM);
	Если ЭлементDOMСвойства = Неопределено Тогда
		Возврат ОбъектИзменен;
	КонецЕсли;
	
	// Получаем имя объекта.
	Если ПараметрыИзмененияСинонима.ТипВыгрузкиФайлов = "XML" Тогда
		ИмяОбъекта = ПолучитьИмяЭлемента(ДокументDOM, ЭлементDOMСвойства,, "Узел");
	Иначе
		ИмяОбъекта = ПолучитьИмяЭлементаEDT(ДокументDOM, ЭлементDOMСвойства);
	КонецЕсли;
	
	// Меняем синоним объекта, если его имя содержит определенную фразу, иначе выходим.
	Если СтрНайти(ИмяОбъекта, ПараметрыИзмененияСинонима.ИмяОбъекта) = 0 Тогда
		Возврат ОбъектИзменен;
	КонецЕсли;
	
	// Получаем синоним объекта.
	Если ПараметрыИзмененияСинонима.ТипВыгрузкиФайлов = "XML" Тогда
		ТекущийСиноним = ПолучитьСинонимОбъекта(ДокументDOM, ЭлементDOMСвойства);
	Иначе
		ТекущийСиноним = ПолучитьСинонимОбъектаEDT(ДокументDOM, ЭлементDOMСвойства);
	КонецЕсли;
	
	// Меняем синоним объекта, если оно содержит определенную фразу, иначе выходим.
	ИсходныйСиноним = ПараметрыИзмененияСинонима.ИсходныйСиноним;
	Если СтрНайти(ТекущийСиноним, ИсходныйСиноним) = 0 Тогда
		Возврат ОбъектИзменен;
	КонецЕсли;
	
	НовыйСиноним = ПараметрыИзмененияСинонима.НовыйСиноним;
	ТекущийСиноним = СтрЗаменить(ТекущийСиноним, ИсходныйСиноним, НовыйСиноним);
	
	// Устанавливаем синоним объекта.
	Если ПараметрыИзмененияСинонима.ТипВыгрузкиФайлов = "XML" Тогда
		УстановитьСинонимОбъекта(ДокументDOM, ЭлементDOMСвойства, ТекущийСиноним);
	Иначе
		УстановитьСинонимОбъектаEDT(ДокументDOM, ЭлементDOMСвойства, ТекущийСиноним);
	КонецЕсли;
	
	ОбъектИзменен = Истина;
	
	Возврат ОбъектИзменен;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Инициализация

ЗначениеФлагов = Неопределено;
ТаблицаТиповОбъектов = Неопределено;
УстановленОтборПоОбъектам = Ложь;
ТаблицаВыбранныхОбъектов = Неопределено;
РазделительПути = ПолучитьРазделительПути();
ЭтоВыгрузкаXMLФайлов = Неопределено;
Контекст = Новый Соответствие;

#КонецОбласти

#КонецЕсли