
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("ЗапуститьИЗавершить") Тогда
		ЗапуститьИЗавершить = Ложь;
	Иначе
		ЗапуститьИЗавершить = Параметры.ЗапуститьИЗавершить;
	КонецЕсли;
	
	ОпределитьКодОсновногоЯзыка();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Статус = ПроверитьПлатформу836();
	Если НЕ ПустаяСтрока(Статус) Тогда
		ПоказатьПредупреждение(, Статус);
		Сообщить(НСтр("ru='Не удалось проверить версию платформы. Работа завершена.';en='Не удалось проверить версию платформы. Работа завершена.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДеревоСтандартовПоУмолчанию();
	
	#Если ТолстыйКлиентУправляемоеПриложение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
	Элементы.ТекстТонкийКлиент.Видимость = Ложь;
	#Иначе
	Элементы.ТекстТонкийКлиент.Видимость = Истина;
	#КонецЕсли
	
	ТипИсточникаСтрокой = НСтр("ru='ru='Файловая база'; en='ru='Файловая база'", Объект.КодОсновногоЯзыка);
	Объект.ТипИсточника = 0;
	Объект.ВыгружатьКонфигурациюВФайлыXML = Истина;
	Объект.ЗагружатьКонфигурациюИзФайловXML = Истина;
	Объект.ОбновитьКонфигурациюБД = Ложь;
	
	УстановитьТекущуюСтраницу();
	
	СоставОбъектов = "Все";
	
	ЗапуститьАвтоформатированиеИзКоманднойСтроки();
	
	Если ЗапуститьИЗавершить Тогда
		Сообщить(НСтр("ru='Пакетный запуск:';en='Пакетный запуск:'") + ПараметрЗапуска);
		ПараметрыАвтоформатирования = ПолучитьПараметрыЗапускаПоУмолчанию();
		ПараметрыАвтоформатирования.Вставить("ЗапуститьИЗавершить", Истина);
		АвтоформатироватьКод(ПараметрыАвтоформатирования);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "апк_ЗакрытиеФормыВыбораОбъектов" Тогда
		Если Источник = ЭтаФорма Тогда
			
			ОбъектИсточник = Параметр.Объект;
			
			СвойстваИсключения = "Результат, ЗахваченныеОбъекты, ПравилаПоддержкиОбъектов, СтруктураКонфигурации, СоставПодсистем, ТаблицаИзмененныхОбъектовИСтандартов";
			ЗаполнитьЗначенияСвойств(ОбъектИсточник, Объект,, СвойстваИсключения);
			
			Если Параметр.ОбновитьТаблицуСтруктуры ИЛИ Объект.СтруктураКонфигурации.Количество() = 0 Тогда
				Если ОбъектИсточник.СтруктураКонфигурации.Количество() > 0 Тогда
					Состояние(НСтр("ru='Преобразование данных структуры конфигурации из дерева в табличную часть.';
						|en='Преобразование данных структуры конфигурации из дерева в табличную часть.'", Объект.КодОсновногоЯзыка));
				КонецЕсли;
				ЗаполнитьТаблицыОбъекта(ОбъектИсточник.СтруктураКонфигурации, ОбъектИсточник.СоставПодсистем);
				ЗаполнитьКоличествоВыбранныхОбъектов();
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПутьКБазеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИмяРеквизита", "ПутьКФайловойБазе");
	ПараметрыОповещения.Вставить("ДобавитьСлэш", Истина);
	Оповещение = Новый ОписаниеОповещения("ОповещениеПослеВыбораФайла", ЭтотОбъект, ПараметрыОповещения);
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Укажите каталог с информационной базой';
		|en='Укажите каталог с информационной базой'", Объект.КодОсновногоЯзыка);
	ДиалогОткрытияФайла.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущуюСтраницу()
	
	Объект.ПутьКБазе = СтрокаСоединенияИнформационнойБазы();
	Объект.ПутьКБазе = СокрЛП(Объект.ПутьКБазе);
	
	// Если на вход подается строка соединения с файловой базой, то получаем каталог из строки соединения.
	Если СтрНайти(Объект.ПутьКБазе, "File=") > 0 Тогда
		
		Объект.ПутьКФайловойБазе = НСтр(Объект.ПутьКБазе, "File");
		Объект.ТипИсточника = 0;
		Элементы.ГруппаТипБазы.ТекущаяСтраница = Элементы.ГруппаФайловаяБаза;
		
	// Если на вход подается строка соединения с серверной базой, то формируем путь к базе из строки соединения.
	ИначеЕсли СтрНайти(Объект.ПутьКБазе, "Srvr=") > 0 Тогда
		
		КластерБазы = НСтр(Объект.ПутьКБазе, "Srvr");
		ИмяБазы = НСтр(Объект.ПутьКБазе, "Ref");
		Объект.ТипИсточника = 1;
		ТипИсточникаСтрокой = НСтр("ru='Серверная база'; en='Серверная база'", Объект.КодОсновногоЯзыка);
		Элементы.ГруппаТипБазы.ТекущаяСтраница = Элементы.ГруппаКлиентСервернаяБаза;
		
	КонецЕсли;
	
	Объект.Пользователь = ИмяПользователя();
	Объект.СтрокаЗапускаПлатформы = КаталогПрограммы() + "1cv8.exe";
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогХранилищаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИмяРеквизита", "КаталогХранилища");
	ПараметрыОповещения.Вставить("ДобавитьСлэш", Истина);
	Оповещение = Новый ОписаниеОповещения("ОповещениеПослеВыбораФайла", ЭтотОбъект, ПараметрыОповещения);
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Укажите каталог с хранилищем конфигурации';
		|en='Укажите каталог с хранилищем конфигурации'", Объект.КодОсновногоЯзыка);
	ДиалогОткрытияФайла.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаЗапускаПлатформыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИмяРеквизита", "СтрокаЗапускаПлатформы");
	ПараметрыОповещения.Вставить("ДобавитьСлэш", Ложь);
	Оповещение = Новый ОписаниеОповещения("ОповещениеПослеВыбораФайла", ЭтотОбъект, ПараметрыОповещения);
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Укажите исполняемый файл запуска платформы 1С:Предприятие';
		|en='Укажите исполняемый файл запуска платформы 1С:Предприятие'", Объект.КодОсновногоЯзыка);
	ДиалогОткрытияФайла.Фильтр = "Исполняемый файл(1cv8.exe)|*.exe";
	ДиалогОткрытияФайла.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИмяРеквизита", "КаталогВыгрузкиРезультат");
	ПараметрыОповещения.Вставить("ДобавитьСлэш", Истина);
	Оповещение = Новый ОписаниеОповещения("ОповещениеПослеВыбораФайла", ЭтотОбъект, ПараметрыОповещения);
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Укажите каталог с файлами выгрузки XML';
		|en='Укажите каталог с файлами выгрузки XML'", Объект.КодОсновногоЯзыка);
	ДиалогОткрытияФайла.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьКонфигурациюИзФайловXMLПриИзменении(Элемент)
	
	Элементы.ОбновитьКонфигурациюБД.Доступность = Объект.ЗагружатьКонфигурациюИзФайловXML;
	Если НЕ Объект.ЗагружатьКонфигурациюИзФайловXML Тогда
		Объект.ОбновитьКонфигурациюБД = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтандартыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если СтрСравнить(Поле.Имя, "СтандартыНаименование") <> 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийСтандарт = Стандарты.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если ТекущийСтандарт = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Гиперссылка = ТекущийСтандарт.Гиперссылка;
	
	Если НЕ ПустаяСтрока(Гиперссылка) Тогда
		НачатьЗапускПриложения(Новый ОписаниеОповещения, Гиперссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтандартыФлагПриИзменении(Элемент)
	
	ТекущийСтандарт = Элементы.Стандарты.ТекущиеДанные;
	РодительскийСтандарт = ТекущийСтандарт.ПолучитьРодителя();
	
	Флаг = ТекущийСтандарт.Флаг;
	
	// Если это родительская ветка (стандарт), то меняем флаг у всех подчиненных веток (ошибок).
	Если РодительскийСтандарт = Неопределено Тогда
		Для Каждого ПодчиненныйСтандарт Из ТекущийСтандарт.ПолучитьЭлементы() Цикл
			ПодчиненныйСтандарт.Флаг = Флаг;
		КонецЦикла;
	Иначе
		
		// Если это подчиненная ветка (ошибка), то проверяем состояние флага родителя.
		Если РодительскийСтандарт.Флаг = Флаг Тогда
			Возврат;
		КонецЕсли;
		
		// Если флаг поставили, то устанавливаем его у родителя.
		Если Флаг Тогда
			РодительскийСтандарт.Флаг = Истина;
		Иначе
			// Если флаг сняли, то проверяем флаг других подчиненных веток.
			ФлагСнятУВсехПодчиненных = Истина;
			Для Каждого ПодчиненныйСтандарт Из РодительскийСтандарт.ПолучитьЭлементы() Цикл
				Если ПодчиненныйСтандарт.Флаг Тогда
					ФлагСнятУВсехПодчиненных = Ложь;
				КонецЕсли;
			КонецЦикла;
			
			// Если флаг у всех подчиненных снят, то снимаем его у родителя.
			Если ФлагСнятУВсехПодчиненных Тогда
				РодительскийСтандарт.Флаг = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипИсточникаСтрокойПриИзменении(Элемент)
	
	ТипИсточникаДляПроверки = ТипИсточникаСтрокой;
	ТипИсточникаДляПроверки = СтрЗаменить(ТипИсточникаДляПроверки, " ", "");
	ТипИсточникаДляПроверки = СтрЗаменить(ТипИсточникаДляПроверки, Символы.Таб, "");
	ТипИсточникаДляПроверки = ВРег(ТипИсточникаДляПроверки);
	
	Если ТипИсточникаДляПроверки = ВРег("ФайловаяБаза") Тогда
		Объект.ТипИсточника = 0;
		Элементы.РаботаСХранилищемКонфигурации.Видимость = Истина;
		Элементы.ГруппаТипБазы.Видимость = Истина;
		Элементы.ГруппаТипБазы.ТекущаяСтраница = Элементы.ГруппаФайловаяБаза;
		Элементы.ГруппаПараметрыИсточников.ТекущаяСтраница = Элементы.ГруппаИсточникБаза;
	ИначеЕсли ТипИсточникаДляПроверки = ВРег("СервернаяБаза") Тогда
		Объект.ТипИсточника = 1;
		Элементы.РаботаСХранилищемКонфигурации.Видимость = Истина;
		Элементы.ГруппаТипБазы.Видимость = Истина;
		Элементы.ГруппаТипБазы.ТекущаяСтраница = Элементы.ГруппаКлиентСервернаяБаза;
		Элементы.ГруппаПараметрыИсточников.ТекущаяСтраница = Элементы.ГруппаИсточникБаза;
	Иначе
		Объект.ТипИсточника = 2;
		Элементы.РаботаСХранилищемКонфигурации.Видимость = Ложь;
		Элементы.ГруппаТипБазы.Видимость = Ложь;
		Элементы.ГруппаПараметрыИсточников.ТекущаяСтраница = Элементы.ГруппаИсточникВыгрузкаXML;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставОбъектовНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуВыбораОбъектовПослеПроверкиПодключения", ЭтотОбъект);
	
	ПараметрыПодключения = Новый Структура;
	ПараметрыПодключения.Вставить("Обработчик", ОписаниеОповещения);
	
	ПроверитьНастройкиПодключения(ПараметрыПодключения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьАвтоформатированиеКода(Команда)
	
	АвтоформатироватьКод();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАнализКода(Команда)
	
	ПараметрыАвтоформатирования = Новый Структура;
	ПараметрыАвтоформатирования.Вставить("ЗагрузитьКонфигурациюИзXML", Ложь);
	ПараметрыАвтоформатирования.Вставить("ПоказатьРезультат", Истина);
	
	АвтоформатироватьКод(ПараметрыАвтоформатирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПараметрыАвтоформатирования(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОповещениеПослеВыбораФайлаДляВыгрузки", ЭтотОбъект);
	
	ЗаголовокДиалога = НСтр("ru='Задайте имя файла выгрузки'; en='Задайте имя файла выгрузки'", Объект.КодОсновногоЯзыка);
	Фильтр = "Формат выгрузки (*.xml)|*.xml|Архив выгрузки (*.zip)|*.zip|Все файлы (*.*)|*.*";
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = ЗаголовокДиалога;
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	УстановитьЗначениеФлагов(Стандарты.ПолучитьЭлементы(), Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	
	УстановитьЗначениеФлагов(Стандарты.ПолучитьЭлементы(), Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункций

#Область ПроцедурыИФункцииРаботыСФайламиИКаталогами

&НаСервере
Функция ФайлСуществуетНаСервере(Знач ИмяФайла)
	
	Файл = Новый Файл(ИмяФайла);
	Возврат Файл.Существует();
	
КонецФункции

&НаСервере
Процедура ОчиститьКаталогиВыгрузки(Знач Маска = "*")
	
	Попытка
		УдалитьФайлы(Объект.КаталогВыгрузки, Маска);
		УдалитьФайлы(Объект.КаталогВыгрузкиРезультат, Маска);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
// Получает путь к временному файлу в родительском каталоге выгрузки.
//
Функция апк_ПолучитьИмяВременногоФайла(Расширение = "")
	
	КаталогВыгрузкиРодитель = ПолучитьКаталогФайла(Объект.КаталогВыгрузки);
	
	ИмяФайла = ПолучитьИмяВременногоФайла(Расширение);
	Файл = Новый Файл(ИмяФайла);
	
	Возврат КаталогВыгрузкиРодитель + Файл.Имя;
	
КонецФункции

&НаСервере
Функция ПолучитьКаталогФайла(ПутьКФайлу)
	
	Файл = Новый Файл(ПутьКФайлу);
	Возврат Файл.Путь;
	
КонецФункции

&НаСервере
Процедура СкопироватьКаталогВыгрузки(Источник, Приемник)
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	ДоступОбъект.СкопироватьКаталогВыгрузки(Источник, Приемник);
	ЗначениеВРеквизитФормы(ДоступОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Функция ОтредактироватьПутьККаталогу(Каталог)
	
	Если ПустаяСтрока(Каталог) Тогда
		Возврат Каталог;
	КонецЕсли;
	
	Если НЕ СтрЗаканчиваетсяНа(Каталог, ПолучитьРазделительПути()) Тогда
		Каталог = Каталог + ПолучитьРазделительПути();
	КонецЕсли;
	
	Возврат Каталог;
	
КонецФункции

&НаСервере
Функция апк_ПолучитьФайлИзАрхива(ФайлАрхива)
	
	ПолученныйФайл = "";
	
	ВременныйКаталог = ПолучитьИмяВременногоФайла();
	апк_РаспаковатьАрхив(ФайлАрхива, ВременныйКаталог);
	
	МассивФайлов = НайтиФайлы(ВременныйКаталог, "*.xml");
	Если МассивФайлов.Количество() > 0 Тогда
		ПолученныйФайл = МассивФайлов[0].ПолноеИмя;
	КонецЕсли;
	
	Возврат ПолученныйФайл;
	
КонецФункции

&НаСервере
// Процедура предназначена для распаковки архива.
//
// Параметры:
// ИмяФайла - имя файла архива.
// ИмяКаталога - каталог, в который распаковывается архив.
Процедура апк_РаспаковатьАрхив(ИмяФайла, Каталог)
	
	Если НЕ ФайлСуществуетНаСервере(Каталог) Тогда
		СоздатьКаталог(Каталог);
	КонецЕсли;
	
	Попытка
		ЧтениеZipФайла = Новый ЧтениеZipФайла(ИмяФайла);
		ЧтениеZipФайла.ИзвлечьВсе(Каталог);
		ЧтениеZipФайла.Закрыть();
	Исключение
		// АПК:280 - действия при исключении не требуются.
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
// Удаляет в попытке указанный файл или каталог.
// Действует аналогично методу УдалитьФайлы().
//
Процедура апк_ФайлУдалить(Знач ИмяФайла, Знач Маска = "")
	
	Если НЕ ФайлСуществуетНаСервере(ИмяФайла) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		УдалитьФайлы(ИмяФайла, Маска);
	Исключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область КомандыЗапускаКонфигуратораВПакетномРежиме

&НаСервере
Функция ЗагрузитьКонфигурациюИзХранилища()
	
	КаталогХранилища = Объект.КаталогХранилища;
	
	Если ПустаяСтрока(КаталогХранилища) Тогда
		Возврат "";
	КонецЕсли;
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	
	Статус = ДоступОбъект.ЗагрузитьКонфигурациюИзХранилища();
	Если НЕ ПустаяСтрока(Статус) Тогда
		СтрокаСообщения = НСтр("ru='Не удалось загрузить конфигурацию из хранилища по причине:%1%2';
			|en='Не удалось загрузить конфигурацию из хранилища по причине:%1%2'", Объект.КодОсновногоЯзыка);
		СтрокаСообщения = СтрШаблон(СтрокаСообщения, Символы.ПС, Статус);
		Возврат СтрокаСообщения;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДоступОбъект, "Объект");
	
	Возврат "";
	
КонецФункции

&НаСервере
Функция ПодключитьКонфигурациюКХранилищу()
	
	КаталогХранилища = Объект.КаталогХранилища;
	
	Если ПустаяСтрока(КаталогХранилища) Тогда
		Возврат "";
	КонецЕсли;
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	
	Статус = ДоступОбъект.ПодключитьКонфигурациюКХранилищу();
	Если НЕ ПустаяСтрока(Статус) Тогда
		СтрокаСообщения = НСтр("ru='Не удалось подключить конфигурацию к хранилищу по причине:%1%2';
			|en='Не удалось подключить конфигурацию к хранилищу по причине:%1%2'", Объект.КодОсновногоЯзыка);
		СтрокаСообщения = СтрШаблон(СтрокаСообщения, Символы.ПС, Статус);
		Возврат СтрокаСообщения;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДоступОбъект, "Объект");
	
	Возврат "";
	
КонецФункции

&НаСервере
Функция ЗахватитьОбъектыКонфигурацииВХранилище()
	
	КаталогХранилища = Объект.КаталогХранилища;
	
	Если ПустаяСтрока(КаталогХранилища) Тогда
		Возврат "";
	КонецЕсли;
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	
	Статус = ДоступОбъект.ЗахватитьОбъектыКонфигурацииВХранилище();
	Если НЕ ПустаяСтрока(Статус) Тогда
		СтрокаСообщения = НСтр("ru='Не удалось захватить объекты конфигурации в хранилище по причине:%1%2';
			|en='Не удалось захватить объекты конфигурации в хранилище по причине:%1%2'", Объект.КодОсновногоЯзыка);
		СтрокаСообщения = СтрШаблон(СтрокаСообщения, Символы.ПС, Статус);
		Возврат СтрокаСообщения;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДоступОбъект, "Объект");
	
	Возврат "";
	
КонецФункции

&НаСервере
Функция ВыгрузитьКонфигурациюВФайлыXML()
	
	Объект.КаталогВыгрузки = ПолучитьИмяВременногоФайла("");
	ОтредактироватьПутьККаталогу(Объект.КаталогВыгрузки);
	СоздатьКаталог(Объект.КаталогВыгрузки);
	
	// Если указан готовый каталог выгрузки XML, то выгружать конфигурацию в XML не надо.
	// Копируем файлы выгрузки из указанного каталога и выходим.
	Если НЕ Объект.ВыгружатьКонфигурациюВФайлыXML Тогда
		СкопироватьКаталогВыгрузки(Объект.КаталогВыгрузкиРезультат, Объект.КаталогВыгрузки);
		Возврат "";
	КонецЕсли;
	
	Объект.КаталогВыгрузкиРезультат = ПолучитьИмяВременногоФайла("");
	ОтредактироватьПутьККаталогу(Объект.КаталогВыгрузкиРезультат);
	СоздатьКаталог(Объект.КаталогВыгрузкиРезультат);
	
	ОчиститьКаталогиВыгрузки();
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	
	Статус = ДоступОбъект.ВыгрузитьКонфигурациюВФайлыXML();
	Если НЕ ПустаяСтрока(Статус) Тогда
		СтрокаСообщения = НСтр("ru='Не удалось выгрузить конфигурацию в файлы XML по причине:%1%2';
			|en='Не удалось выгрузить конфигурацию в файлы XML по причине:%1%2'", Объект.КодОсновногоЯзыка);
		СтрокаСообщения = СтрШаблон(СтрокаСообщения, Символы.ПС, Статус);
		Возврат СтрокаСообщения;
	КонецЕсли;
	ЗначениеВРеквизитФормы(ДоступОбъект, "Объект");
	
	СкопироватьКаталогВыгрузки(Объект.КаталогВыгрузки, Объект.КаталогВыгрузкиРезультат);
	
	Возврат "";
	
КонецФункции

&НаСервере
Функция ЗагрузитьКонфигурациюИзФайловXML()
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	Статус = ДоступОбъект.ЗагрузитьКонфигурациюИзФайловXML();
	ЗначениеВРеквизитФормы(ДоступОбъект, "Объект");
	
	Возврат Статус;
	
КонецФункции

&НаСервере
Функция ОбновитьКонфигурациюБД()
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	Статус = ДоступОбъект.ОбновитьКонфигурациюБД();
	ЗначениеВРеквизитФормы(ДоступОбъект, "Объект");
	
	Возврат Статус;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьКонфигурациюИзФайловXMLИОбновить(ЗагрузкаФайловXMLПрошлаУспешно)
	
	ЗагрузкаФайловXMLПрошлаУспешно = Истина;
	
	Если НЕ Объект.ЗагружатьКонфигурациюИзФайловXML Тогда
		Возврат;
	КонецЕсли;
	
	Статус = ЗагрузитьКонфигурациюИзФайловXML();
	Если ПустаяСтрока(Статус) Тогда
		апк_Сообщить(НСтр("ru='Измененные файлы XML успешно загружены в конфигурацию.';
			|en='Измененные файлы XML успешно загружены в конфигурацию.'", Объект.КодОсновногоЯзыка));
	Иначе
		СтрокаСообщения = НСтр("ru='Загрузка файлов XML завершилась с ошибками:';
			|en='Загрузка файлов XML завершилась с ошибками:'", Объект.КодОсновногоЯзыка) + Символы.ПС + Статус;
		апк_Сообщить(СтрокаСообщения);
		ЗагрузкаФайловXMLПрошлаУспешно = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Объект.ОбновитьКонфигурациюБД Тогда
		
		Статус = ОбновитьКонфигурациюБД();
		Если ПустаяСтрока(Статус) Тогда
			апк_Сообщить(НСтр("ru='Обновление конфигурации успешно завершено.';
				|en='Обновление конфигурации успешно завершено.'", Объект.КодОсновногоЯзыка));
		Иначе
			СтрокаСообщения = НСтр("ru='Обновление конфигурации базы данных завершилось с ошибками:';
				|en='Обновление конфигурации базы данных завершилось с ошибками:'", Объект.КодОсновногоЯзыка) + " " + Символы.ПС + Статус;
			апк_Сообщить(СтрокаСообщения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьИзмененныеОбъектыВХранилищеИОтменитьЗахват(ЗагрузкаФайловXMLПрошлаУспешно)
	
	// Если не надо помещать объекты в хранилище, то выходим.
	Если (НЕ Объект.ПомещатьИзмененныеОбъектыВХранилище) ИЛИ ПустаяСтрока(Объект.КаталогХранилища) Тогда
		Возврат;
	КонецЕсли;
	
	// Помещаем объекты в хранилище, если файлы XML успешно загружены в конфигурацию БД.
	Если ЗагрузкаФайловXMLПрошлаУспешно Тогда
		СообщитьПользователюОбИзмененныхОбъектахНезахваченныхВХранилище();
		
		Состояние(НСтр("ru='Выполняется загрузка измененных объектов в хранилище';
			|en='Выполняется загрузка измененных объектов в хранилище'", Объект.КодОсновногоЯзыка));
		Статус = ПоместитьИзмененныеОбъектыВХранилище();
		Если ПустаяСтрока(Статус) Тогда
			апк_Сообщить(НСтр("ru='Все захваченные измененные объекты успешно помещены в хранилище.';
				|en='Все захваченные измененные объекты успешно помещены в хранилище.'", Объект.КодОсновногоЯзыка));
		Иначе
			СтрокаСообщения = НСтр("ru='Помещение захваченных объектов в хранилище завершилось с ошибками:';
				|en='Помещение захваченных объектов в хранилище завершилось с ошибками:'", Объект.КодОсновногоЯзыка) + Символы.ПС + Статус;
			апк_Сообщить(СтрокаСообщения);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Состояние(НСтр("ru='Выполняется отмена захвата объектов в хранилище';
		|en='Выполняется отмена захвата объектов в хранилище'", Объект.КодОсновногоЯзыка));
	Статус = ОтменитьЗахватОбъектовВХранилище();
	Если ПустаяСтрока(Статус) Тогда
		апк_Сообщить(НСтр("ru='Захват неизмененных объектов в хранилище успешно отменен.';
			|en='Захват неизмененных объектов в хранилище успешно отменен.'", Объект.КодОсновногоЯзыка));
	Иначе
		СтрокаСообщения = НСтр("ru='Отмена захвата неизмененных объектов завершилась с ошибками:';
			|en='Отмена захвата неизмененных объектов завершилась с ошибками:'", Объект.КодОсновногоЯзыка) + Символы.ПС + Статус;
		апк_Сообщить(СтрокаСообщения);
	КонецЕсли;
	
	Состояние();
	
КонецПроцедуры

&НаСервере
Функция ПоместитьИзмененныеОбъектыВХранилище()
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	Статус = ДоступОбъект.ПоместитьИзмененныеОбъектыВХранилище();
	ЗначениеВРеквизитФормы(ДоступОбъект, "Объект");
	
	Возврат Статус;
	
КонецФункции

&НаСервере
Функция ОтменитьЗахватОбъектовВХранилище()
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	Статус = ДоступОбъект.ОтменитьЗахватОбъектовВХранилище();
	ЗначениеВРеквизитФормы(ДоступОбъект, "Объект");
	
	Возврат Статус;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыПриведенияКСтандартам

&НаСервере
Процедура ПривестиКонфигурациюКСтандартамНаСервере(Знач ЗначениеФлагов)
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	ДоступОбъект.ПривестиКонфигурациюКСтандартам(ЗначениеФлагов);
	ЗначениеВРеквизитФормы(ДоступОбъект, "Объект");
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьРезультатНаСервере(Знач СтруктураОтбораОбъектов)
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	ДоступОбъект.ЗаполнитьРезультат(СтруктураОтбораОбъектов);
	ЗначениеВРеквизитФормы(ДоступОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуСтандартовИзМакетаНаСервере()
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	ТаблицаСтандартов = ДоступОбъект.ПолучитьТаблицуСтандартовИзМакета();
	ЗначениеВРеквизитФормы(ДоступОбъект, "Объект");
	
	Возврат ТаблицаСтандартов;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоСтандартовПоУмолчанию()
	
	ДеревоСтандартов = РеквизитФормыВЗначение("Стандарты");
	
	ТаблицаСтандартов = ПолучитьТаблицуСтандартовИзМакетаНаСервере();
	
	Для Каждого СтрокаТаблицы Из ТаблицаСтандартов Цикл
		
		КлючРодителя = СтрокаТаблицы.КлючРодителя;
		
		// Если ключ родителя не заполнен, то добавляем в корень дерева.
		Если ПустаяСтрока(КлючРодителя) Тогда
			ВеткаРодителя = ДеревоСтандартов;
		Иначе
			// Иначе ищем ветку родителя среди существующих по ключу.
			ВеткаРодителя = ДеревоСтандартов.Строки.Найти(КлючРодителя, "Ключ", Истина);
			Если ВеткаРодителя = Неопределено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ВеткаСтандарта = ВеткаРодителя.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(ВеткаСтандарта, СтрокаТаблицы);
		
		ВеткаСтандарта.Флаг = НЕ ПустаяСтрока(СтрокаТаблицы.ВыбранПоУмолчанию);
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоСтандартов, "Стандарты");
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыЗапускаПоУмолчанию()
	
	ПараметрыАвтоформатирования = Новый Структура;
	ПараметрыАвтоформатирования.Вставить("ЗагрузитьКонфигурациюИзXML", Истина);
	ПараметрыАвтоформатирования.Вставить("ПоказатьРезультат", Ложь);
	ПараметрыАвтоформатирования.Вставить("ЭтоПакетныйЗапуск", Ложь);
	ПараметрыАвтоформатирования.Вставить("ЗапуститьИЗавершить", Ложь);
	
	Возврат ПараметрыАвтоформатирования;
	
КонецФункции

&НаКлиенте
Процедура АвтоформатироватьКод(ПараметрыАвтоформатированияПоУмолчанию = Неопределено)
	
	Если ПараметрыАвтоформатированияПоУмолчанию = Неопределено Тогда
		ПараметрыАвтоформатированияПоУмолчанию = ПолучитьПараметрыЗапускаПоУмолчанию();
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НачатьАвтоформатированиеКода", ЭтотОбъект, ПараметрыАвтоформатированияПоУмолчанию);
	ПараметрыАвтоформатирования = Новый Структура("Обработчик", ОписаниеОповещения);
	
	ПроверитьНастройкиПодключения(ПараметрыАвтоформатирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНастройкиПодключения(ПараметрыАвтоформатирования)
	
	ТекстОшибки = "";
	
	ПутьКБазе = ОтредактироватьПутьККаталогу(Объект.ПутьКФайловойБазе) + "1Cv8.1CD";
	
	Если Объект.ТипИсточника = 0 Тогда
		
		Если ПустаяСтрока(Объект.ПутьКФайловойБазе) Тогда
			ТекстОшибки = НСтр("ru='Поле ""Каталог информационной базы"" не заполнено';
				|en='Поле ""Каталог информационной базы"" не заполнено'", Объект.КодОсновногоЯзыка);
		Иначе
			ТекстОшибки = НСтр("ru='Информационной базы по указанному пути не существует';
				|en='Информационной базы по указанному пути не существует'", Объект.КодОсновногоЯзыка);
			
			ПараметрыАвтоформатирования.Вставить("ТекстОшибки",               ТекстОшибки);
			ПараметрыАвтоформатирования.Вставить("ПроверкаПутиКФайловойБазе", Истина);
			ПроверитьСуществованияФайлаНаКлиенте(ПутьКБазе, ПараметрыАвтоформатирования);
			Возврат;
		КонецЕсли;
		
	ИначеЕсли Объект.ТипИсточника = 1 Тогда
		
		Если ПустаяСтрока(КластерБазы) И ПустаяСтрока(ИмяБазы) Тогда
			ТекстОшибки = НСтр("ru='Не заполнены поля ""Кластер серверов 1С:Предприятия"" и ""Имя информационной базы в кластере""';
				|en='Не заполнены поля ""Кластер серверов 1С:Предприятия"" и ""Имя информационной базы в кластере""'", Объект.КодОсновногоЯзыка);
		ИначеЕсли ПустаяСтрока(КластерБазы) Тогда
			ТекстОшибки = НСтр("ru='Не заполнено поле ""Кластер серверов 1С:Предприятия""';
				|en='Не заполнено поле ""Кластер серверов 1С:Предприятия""'", Объект.КодОсновногоЯзыка);
		ИначеЕсли ПустаяСтрока(ИмяБазы) Тогда
			ТекстОшибки = НСтр("ru='Не заполнено поле ""Имя информационной базы в кластере""';
				|en='Не заполнено поле ""Имя информационной базы в кластере""'", Объект.КодОсновногоЯзыка);
		Иначе
			Объект.ПутьКБазе = "Srvr=""" + КластерБазы + """;Ref=""" + ИмяБазы + """";
		КонецЕсли;
		
	ИначеЕсли Объект.ТипИсточника = 2 Тогда
		
		Если ПустаяСтрока(Объект.КаталогВыгрузкиРезультат) Тогда
			ТекстОшибки = НСтр("ru='Не заполнено поле ""Каталог выгрузки файлов XML""';
				|en='Не заполнено поле ""Каталог выгрузки файлов XML""'", Объект.КодОсновногоЯзыка);
		Иначе
			ОтредактироватьПутьККаталогу(Объект.КаталогВыгрузкиРезультат);
			ТекстОшибки = НСтр("ru='Каталог выгрузки файлов XML по указанному пути не существует';
				|en='Каталог выгрузки файлов XML по указанному пути не существует'", Объект.КодОсновногоЯзыка);
			
			ПараметрыАвтоформатирования.Вставить("ТекстОшибки", ТекстОшибки);
			ПроверитьСуществованияФайлаНаКлиенте(Объект.КаталогВыгрузкиРезультат, ПараметрыАвтоформатирования);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		апк_Сообщить(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Если ПараметрыАвтоформатирования.Свойство("Обработчик") Тогда
		ВыполнитьОбработкуОповещения(ПараметрыАвтоформатирования.Обработчик, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьАвтоформатированиеКода(Результат, ДополнительныеПараметры) Экспорт
	
	Сообщить(НСтр("ru='Запущено автоматическое форматирование кода.';en='Запущено автоматическое форматирование кода.'"));

	ЗагрузитьКонфигурациюИзXML = Истина;
	ДополнительныеПараметры.Свойство("ЗагрузитьКонфигурациюИзXML", ЗагрузитьКонфигурациюИзXML);
	
	ЭтоПакетныйЗапуск = ДополнительныеПараметры.ЭтоПакетныйЗапуск;
	
	// Проверим наличие платформы на сервере.
	Если НЕ ФайлСуществуетНаСервере(Объект.СтрокаЗапускаПлатформы) Тогда
		ЗаписатьКритическуюОшибку(НСтр("ru='На сервере не найден файл запуска платформы по пути:';
			|en='На сервере не найден файл запуска платформы по пути:'", Объект.КодОсновногоЯзыка) + Символы.ПС + Объект.СтрокаЗапускаПлатформы,,
			ЭтоПакетныйЗапуск);
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	// Установим флаг выгрузки и загрузки в зависимости от типа источника.
	Объект.ВыгружатьКонфигурациюВФайлыXML = (Объект.ТипИсточника <> 2);
	Если НЕ Объект.ВыгружатьКонфигурациюВФайлыXML Тогда
		Объект.ЗагружатьКонфигурациюИзФайловXML = Ложь;
	КонецЕсли;
	
	ХранилищеУказано = НЕ ПустаяСтрока(Объект.КаталогХранилища);
	
	Если Объект.ВыгружатьКонфигурациюВФайлыXML И ХранилищеУказано Тогда
		// Если флаг "Помещать обработанные объекты в хранилище" установлен, то подключаемся к хранилищу
		// и пытаемся захватить в нем все объекты.
		Если Объект.ПомещатьИзмененныеОбъектыВХранилище Тогда
			Состояние(НСтр("ru='Выполняется подключение конфигурации к хранилищу';
				|en='Выполняется подключение конфигурации к хранилищу'", Объект.КодОсновногоЯзыка));
			Статус = ПодключитьКонфигурациюКХранилищу();
			
			Если ПустаяСтрока(Статус) Тогда
				апк_Сообщить(НСтр("ru='Конфигурация успешно подключена к хранилищу.';
					|en='Конфигурация успешно подключена к хранилищу.'", Объект.КодОсновногоЯзыка));
			Иначе
				ЗаписатьКритическуюОшибку(Статус,, ЭтоПакетныйЗапуск);
				Возврат;
			КонецЕсли;
			
			Состояние(НСтр("ru='Выполняется захват объектов конфигурации в хранилище';
				|en='Выполняется захват объектов конфигурации в хранилище'", Объект.КодОсновногоЯзыка));
			Статус = ЗахватитьОбъектыКонфигурацииВХранилище();
			
			Если ПустаяСтрока(Статус) Тогда
				апк_Сообщить(НСтр("ru='Объекты конфигурации успешно захвачены в хранилище.';
					|en='Объекты конфигурации успешно захвачены в хранилище.'", Объект.КодОсновногоЯзыка));
			Иначе
				ЗаписатьКритическуюОшибку(Статус,, ЭтоПакетныйЗапуск);
				Возврат;
			КонецЕсли;
		Иначе
			// Если флаг не установлен, то только загружаем конфигурацию из хранилища.
			Состояние(НСтр("ru='Выполняется загрузка конфигурации из хранилища';
				|en='Выполняется загрузка конфигурации из хранилища'", Объект.КодОсновногоЯзыка));
			Статус = ЗагрузитьКонфигурациюИзХранилища();
			
			Если ПустаяСтрока(Статус) Тогда
				апк_Сообщить(НСтр("ru='Конфигурация успешно загружена из хранилища.';
					|en='Конфигурация успешно загружена из хранилища.'", Объект.КодОсновногоЯзыка));
			Иначе
				ЗаписатьКритическуюОшибку(Статус,, ЭтоПакетныйЗапуск);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ВыгружатьКонфигурациюВФайлыXML Тогда
		Состояние(НСтр("ru='Выполняется выгрузка конфигурации в файлы XML';
			|en='Выполняется выгрузка конфигурации в файлы XML'", Объект.КодОсновногоЯзыка));
	КонецЕсли;
	
	Статус = ВыгрузитьКонфигурациюВФайлыXML();
	
	Если Объект.ВыгружатьКонфигурациюВФайлыXML Тогда
		Если ПустаяСтрока(Статус) Тогда
			апк_Сообщить(НСтр("ru='Выгрузка конфигурации в файлы XML завершена.';
				|en='Выгрузка конфигурации в файлы XML завершена.'", Объект.КодОсновногоЯзыка));
			Состояние();
		Иначе
			ЗаписатьКритическуюОшибку(Статус,, ЭтоПакетныйЗапуск);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьПравилаПоддержкиНаСервере();
	
	СтруктураОтбораОбъектовДляАвтоформатирования = Новый Структура;
	СтруктураОтбораОбъектовДляАвтоформатирования.Вставить("МассивВыбранныхОбъектов", СписокВыбранныхОбъектов.ВыгрузитьЗначения());
	СтруктураОтбораОбъектовДляАвтоформатирования.Вставить("МассивВключенныхПодсистем", СписокВключенныхПодсистем.ВыгрузитьЗначения());
	СтруктураОтбораОбъектовДляАвтоформатирования.Вставить("МассивИсключенныхПодсистем", СписокИсключенныхПодсистем.ВыгрузитьЗначения());
	ЗаполнитьРезультатНаСервере(СтруктураОтбораОбъектовДляАвтоформатирования);
	
	апк_Сообщить(НСтр("ru='Начало приведения конфигурации к стандартам.';
		|en='Начало приведения конфигурации к стандартам.'", Объект.КодОсновногоЯзыка));
	
	ЗначениеФлагов = ПолучитьЗначениеФлагов();
	ПривестиКонфигурациюКСтандартамНаСервере(ЗначениеФлагов);
	
	апк_Сообщить(НСтр("ru='Приведение конфигурации к стандартам завершено.';
		|en='Приведение конфигурации к стандартам завершено.'", Объект.КодОсновногоЯзыка));
	
	СохранитьТаблицуИзмененныхОбъектовВФайлНаСервере();
	
	ЗаполнитьПравилаПоддержкиДляИзмененныхОбъектовНаСервере();
	
	СформироватьСписокИзмененныхФайлов();
	
	Если ЗагрузитьКонфигурациюИзXML И Объект.ЗагружатьКонфигурациюИзФайловXML Тогда
		
		ЗагрузкаФайловXMLПрошлаУспешно = Неопределено;
		
		Состояние(НСтр("ru='Выполняется загрузка конфигурации из файлов XML';
			|en='Выполняется загрузка конфигурации из файлов XML'", Объект.КодОсновногоЯзыка));
		ЗагрузитьКонфигурациюИзФайловXMLИОбновить(ЗагрузкаФайловXMLПрошлаУспешно);
		Состояние();
		
		ПоместитьИзмененныеОбъектыВХранилищеИОтменитьЗахват(ЗагрузкаФайловXMLПрошлаУспешно);
		
		Объект.Результат.Очистить();
		
		ОчиститьКаталогиВыгрузки("");
		
	КонецЕсли;
	
	Если ДополнительныеПараметры.ПоказатьРезультат Тогда
		
		МассивИмениФормы = СтрРазделить(ИмяФормы, ".");
		Если МассивИмениФормы.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ВидОбработки = МассивИмениФормы[0];
		
		Параметр = Новый Структура("Объект", Объект);
		ОткрытьФорму(СтрШаблон("%1.АвтоформатированиеКодаИЛокализация.Форма.Результат", ВидОбработки), Параметр);
		
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ЭтоПакетныйЗапуск") И ДополнительныеПараметры.ЭтоПакетныйЗапуск Тогда
		ЗаписатьЛогАвтоформатирования();
		ПрекратитьРаботуСистемы();
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ЗапуститьИЗавершить") И ДополнительныеПараметры.ЗапуститьИЗавершить Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСуществованияФайлаНаКлиенте(ИмяФайла, ДополнительныеПараметры)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПроверкиСуществованияФайла", ЭтотОбъект, ДополнительныеПараметры);
	
	Файл = Новый Файл(ИмяФайла);
	Файл.НачатьПроверкуСуществования(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПроверкиСуществованияФайла(Существует, ДополнительныеПараметры) Экспорт
	
	Если НЕ Существует Тогда
		ЭтоПакетныйЗапуск = ДополнительныеПараметры.Обработчик.ДополнительныеПараметры.ЭтоПакетныйЗапуск;
		ЗаписатьКритическуюОшибку(ДополнительныеПараметры.ТекстОшибки,, ЭтоПакетныйЗапуск);
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ПроверкаПутиКФайловойБазе") И ДополнительныеПараметры.ПроверкаПутиКФайловойБазе Тогда
		Объект.ПутьКБазе = Объект.ПутьКФайловойБазе;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("Обработчик") Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.Обработчик, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗначениеФлагов()
	
	ЗначениеФлагов = Новый Структура;
	
	Для Каждого ТекущийСтандарт Из Стандарты.ПолучитьЭлементы() Цикл
		
		ЗначениеФлагов.Вставить(ТекущийСтандарт.Ключ, ТекущийСтандарт.Флаг);
		
		Для Каждого ПодчиненныйСтандарт Из ТекущийСтандарт.ПолучитьЭлементы() Цикл
			ЗначениеФлагов.Вставить(ПодчиненныйСтандарт.Ключ, ПодчиненныйСтандарт.Флаг);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ЗначениеФлагов;
	
КонецФункции

&НаКлиенте
Процедура апк_Сообщить(Знач ТекстСообщения, Статус = Неопределено)
	
	Если Статус = Неопределено Тогда
		Статус = СтатусСообщения.Обычное;
	КонецЕсли;
	
	ТекстСообщения = "[" + ТекущаяДата() + "]: " + ТекстСообщения;
	Сообщить(ТекстСообщения, Статус);
	
	ЖурналАвтоформатирования = ЖурналАвтоформатирования + Символы.ПС + ТекстСообщения;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКритическуюОшибку(Знач ТекстСообщения, Статус = Неопределено, ЭтоПакетныйЗапуск = Ложь)
	
	апк_Сообщить(ТекстСообщения, Статус);
	
	Если НЕ ЭтоПакетныйЗапуск Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьОшибкуДляСППР(ТекстСообщения);
	
	ЗаписатьЛогАвтоформатирования();
	ПрекратитьРаботуСистемы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОшибкуДляСППР(Знач ОписаниеОшибки)
	
	Если ПустаяСтрока(Объект.КаталогФайловОшибокСППР) Тогда
		Объект.КаталогФайловОшибокСППР = ПутьКПапкеОбработкиНаСервере();
	КонецЕсли;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СформироватьXMLФайлОшибки(НСтр("ru='Обработка АвтоформатированиеКодаИЛокализация';
		|en='Обработка АвтоформатированиеКодаИЛокализация'", Объект.КодОсновногоЯзыка), ОписаниеОшибки,
		Объект.ПутьКФайлуНастроекАвтоформатирования);
	
КонецПроцедуры

&НаСервере
Функция ПутьКПапкеОбработкиНаСервере()
	
	ПутьКОбработке = ПолноеИмяФайлаЭтойОбработки();
	
	МассивПутьКОбработке = СтрРазделить(ПутьКОбработке, ПолучитьРазделительПути());
	МассивПутьКОбработке.Удалить(МассивПутьКОбработке.ВГраница());
	ПутьКПапкеОбработки = СтрСоединить(МассивПутьКОбработке, ПолучитьРазделительПути());
	
	Если НЕ СтрЗаканчиваетсяНа(ПутьКПапкеОбработки, ПолучитьРазделительПути()) Тогда
		ПутьКПапкеОбработки = ПутьКПапкеОбработки + ПолучитьРазделительПути();
	КонецЕсли;
	
	Возврат ПутьКПапкеОбработки;
	
КонецФункции

&НаСервере
Функция ПолноеИмяФайлаЭтойОбработки()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Если Метаданные.НайтиПоТипу(ТипЗнч(ОбработкаОбъект)) <> Неопределено Тогда
		Возврат ПолучитьКаталогВременныхФайлов();
	КонецЕсли;
	
	Если СтрНайти(ОбработкаОбъект.ИспользуемоеИмяФайла, "e1cib\tempstorage\") = 0 Тогда
		Возврат ОбработкаОбъект.ИспользуемоеИмяФайла;
	КонецЕсли;
	
	Возврат ПолучитьКаталогВременныхФайлов();
	
КонецФункции

&НаСервере
Функция ПроверитьПлатформу836()
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	Статус = ДоступОбъект.ПроверитьПлатформу836();
	ЗначениеВРеквизитФормы(ДоступОбъект, "Объект");
	
	Возврат Статус;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПравилаПоддержкиНаСервере()
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	ДоступОбъект.ЗаполнитьПравилаПоддержки();
	ЗначениеВРеквизитФормы(ДоступОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПравилаПоддержкиДляИзмененныхОбъектовНаСервере()
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	ДоступОбъект.ЗаполнитьПравилаПоддержкиДляИзмененныхОбъектов();
	ЗначениеВРеквизитФормы(ДоступОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура СохранитьТаблицуИзмененныхОбъектовВФайлНаСервере()
	
	Если ПустаяСтрока(ПутьКФайлуРезультатов) Тогда
		Возврат;
	КонецЕсли;
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	ДоступОбъект.СохранитьТаблицуИзмененныхОбъектовВФайл(ПутьКФайлуРезультатов);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИзмененныеОбъектыНезахваченныеВХранилище()
	
	// Получаем измененные объекты, которые не удалось захватить в хранилище.
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	ТаблицаИзмененныхОбъектов = ДоступОбъект.ПолучитьТаблицуИзмененныхОбъектовНаСервере(Ложь);
	ЗначениеВРеквизитФормы(ДоступОбъект, "Объект");
	
	Если ТаблицаИзмененныхОбъектов.Количество() = 0 Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ТаблицаИзмененныхОбъектов.Свернуть("Объект");
	
	Возврат ТаблицаИзмененныхОбъектов.ВыгрузитьКолонку("Объект");
	
КонецФункции

&НаКлиенте
Процедура СообщитьПользователюОбИзмененныхОбъектахНезахваченныхВХранилище()
	
	// Если не надо помещать объекты в хранилище, то выходим.
	Если (НЕ Объект.ПомещатьИзмененныеОбъектыВХранилище) ИЛИ ПустаяСтрока(Объект.КаталогХранилища) Тогда
		Возврат;
	КонецЕсли;
	
	МассивИзмененныхОбъектов = ПолучитьИзмененныеОбъектыНезахваченныеВХранилище();
	Если МассивИзмененныхОбъектов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru='Обнаружены измененные объекты, которые не удалось захватить в хранилище под указанным пользователем.
		|Изменения для этих объектов не будут загружены в хранилище.';
		|en='Обнаружены измененные объекты, которые не удалось захватить в хранилище под указанным пользователем.
		|Изменения для этих объектов не будут загружены в хранилище.'", Объект.КодОсновногоЯзыка);
	Для Каждого ИзмененныйОбъект Из МассивИзмененныхОбъектов Цикл
		ТекстСообщения = ТекстСообщения + Символы.ПС + ИзмененныйОбъект;
	КонецЦикла;
	
	апк_Сообщить(ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицыОбъекта(Знач СтруктураКонфигурацииИсточника, Знач СоставПодсистемИсточника)
	
	ТаблицаСтруктуры = СтруктураКонфигурацииИсточника.Выгрузить();
	Объект.СтруктураКонфигурации.Загрузить(ТаблицаСтруктуры);
	
	ТаблицаСоставаПодсистем = СоставПодсистемИсточника.Выгрузить();
	Объект.СоставПодсистем.Загрузить(ТаблицаСоставаПодсистем);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоличествоВыбранныхОбъектов()
	
	ТекстВеткаМетаданных = "ВеткаМетаданных";
	
	СтруктураКонфигурации = Объект.СтруктураКонфигурации;
	ВсегоСтрок = СтруктураКонфигурации.Количество();
	
	Если ВсегоСтрок = 0 Тогда
		СоставОбъектов = НСтр("ru = 'Все'; en = 'Все'", Объект.КодОсновногоЯзыка);
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТипОбъекта", ТекстВеткаМетаданных);
	
	МассивВетокМетаданных = СтруктураКонфигурации.НайтиСтроки(ПараметрыОтбора);
	КоличествоВетокМетаданных = МассивВетокМетаданных.Количество();
	
	КоличествоОбъектовКонфигурации = ВсегоСтрок - КоличествоВетокМетаданных;
	
	ТаблицаСтруктуры = СтруктураКонфигурации.Выгрузить(, "ТипОбъекта, Флаг");
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаСтруктуры);
	
	ЭлементОтбора = ПостроительЗапроса.Отбор.Добавить("ТипОбъекта");
	ЭлементОтбора.ВидСравнения = ВидСравнения.НеРавно;
	ЭлементОтбора.Значение = ТекстВеткаМетаданных;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора = ПостроительЗапроса.Отбор.Добавить("Флаг");
	ЭлементОтбора.ВидСравнения = ВидСравнения.Равно;
	ЭлементОтбора.Значение = Истина;
	ЭлементОтбора.Использование = Истина;
	
	ПостроительЗапроса.Выполнить();
	КоличествоВыбранныхОбъектовКонфигурации = ПостроительЗапроса.Результат.Выгрузить().Количество();
	
	Если (КоличествоВыбранныхОбъектовКонфигурации = 0)
		ИЛИ (КоличествоВыбранныхОбъектовКонфигурации = КоличествоОбъектовКонфигурации) Тогда
		СоставОбъектов = СтрШаблон(НСтр("ru = 'Все (%1)'; en = 'Все (%1)'", Объект.КодОсновногоЯзыка),
			КоличествоОбъектовКонфигурации);
	Иначе
		СоставОбъектов = СтрШаблон(НСтр("ru = '%1 из %2'; en = '%1 из %2'", Объект.КодОсновногоЯзыка),
			КоличествоВыбранныхОбъектовКонфигурации, КоличествоОбъектовКонфигурации);
	КонецЕсли;
	
КонецПроцедуры

#Область ЗапускАвтоформатированияИзКоманднойСтроки

&НаКлиенте
Процедура ЗапуститьАвтоформатированиеИзКоманднойСтроки()
	
	Если ПустаяСтрока(ПараметрЗапуска) Тогда
		Возврат;
	КонецЕсли;
	
	апк_ПозицияРазделителя = СтрНайти(ПараметрЗапуска, "|");
	Если апк_ПозицияРазделителя = 0 Тогда
		ФайлПараметровЗапуска = ПараметрЗапуска;
	Иначе
		ФайлПараметровЗапуска = Лев(ПараметрЗапуска, апк_ПозицияРазделителя - 1);
	КонецЕсли;
	
	РезультатЗаполнения = ЗаполнитьПараметрыАвтоформатированияИзФайла(ФайлПараметровЗапуска);
	Если НЕ РезультатЗаполнения.Успешно Тогда
		Если НЕ ПустаяСтрока(РезультатЗаполнения.ТекстОшибки) Тогда
			ЗаписатьКритическуюОшибку(РезультатЗаполнения.ТекстОшибки,, Истина);
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	ПараметрыАвтоформатирования = ПолучитьПараметрыЗапускаПоУмолчанию();
	ПараметрыАвтоформатирования.Вставить("ЭтоПакетныйЗапуск", Истина);
	
	АвтоформатироватьКод(ПараметрыАвтоформатирования);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПараметрыАвтоформатированияИзФайла(ФайлПараметровЗапуска)
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("Успешно", Ложь);
	СтруктураРезультата.Вставить("ТекстОшибки", "");
	СтруктураРезультата.Вставить("ПутьКСпискуИзмененныхФайлов", "");
	
	Если НЕ ФайлСуществуетНаСервере(ФайлПараметровЗапуска) Тогда
		СтруктураРезультата.ТекстОшибки = СтрШаблон(НСтр("ru='Файл параметров запуска не существует по пути: ""%1""';
			|en='Файл параметров запуска не существует по пути: ""%1""'", Объект.КодОсновногоЯзыка), ФайлПараметровЗапуска);
		Возврат СтруктураРезультата;
	КонецЕсли;
	
	ЭтоАрхив = Ложь;
	ИмяФайлаИзАрхива = "";
	Файл = Новый Файл(ФайлПараметровЗапуска);
	Если Файл.Расширение = ".zip" Тогда
		ИмяФайлаИзАрхива = апк_ПолучитьФайлИзАрхива(ФайлПараметровЗапуска);
		Если ПустаяСтрока(ИмяФайлаИзАрхива) Тогда
			СтруктураРезультата.ТекстОшибки = СтрШаблон(НСтр("ru='Не удалось разархивировать файл: %1';
				|en='Не удалось разархивировать файл: %1'", Объект.КодОсновногоЯзыка), ФайлПараметровЗапуска);
			Возврат СтруктураРезультата;
		КонецЕсли;
		ФайлПараметровЗапуска = ИмяФайлаИзАрхива;
	КонецЕсли;
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	ДеревоПараметров = ДоступОбъект.XML_РазобратьФайлВыгрузки(ФайлПараметровЗапуска);
	НастройкиАвтоформатирования = ДеревоПараметров.Строки.Найти(НРег("НастройкиАвтоформатирования"), "ИмяНРег");
	
	Если НастройкиАвтоформатирования = Неопределено Тогда
		СтруктураРезультата.ТекстОшибки = НСтр("ru='Файл настроек автоформатирования имеет неверную структуру';
			|en='Файл настроек автоформатирования имеет неверную структуру'", Объект.КодОсновногоЯзыка);
		Возврат СтруктураРезультата;
	КонецЕсли;
	
	Для Каждого СтрокаДерева Из НастройкиАвтоформатирования.Строки Цикл
		
		ИмяСвойства = СтрокаДерева.Имя;
		
		Если Объект.Свойство(ИмяСвойства) Тогда
			Объект[ИмяСвойства] = СтрокаДерева.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	Объект.ПутьКФайлуНастроекАвтоформатирования = ФайлПараметровЗапуска;
	
	СтрокаСпискаСтандартов = ДеревоПараметров.Строки.Найти(НРег("СтандартыДляАвтоформатирования"), "ИмяНРег", Истина);
	Если СтрокаСпискаСтандартов <> Неопределено Тогда
		
		ДеревоСтандартов = РеквизитФормыВЗначение("Стандарты", Тип("ДеревоЗначений"));
		
		ОчиститьФлагиДереваСтандартов(ДеревоСтандартов.Строки);
		
		Для Каждого СтрокаСтандарта Из СтрокаСпискаСтандартов.Строки Цикл
			СтрокаДерева = ДеревоСтандартов.Строки.Найти(СтрокаСтандарта.Значение, "Ключ", Истина);
			Если СтрокаДерева = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			СтрокаДерева.Флаг = Истина;
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(ДеревоСтандартов, "Стандарты");
		
	КонецЕсли;
	
	СтрокаСпискаОбъектов = НастройкиАвтоформатирования.Строки.Найти(НРег("ПутьКСпискуФайловДляАвтоформатирования"), "ИмяНРег");
	Если СтрокаСпискаОбъектов <> Неопределено Тогда
		МассивФайловДляФорматирования = СформироватьСписокОбъектовДляАвтоформатирования(СтрокаСпискаОбъектов.Значение);
		СписокВыбранныхОбъектов.ЗагрузитьЗначения(МассивФайловДляФорматирования);
		Сообщить(НСтр("ru='Список файлов для автоформатирования:'; en='Список файлов для автоформатирования:'")
			+ СтрСоединить(МассивФайловДляФорматирования, ","));
	КонецЕсли;
	
	СтрокаСпискаВключенныхПодсистем = НастройкиАвтоформатирования.Строки.Найти(НРег("ПутьКСпискуВключенныхПодсистем"), "ИмяНРег");
	Если СтрокаСпискаВключенныхПодсистем <> Неопределено Тогда
		МассивВключенныхПодсистем = СформироватьСписокОбъектовДляАвтоформатирования(СтрокаСпискаВключенныхПодсистем.Значение);
		СписокВключенныхПодсистем.ЗагрузитьЗначения(МассивВключенныхПодсистем);
		Сообщить(НСтр("ru='Включенные подсистемы:';en='Включенные подсистемы:'")
			+ СтрСоединить(МассивВключенныхПодсистем, ","));
	КонецЕсли;
	
	СтрокаСпискаИсключенныхПодсистем = НастройкиАвтоформатирования.Строки.Найти(НРег("ПутьКСпискуИсключенныхПодсистем"), "ИмяНРег");
	Если СтрокаСпискаИсключенныхПодсистем <> Неопределено Тогда
		МассивИсключенныхПодсистем = СформироватьСписокОбъектовДляАвтоформатирования(СтрокаСпискаИсключенныхПодсистем.Значение);
		СписокИсключенныхПодсистем.ЗагрузитьЗначения(МассивИсключенныхПодсистем); 
		Сообщить(НСтр("ru='Исключенные подсистемы:'; en='Исключенные подсистемы:'")
			+ СтрСоединить(МассивИсключенныхПодсистем, ","));
	КонецЕсли;
	
	СтрокаСпискаИзмененныхОбъектов = НастройкиАвтоформатирования.Строки.Найти(НРег("ПутьКСпискуИзмененныхФайлов"), "ИмяНРег");
	Если СтрокаСпискаИзмененныхОбъектов <> Неопределено Тогда
		СтруктураРезультата.ПутьКСпискуИзмененныхФайлов = СтрокаСпискаИзмененныхОбъектов.Значение;
	КонецЕсли;
	
	СтрокаПутьКФайлуРезультатов = НастройкиАвтоформатирования.Строки.Найти(НРег("ПутьКФайлуРезультатов"), "ИмяНРег");
	Если СтрокаПутьКФайлуРезультатов <> Неопределено Тогда
		ПутьКФайлуРезультатов = СтрокаПутьКФайлуРезультатов.Значение;
	КонецЕсли;
	
	Если ЭтоАрхив Тогда
		апк_ФайлУдалить(ИмяФайлаИзАрхива);
	КонецЕсли;
	
	СтруктураРезультата.Успешно = Истина;
	
	Возврат СтруктураРезультата;
	
КонецФункции

&НаСервере
Процедура СформироватьСписокИзмененныхФайлов()
	
	Если ПустаяСтрока(Объект.ПутьКСпискуИзмененныхФайлов) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Изменен", Истина);
	
	ТаблицаРезультат = Объект.Результат.Выгрузить(ПараметрыОтбора);
	ТаблицаРезультат.Свернуть("ПолноеИмяФайла");
	МассивИзмененныхФайлов = ТаблицаРезультат.ВыгрузитьКолонку("ПолноеИмяФайла");
	
	ИзмененныеФайлыСтрокой = СтрСоединить(МассивИзмененныхФайлов, Символы.ПС);
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.ДобавитьСтроку(ИзмененныеФайлыСтрокой);
	Попытка
		ТекстовыйДокумент.Записать(Объект.ПутьКСпискуИзмененныхФайлов);
	Исключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЛогАвтоформатирования()
	
	Если ПустаяСтрока(Объект.ПутьКФайлуЛога) Тогда
		Объект.ПутьКФайлуЛога = апк_ПолучитьИмяВременногоФайла("txt");
	КонецЕсли;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.ДобавитьСтроку(ЖурналАвтоформатирования);
	Попытка
		ТекстовыйДокумент.Записать(Объект.ПутьКФайлуЛога);
	Исключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьФлагиДереваСтандартов(КоллекцияСтрок)
	
	Для Каждого Строка Из КоллекцияСтрок Цикл
		Строка.Флаг = Ложь;
		ОчиститьФлагиДереваСтандартов(Строка.Строки);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СформироватьСписокОбъектовДляАвтоформатирования(ФайлСпискаОбъектов)
	
	МассивОбъектов = Новый Массив;
	
	Если НЕ ФайлСуществуетНаСервере(ФайлСпискаОбъектов) Тогда
		Возврат МассивОбъектов;
	КонецЕсли;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ФайлСпискаОбъектов);
	ИменаОбъектовТекстом = ТекстовыйДокумент.ПолучитьТекст();
	МассивОбъектов = СтрРазделить(ИменаОбъектовТекстом, Символы.ПС, Ложь);
	
	Возврат МассивОбъектов;
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ЗаполнитьXMLФайлНастроек(ФайлВыгрузки)
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ФайлВыгрузки);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("НастройкиАвтоформатирования");
	
	СтруктураРеквизитов = ПолучитьСтруктуруРеквизитов();
	Для Каждого ЭлементСтруктуры Из СтруктураРеквизитов Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента(ЭлементСтруктуры.Ключ);
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(ЭлементСтруктуры.Значение));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СтандартыДляАвтоформатирования");
	ЗначениеФлагов = ПолучитьЗначениеФлагов();
	Для Каждого ЗначениеФлага Из ЗначениеФлагов Цикл
		Если ЗначениеФлага.Значение Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Стандарт");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(ЗначениеФлага.Ключ));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруРеквизитов()
	
	СтруктураВозврата = Новый Структура;
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	РеквизитыОбработки = ДоступОбъект.Метаданные().Реквизиты;
	Для Каждого РеквизитОбработки Из РеквизитыОбработки Цикл
		ИмяРеквизита = РеквизитОбработки.Имя;
		ЗначениеРеквизита = Строка(ДоступОбъект[ИмяРеквизита]);
		СтруктураВозврата.Вставить(ИмяРеквизита, ЗначениеРеквизита);
	КонецЦикла;
	
	КаталогФайловОшибокСППР = ПолучитьКаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор);
	СтруктураВозврата.КаталогФайловОшибокСППР = КаталогФайловОшибокСППР;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
// Возвращает путь к каталогу временных файлов.
//
Функция ПолучитьКаталогВременныхФайлов()
	
	Каталог = ОтредактироватьПутьККаталогу(ПолучитьИмяВременногоФайла(""));
	
	Возврат Каталог;
	
КонецФункции

&НаКлиенте
Процедура УстановитьЗначениеФлагов(КоллекцияЭлементов, УстанавливаемоеЗначение)
	
	Для Каждого ЭлементКоллекции Из КоллекцияЭлементов Цикл
		ЭлементКоллекции.Флаг = УстанавливаемоеЗначение;
		УстановитьЗначениеФлагов(ЭлементКоллекции.ПолучитьЭлементы(), УстанавливаемоеЗначение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если (ТипЗнч(ВыбранныеФайлы) <> Тип("Массив")) ИЛИ (ВыбранныеФайлы.Количество() = 0) Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныйФайл = ВыбранныеФайлы[0];
	Если ДополнительныеПараметры.ДобавитьСлэш Тогда
		ВыбранныйФайл = ОтредактироватьПутьККаталогу(ВыбранныйФайл);
	КонецЕсли;
	
	Объект[ДополнительныеПараметры.ИмяРеквизита] = ВыбранныйФайл;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПослеВыбораФайлаДляВыгрузки(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если (ТипЗнч(ВыбранныеФайлы) <> Тип("Массив")) ИЛИ (ВыбранныеФайлы.Количество() = 0) Тогда
		Возврат;
	КонецЕсли;
	
	ФайлВыгрузки = ВыбранныеФайлы[0];
	
	ЭтоАрхив = Ложь;
	Файл = Новый Файл(ФайлВыгрузки);
	Если Файл.Расширение = ".zip" Тогда
		ЭтоАрхив = Истина;
		ИмяФайлаАрхива = ФайлВыгрузки;
		ФайлВыгрузки = ПолучитьИмяВременногоФайла("xml");
	КонецЕсли;
	
	ЗаполнитьXMLФайлНастроек(ФайлВыгрузки);
	
	Если ЭтоАрхив Тогда
		ЗаписьZipФайла = Новый ЗаписьZipФайла(ИмяФайлаАрхива);
		ЗаписьZipФайла.Добавить(ФайлВыгрузки);
		ЗаписьZipФайла.Записать();
		
		апк_ФайлУдалить(ФайлВыгрузки);
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru='Настройки автоформатирования выгружены.
		|Произвольный путь к каталогу файлов ошибок можно указать в теге <КаталогФайловОшибокСППР> файла настроек.';
		|en='Настройки автоформатирования выгружены.
		|Произвольный путь к каталогу файлов ошибок можно указать в теге <КаталогФайловОшибокСППР> файла настроек.'",
		Объект.КодОсновногоЯзыка);
	
	апк_Сообщить(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораОбъектовПослеПроверкиПодключения(Результат, ДополнительныеПараметры) Экспорт
	
	МассивИмениФормы = СтрРазделить(ИмяФормы, ".");
	Если МассивИмениФормы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВидОбработки = МассивИмениФормы[0];
	
	Параметр = Новый Структура("Объект", Объект);
	ОткрытьФорму(СтрШаблон("%1.АвтоформатированиеКодаИЛокализация.Форма.ВыборОбъектов", ВидОбработки), Параметр, ЭтаФорма,
		УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьКодОсновногоЯзыка()
	
	Объект.КодОсновногоЯзыка = Метаданные.ОсновнойЯзык.КодЯзыка;
	
КонецПроцедуры

#КонецОбласти