
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СвойстваИсключения = "Результат, ЗахваченныеОбъекты, ПравилаПоддержкиОбъектов, СтруктураКонфигурации, СоставПодсистем, ТаблицаИзмененныхОбъектовИСтандартов";
	ЗаполнитьЗначенияСвойств(Объект, Параметры.Объект,, СвойстваИсключения);
	
	ТаблицаРезультата = Параметры.Объект.Результат.Выгрузить();
	СформироватьТаблицуИзмененныхОбъектов(ТаблицаРезультата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ЗагрузитьВыбранныеФайлы.Доступность = (Объект.ТипИсточника <> 2);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РезультатВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "РезультатРезультат" Тогда
		
		#Если ТолстыйКлиентУправляемоеПриложение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
		
		ФайлРезультат = Объект.Результат[Элемент.ТекущиеДанные.НомерСтроки - 1].ПолноеИмяФайла;
		ФайлИсходный = СтрЗаменить(ФайлРезультат, Объект.КаталогВыгрузкиРезультат, Объект.КаталогВыгрузки);
		
		СравнениеТекстовМодулей = Новый СравнениеФайлов;
		СравнениеТекстовМодулей.ПервыйФайл = ФайлИсходный;
		СравнениеТекстовМодулей.ВторойФайл = ФайлРезультат;
		СравнениеТекстовМодулей.УчитыватьРегистр = Истина;
		СравнениеТекстовМодулей.УчитыватьРазделителиСтрок = Истина;
		СравнениеТекстовМодулей.СпособСравнения = СпособСравненияФайлов.ТекстовыйДокумент;
		СравнениеТекстовМодулей.ПоказатьРазличия();
		
		#Иначе
		
		Сообщить(НСтр("ru='Сравнение работает только в толстом клиенте';
			|en='Сравнение работает только в толстом клиенте'", Объект.КодОсновногоЯзыка));
		
		#КонецЕсли
	
	КонецЕсли;
	
	Если Поле.Имя = "РезультатПропущено" Тогда
		
		ОчиститьСообщения();
		Сообщить(Объект.Результат[Элемент.ТекущиеДанные.НомерСтроки - 1].УточнениеИсключения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтборПоПропущеннымОшибкам(Команда)
	
	Если Элементы.ОтборПоПропущеннымОшибкам.Пометка = Ложь Тогда
		
		СтруктураОтбор = Новый Структура;
		СтруктураОтбор.Вставить("ВозниклоИсключение", Истина);
		Элементы.Результат.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбор);
		Элементы.ОтборПоПропущеннымОшибкам.Пометка = Истина;
		
	Иначе
		
		Элементы.Результат.ОтборСтрок = Неопределено;
		Элементы.ОтборПоПропущеннымОшибкам.Пометка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВыбранныеФайлы(Команда)
	
	Состояние(НСтр("ru='Выполняется загрузка файлов XML в конфигурацию';
		|en='Выполняется загрузка файлов XML в конфигурацию'", Объект.КодОсновногоЯзыка));
	
	Статус = ЗагрузитьКонфигурациюИзФайловXML();
	Если ПустаяСтрока(Статус) Тогда
		апк_Сообщить(НСтр("ru='Измененные файлы XML успешно загружены в конфигурацию.';
			|en='Измененные файлы XML успешно загружены в конфигурацию.'", Объект.КодОсновногоЯзыка));
	Иначе
		СтрокаСообщения = НСтр("ru='Загрузка файлов XML завершилась с ошибками:';
			|en='Загрузка файлов XML завершилась с ошибками:'", Объект.КодОсновногоЯзыка) + Символы.ПС + Статус;
		апк_Сообщить(СтрокаСообщения);
	КонецЕсли;
	
	Если Объект.ОбновитьКонфигурациюБД Тогда
		
		Статус = ОбновитьКонфигурациюБД();
		Если ПустаяСтрока(Статус) Тогда
			апк_Сообщить(НСтр("ru='Обновление конфигурации успешно завершено.';
				|en='Обновление конфигурации успешно завершено.'", Объект.КодОсновногоЯзыка));
		Иначе
			СтрокаСообщения = НСтр("ru='Обновление конфигурации базы данных завершилось с ошибками:';
				|en='Обновление конфигурации базы данных завершилось с ошибками:'", Объект.КодОсновногоЯзыка) + " " + Символы.ПС + Статус;
			апк_Сообщить(СтрокаСообщения);
		КонецЕсли;
		
	КонецЕсли;
	
	ПоместитьИзмененныеОбъектыВХранилищеИОтменитьЗахват();
	
	Объект.Результат.Очистить();
	
	ОчиститьКаталогиВыгрузки("");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	Для Каждого СтрокаОбъекта Из Объект.Результат Цикл
		СтрокаОбъекта.Выбран = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для Каждого СтрокаОбъекта Из Объект.Результат Цикл
		СтрокаОбъекта.Выбран = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункций

&НаСервере
Процедура СформироватьТаблицуИзмененныхОбъектов(ТаблицаРезультата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ вт_Таблица
	|ИЗ
	|	&Таблица КАК Таблица
	|ГДЕ
	|	Таблица.Изменен
	|		ИЛИ Таблица.ВозниклоИсключение
	|;
	|
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	вт_Таблица КАК вт_Таблица";
	
	Запрос.УстановитьПараметр("Таблица", ТаблицаРезультата);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Объект.Результат.Загрузить(РезультатЗапроса);
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьКонфигурациюИзФайловXML()
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	Статус = ДоступОбъект.ЗагрузитьКонфигурациюИзФайловXML();
	ЗначениеВРеквизитФормы(ДоступОбъект, "Объект");
	
	Возврат Статус;
	
КонецФункции

&НаСервере
Функция ОбновитьКонфигурациюБД()
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	Статус = ДоступОбъект.ОбновитьКонфигурациюБД();
	ЗначениеВРеквизитФормы(ДоступОбъект, "Объект");
	
	Возврат Статус;
	
КонецФункции

&НаСервере
Процедура ОчиститьКаталогиВыгрузки(Знач Маска = "*")
	
	Попытка
		УдалитьФайлы(Объект.КаталогВыгрузки, Маска);
		УдалитьФайлы(Объект.КаталогВыгрузкиРезультат, Маска);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура апк_Сообщить(Знач ТекстСообщения, Статус = Неопределено)
	
	Если Статус = Неопределено Тогда
		Статус = СтатусСообщения.Обычное;
	КонецЕсли;
	
	ТекстСообщения = "[" + ТекущаяДата() + "]: " + ТекстСообщения;
	Сообщить(ТекстСообщения, Статус);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьИзмененныеОбъектыВХранилищеИОтменитьЗахват()
	
	// Если не надо помещать объекты в хранилище, то выходим.
	Если (НЕ Объект.ПомещатьИзмененныеОбъектыВХранилище) ИЛИ ПустаяСтрока(Объект.КаталогХранилища) Тогда
		Возврат;
	КонецЕсли;
	
	СообщитьПользователюОбИзмененныхОбъектахНезахваченныхВХранилище();
	
	Состояние(НСтр("ru='Выполняется загрузка измененных объектов в хранилище';
		|en='Выполняется загрузка измененных объектов в хранилище'", Объект.КодОсновногоЯзыка));
	Статус = ПоместитьИзмененныеОбъектыВХранилище();
	Если ПустаяСтрока(Статус) Тогда
		апк_Сообщить(НСтр("ru='Все захваченные измененные объекты успешно помещены в хранилище.';
			|en='Все захваченные измененные объекты успешно помещены в хранилище.'", Объект.КодОсновногоЯзыка));
	Иначе
		СтрокаСообщения = НСтр("ru='Помещение захваченных объектов в хранилище завершилось с ошибками:';
			|en='Помещение захваченных объектов в хранилище завершилось с ошибками:'", Объект.КодОсновногоЯзыка) + Символы.ПС + Статус;
		апк_Сообщить(СтрокаСообщения);
		Возврат;
	КонецЕсли;
	
	Состояние(НСтр("ru='Выполняется отмена захвата объектов в хранилище';
		|en='Выполняется отмена захвата объектов в хранилище'", Объект.КодОсновногоЯзыка));
	Статус = ОтменитьЗахватОбъектовВХранилище();
	Если ПустаяСтрока(Статус) Тогда
		апк_Сообщить(НСтр("ru='Захват объектов в хранилище успешно отменен.';
			|en='Захват объектов в хранилище успешно отменен.'", Объект.КодОсновногоЯзыка));
	Иначе
		СтрокаСообщения = НСтр("ru='Отмена захвата объектов завершилась с ошибками:';
			|en='Отмена захвата объектов завершилась с ошибками:'", Объект.КодОсновногоЯзыка) + Символы.ПС + Статус;
		апк_Сообщить(СтрокаСообщения);
	КонецЕсли;
	
	Состояние();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИзмененныеОбъектыНезахваченныеВХранилище()
	
	// Получаем измененные объекты, которые не удалось захватить в хранилище.
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	ТаблицаИзмененныхОбъектов = ДоступОбъект.ПолучитьТаблицуИзмененныхОбъектовНаСервере(Ложь);
	ЗначениеВРеквизитФормы(ДоступОбъект, "Объект");
	
	Если ТаблицаИзмененныхОбъектов.Количество() = 0 Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ТаблицаИзмененныхОбъектов.Свернуть("Объект");
	
	Возврат ТаблицаИзмененныхОбъектов.ВыгрузитьКолонку("Объект");
	
КонецФункции

&НаКлиенте
Процедура СообщитьПользователюОбИзмененныхОбъектахНезахваченныхВХранилище()
	
	// Если не надо помещать объекты в хранилище, то выходим.
	Если (НЕ Объект.ПомещатьИзмененныеОбъектыВХранилище) ИЛИ ПустаяСтрока(Объект.КаталогХранилища) Тогда
		Возврат;
	КонецЕсли;
	
	МассивИзмененныхОбъектов = ПолучитьИзмененныеОбъектыНезахваченныеВХранилище();
	Если МассивИзмененныхОбъектов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru='Обнаружены измененные объекты, которые не удалось захватить в хранилище под указанным пользователем.
		|Изменения для этих объектов не будут загружены в хранилище.';
		|en='Обнаружены измененные объекты, которые не удалось захватить в хранилище под указанным пользователем.
		|Изменения для этих объектов не будут загружены в хранилище.'", Объект.КодОсновногоЯзыка);
	Для Каждого ИзмененныйОбъект Из МассивИзмененныхОбъектов Цикл
		ТекстСообщения = ТекстСообщения + Символы.ПС + ИзмененныйОбъект;
	КонецЦикла;
	
	апк_Сообщить(ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьИзмененныеОбъектыВХранилище()
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	Статус = ДоступОбъект.ПоместитьИзмененныеОбъектыВХранилище();
	ЗначениеВРеквизитФормы(ДоступОбъект, "Объект");
	
	Возврат Статус;
	
КонецФункции

&НаСервере
Функция ОтменитьЗахватОбъектовВХранилище()
	
	ДоступОбъект = РеквизитФормыВЗначение("Объект");
	Статус = ДоступОбъект.ОтменитьЗахватОбъектовВХранилище();
	ЗначениеВРеквизитФормы(ДоступОбъект, "Объект");
	
	Возврат Статус;
	
КонецФункции

#КонецОбласти