#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ПустаяСтрока(Ответственный) Тогда
		Ответственный = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	КонецЕсли;
	
	Если ЭтоНовый() И ПустаяСтрока(ЭтотОбъект.Номер) Тогда
		
		Префикс ="ПД-";
		УникальныйНомер = СледующийНомерДокумента();
		ЭтотОбъект.Номер = Префикс + УникальныйНомер;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбщегоНазначенияСлужебныйСервер.СодержитЗарезервированныйСимвол(Литеры) Тогда
		ОбщегоНазначенияСлужебныйСервер.ИнформироватьПользователя("Строка содержит запрещенный к вводу символ.");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	СформироватьЗаписьДвиженияДляСимволовВедомости();
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Процедура СформироватьЗаписьДвиженияДляСимволовВедомости() 
	
	СимволыВДокументе = СимволыДокумента();
	
	Движения.СимволыВедомости.Записывать = Истина;
	
	Для Каждого Символ Из СимволыВДокументе Цикл
		Движение = Движения.СимволыВедомости.Добавить();
		Движение.Период = Дата;
		Движение.Символ = Символ.Ключ;
		Движение.Количество = Символ.Значение;
	КонецЦикла;
		
	Если СимволыВДокументе.Количество() = 0 Тогда 
		ОбщегоНазначенияСлужебныйСервер.ИнформироватьПользователя(
			"В константе 'ДопустимыеСимволыВедомости' не заполнено значение.");
	КонецЕсли; 
		
КонецПроцедуры 

// Функция делает подсчет количества символов строки документа, которые описаны в константе ДопустимыеСимволыВедомости.
//
// Возвращаемое значение:
//   Соответствие   - ключ: допустимый символ строки, значение: количество этого символа в строке.
//
Функция СимволыДокумента()
	
	СимволыДокументаПоКоличеству = Новый Соответствие; 
	СтрокаКонстанты = НРег(Константы.ДопустимыеСимволыВедомости.Получить());
	
	Если ПустаяСтрока(СтрокаКонстанты) Тогда
		Возврат СимволыДокументаПоКоличеству;
	КонецЕсли;
	
	СтрокаОбщихСимволов = "";
	КоличествоСимволовДокумента = СтрДлина(Литеры);
	КоличествоСимволовВДокументе = 0;
	
	Для НомерПоСтроке = 1 По СтрДлина(СтрокаКонстанты) Цикл 
		
		СимволКонстанты = НРег(Сред(СтрокаКонстанты, НомерПоСтроке, 1));
		ЭтоБуквенноЦифровойСимвол = СтрПодобнаПоРегулярномуВыражению(СимволКонстанты, "[а-яa-z0-9]");
		СимволПоиска = ?(ЭтоБуквенноЦифровойСимвол, СимволКонстанты, "\"+ СимволКонстанты);
		ОбщиеСимволы = СтрНайтиВсеПоРегулярномуВыражению(СтрокаОбщихСимволов, СимволПоиска);
		
		Если ОбщиеСимволы.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СимволаВДокументе = СтрНайтиВсеПоРегулярномуВыражению(НРег(Литеры), СимволПоиска); 
		
		Если СимволаВДокументе.Количество() > 0 Тогда
			
			КоличествоСимволовВДокументе = КоличествоСимволовВДокументе + СимволаВДокументе.Количество(); 
			
			СимволыДокументаПоКоличеству.Вставить(СимволКонстанты, СимволаВДокументе.Количество()); 
			
			СтрокаОбщихСимволов = СтрокаОбщихСимволов + СимволКонстанты;
			
		КонецЕсли
		
	КонецЦикла;
	
	КоличествоНеОбщихСиволов = КоличествоСимволовДокумента - КоличествоСимволовВДокументе;
	
	Если КоличествоНеОбщихСиволов > 0 Тогда
		СимволыДокументаПоКоличеству.Вставить("&", КоличествоНеОбщихСиволов);
	КонецЕсли;
	
	Возврат СимволыДокументаПоКоличеству;
	
КонецФункции

// Функция возвращает следующий по порядку номер для нового документа.
//
// Возвращаемое значение:
//   Строка
//
Функция СледующийНомерДокумента() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(Ведомость.Номер) КАК ПоследнийНомер
	|ИЗ
	|	Документ.Ведомость КАК Ведомость";
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		ПоследнийНомер = Число(Прав(Результат.ПоследнийНомер, 6)) + 1;
	Иначе
		ПоследнийНомер = 000001;
	КонецЕсли;
	
	Возврат Формат(ПоследнийНомер, "ЧЦ=6; ЧВН=; ЧГ=0");
	
КонецФункции

Процедура ПередУдалением(Отказ)
	КаталогСохранения = ВедомостьСервер.КаталогХраненияДоговоров();
	
	Файлы = НайтиФайлы(КаталогСохранения, Строка(ЭтотОбъект.Ссылка.УникальныйИдентификатор()) + ".xml", Ложь);
	
	Если Файлы.Количество() > 0 Тогда
		
		Попытка
			УдалитьФайлы(Файлы[0].ПолноеИмя);  
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли
КонецПроцедуры

#КонецОбласти

#Иначе 

ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");

#КонецЕсли 

