#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВывестиДоговоры(Команда)
	ВывестиДоговорыНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВывестиДоговорыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВедомостьДоговоры.Ссылка КАК ВедомостьВТ,
	|	ВЫБОР
	|		КОГДА &Величина
	|			ТОГДА МАКСИМУМ(Договоры.НачалоДействия)
	|		ИНАЧЕ МИНИМУМ(Договоры.НачалоДействия)
	|	КОНЕЦ КАК МинМакс
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	Документ.Ведомость.Договоры КАК ВедомостьДоговоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	|		ПО ВедомостьДоговоры.Договор = Договоры.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВедомостьДоговоры.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВедомостьДоговоры.Ссылка КАК Ведомость,
	|	Договоры.НачалоДействия КАК ДоговорНачалоДействия,
	|	ВременнаяТаблица.МинМакс КАК МинМакс
	|ИЗ
	|	Документ.Ведомость.Договоры КАК ВедомостьДоговоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблица КАК ВременнаяТаблица
	|		ПО (ВременнаяТаблица.ВедомостьВТ = ВедомостьДоговоры.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	|		ПО ВедомостьДоговоры.Договор = Договоры.Ссылка
	|ГДЕ
	|	ВедомостьДоговоры.НомерСтроки = 1
	|	И ВЫБОР
	|			КОГДА &Равенство
	|				ТОГДА ВременнаяТаблица.МинМакс = Договоры.НачалоДействия
	|			ИНАЧЕ НЕ ВременнаяТаблица.МинМакс = Договоры.НачалоДействия
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Равенство", Равенство);
	Запрос.УстановитьПараметр("Величина", Величина);
	
	ТабличнаяЧасть.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти
