#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СозданиеДиаграммы();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыВДиаграммеОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОчиститьФормуСпискаДоговоров();
	
	НастройкиКД = Новый НастройкиКомпоновкиДанных;
	
	ГруппаОтбора =  НастройкиКД.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.Использование = Истина;
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	Если Расшифровка = "НаУдаление" Тогда
		
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Истина;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	ИначеЕсли Расшифровка = "НеАктивные" Тогда
		
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбора.ПравоеЗначение = Истина;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Активен");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбора.ПравоеЗначение = Истина;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	ИначеЕсли Расшифровка = "Активные" Тогда
		
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбора.ПравоеЗначение = Истина;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Активен");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Истина;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ФиксированныеНастройки", НастройкиКД);
	
	ОткрытьФорму("Справочник.Договоры.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создание диаграммы по активным, не активным и помеченным на удаление договорам.
//
&НаСервере
Процедура СозданиеДиаграммы()
	
	ДанныеДляДиаграммы = ДанныеДоговоров();
	
	ДоговорыВДиаграмме.Очистить();
	
	Точка = ДоговорыВДиаграмме.УстановитьТочку("Договоры");
	
	Для Каждого СтрокаДанных Из ДанныеДляДиаграммы Цикл
		
		СтатусДоговора = СтрокаДанных.Ключ;
		
		ТретийСимвол = Сред(СтрокаДанных.Ключ, 3, 1);
		
		Если ТретийСимвол = ВРег(ТретийСимвол) Тогда
			СтатусДоговора = Лев(СтрокаДанных.Ключ, 2) + " " + НРег(Прав(СтрокаДанных.Ключ, 8));
		КонецЕсли;
		
		Серия = ДоговорыВДиаграмме.УстановитьСерию(СтатусДоговора);
		ДоговорыВДиаграмме.УстановитьЗначение(Точка, Серия, СтрокаДанных.Значение, СтрокаДанных.Ключ);
		
	КонецЦикла;
	
	ДоговорыВДиаграмме.Серии[0].Цвет = ЦветаСтиля.ДиаграммаАктивныеЦвет;
	ДоговорыВДиаграмме.Серии[1].Цвет = ЦветаСтиля.ДиаграммаНеАктивныеЦвет;
	ДоговорыВДиаграмме.Серии[2].Цвет = ЦветаСтиля.ДиаграммаНаУдалениеЦвет;
	ДоговорыВДиаграмме.ОбластьЛегенды.Расположение = РасположениеЛегендыДиаграммы.Низ;
	ДоговорыВДиаграмме.ОбластьПостроения.Расположение = РасположениеОбластиПостроенияДиаграммы.СвободноеМесто;
	ДоговорыВДиаграмме.Окантовка = Истина;
	
КонецПроцедуры

// Возвращает структуру с нужными данными для создания диаграммы.
//
// Возвращаемое значение:
//   Структура   - данные договоров для создания диаграммы.
//
&НаСервереБезКонтекста
Функция ДанныеДоговоров()
	
	ДанныеДляДиаграммы = Новый Структура("Активные, НеАктивные, НаУдаление", 0, 0, 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Договоры.ПометкаУдаления КАК ПометкаУдаления,
	|	Договоры.Активен КАК Активен
	|ИЗ
	|	Справочник.Договоры КАК Договоры";
		
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.ПометкаУдаления Тогда
			ДанныеДляДиаграммы.НаУдаление = ДанныеДляДиаграммы.НаУдаление + 1;
		ИначеЕсли ВыборкаДетальныеЗаписи.Активен Тогда
			ДанныеДляДиаграммы.Активные = ДанныеДляДиаграммы.Активные + 1;
		Иначе
			ДанныеДляДиаграммы.НеАктивные = ДанныеДляДиаграммы.НеАктивные + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДанныеДляДиаграммы;
	
КонецФункции

// Очищает форму списка договоров от значений предыдущего отбора серии из диаграммы.
//
&НаКлиенте
Процедура ОчиститьФормуСпискаДоговоров()
	
	ОткрытыеОкнаПриложения = ПолучитьОкна();
	
	Для Каждого ОкноПриложения Из ОткрытыеОкнаПриложения Цикл
		
		Если ОкноПриложения.Заголовок = "Договоры" Тогда
			
			ИдентификаторФормы = ОкноПриложения.Содержимое[0].УникальныйИдентификатор;
			
			Форма = ПолучитьФорму("Справочник.Договоры.ФормаСписка", , ИдентификаторФормы);
			Форма.Закрыть();
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти







