#Область СлужебныеПроцедурыИФункции

// Конвертирует строковые ГУИДы в тип СправочникСылка.
//
// Параметры:
//  ГУИДСтрокой  - Строка - строка содержащая ГУИДы.
//
// Возвращаемое значение:
//   ТаблицаЗначений   - коллекция ссылок договоров.
//
Функция КоллекцияДоговоровИзСтроки(КоллекцияGUID) Экспорт
	
	ТабЗначений = Новый ТаблицаЗначений;
	ТабЗначений.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.Договоры"));
		
	МассивСтрокGUID = ?(ТипЗнч(КоллекцияGUID) = Тип("Строка"), СтрРазделить(КоллекцияGUID, ";", Ложь), КоллекцияGUID);
	
	Для Каждого Строка Из МассивСтрокGUID Цикл
		
		Если СтрПодобнаПоРегулярномуВыражению(Строка, "^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$", Истина) Тогда
			
			НоваяСтрока = ТабЗначений.Добавить();
			НоваяСтрока.Договор = XMLЗначение(Тип("СправочникСсылка.Договоры"), Строка);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабЗначений;
	
КонецФункции

// Конвертирует данные из Хранилища в тип СправочникСылка.
//
// Параметры:
//  Ведомость  - СтрокаТаблицыЗначений - данные с типом ХранилищеЗначений.
//
// Возвращаемое значение:
//   ТаблицаЗначений   - коллекция ссылок договоров.
//
Функция КоллекцияДоговоровИзХранилица(Ведомость) Экспорт
	
	ТабЗначений = Новый ТаблицаЗначений;
	ТабЗначений.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	
	ТаблицаСсылокВедомостей = Ведомость.ДоговорыТаблицей.Получить();
	
	Если ТипЗнч(ТаблицаСсылокВедомостей) = Тип("ТаблицаЗначений") И
		ТаблицаСсылокВедомостей.Колонки.Найти("Договор") <> Неопределено И
		ТаблицаСсылокВедомостей.Колонки.Найти("Договор").ТипЗначения.СодержитТип(Тип("СправочникСсылка.Договоры")) Тогда
		
		ТаблицаСсылокВедомостей.Свернуть("Договор");
		
		ТабЗначений = ТаблицаСсылокВедомостей;  
	КонецЕсли;
	
	Возврат ТабЗначений;
	
КонецФункции

// Получает и возвращает значение константы.
//
// Возвращаемое значение:
//   Строка   - значение константы.
//
Функция КаталогХраненияДоговоров() Экспорт
	Возврат Константы.АдресХраненияДанныхДоговоров.Получить();
КонецФункции

#КонецОбласти

