#Область ОбработчикиКоманд

&НаКлиенте
Процедура ВыгрузитьДоговоры(Команда)
	
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Каталог = Новый ОписаниеОповещения("ПослеВыбораКаталога", ЭтотОбъект);
	Проводник.Показать(Каталог);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Завершение поиска и выбора каталога сохнаниния.
//
&НаКлиенте
Процедура ПослеВыбораКаталога(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПутьКПапке = ВыбранныеФайлы[0];
	
	ВыгрузитьДанныеВФайл(ВыбранныеФайлы[0]);
		
КонецПроцедуры 

// Экспорт и сохранение данных договоров.
//
// Параметры:
//  ИмяКаталогаДляЭкспорта  - Строка - Путь к каталогу сохранения данных договоров.
//
&НаКлиенте                                              
Процедура ВыгрузитьДанныеВФайл(ИмяКаталогаДляЭкспорта) 
	
	НазваниеФайлаСохраниния = "Договоры на " + Формат(ТекущаяДата(), "ДЛФ=ДДВ");
	
	ПодготовкаДанныхДляЭкспорта(ИмяКаталогаДляЭкспорта, НазваниеФайлаСохраниния);
	
КонецПроцедуры 

// Подготовка нужных данных договоров для экспорта в заданном формате. 
//
// Параметры:
//  ИмяКаталогаДляИмпорта  - Строка - описание пути к каталогу сохранения договоров.
//  ИмяФайла  - Строка - имя файла, куда будет выгружены данные договоров.
//
&НаСервере
Процедура ПодготовкаДанныхДляЭкспорта(ИмяКаталогаДляЭкспорта, ИмяФайла) 
	
	СписокСхема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	//СписокСхема.НаборыДанных.НаборДанныхДинамическогоСписка.Запрос = "	
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	СправочникДоговоры.Наименование КАК Наименование,
	//|	СправочникДоговоры.Активен КАК Активен,
	//|	СправочникДоговоры.НачалоДействия КАК НачалоДействия,
	//|	СправочникДоговоры.ОкончаниеДействия КАК ОкончаниеДействия
	//|ИЗ
	//|	Справочник.Договоры КАК СправочникДоговоры";	
	Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СписокСхема, 
		Настройки, , ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ПолученныеДанные = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	ПолученныеДанные.Колонки.Удалить("Код");
	СозданиеФайлаИВыгрузкаДоговоровПотоком(СокрЛП(ИмяКаталогаДляЭкспорта) + "\" + СокрЛП(ИмяФайла) + ".json", ПолученныеДанные);
	//СозданиеФайлаИВыгрузкаДоговоровСредсвамиXDTO(СокрЛП(ИмяКаталогаДляЭкспорта) + "\" + СокрЛП(ИмяФайла) + ".json", ПолученныеДанные);
	
КонецПроцедуры

// Создание файла json потоковой записью для экспорта по указанному пути и наполнение его данными договоров.
//
// Параметры:
//  ИмяФайла  - Строка - описание полного пути с названием файла для экспорта договоров.
//  ДанныеДляЭкспорта  - ТаблицаЗначений - коллекция договоров для экспорта в файл.
//
&НаСервере
Процедура СозданиеФайлаИВыгрузкаДоговоровПотоком(ПолныйПутьДляЭкспорта, ДанныеДляЭкспорта) 
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);
	ЗаписьJSON.ОткрытьФайл(ПолныйПутьДляЭкспорта, КодировкаТекста.UTF8, , ПараметрыЗаписиJSON);
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	Для Каждого Элемент Из ДанныеДляЭкспорта Цикл
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		Для Каждого Колонка Из ДанныеДляЭкспорта.Колонки Цикл
			
			ЗаписьJSON.ЗаписатьИмяСвойства(СокрЛП(Колонка.Имя));
			
			Если ТипЗнч(Элемент[Колонка.Имя]) = Тип("Дата") Тогда
				
				Дата = ?(Колонка.Имя = "НачалоДействия",
					Формат(Элемент[Колонка.Имя], "ДФ=""дд.ММ.гггг'T'ЧЧ:мм:сс"""),
					Формат(Элемент[Колонка.Имя], "ДФ=""dd.MM.yyyy"""));
				
				ЗаписьJSON.ЗаписатьЗначение(СокрЛП(Дата));
				
			ИначеЕсли	ТипЗнч(Элемент[Колонка.Имя]) = Тип("Булево") Тогда
				
				Активность = ?(Элемент[Колонка.Имя], "true", "false");
				
				ЗаписьJSON.ЗаписатьЗначение(Булево(СокрЛП(Активность)));
				
			Иначе
				
				ЗаписьJSON.ЗаписатьЗначение(СокрЛП(Элемент[Колонка.Имя]));
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		
	КонецЦикла;
	
	ЗаписьJSON.ЗаписатьКонецМассива();
	
	Попытка
		
		ЗаписьJSON.Закрыть();
		
		Информация = СтрШаблон("Файл успешно создан по адресу: '%1'.", ПолныйПутьДляЭкспорта);
		
	Исключение 
				
		Информация = СтрШаблон("Ошибка создания файла по адресу: '%1'.", ПолныйПутьДляЭкспорта);
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Запись данных в файл'"),
			УровеньЖурналаРегистрации.Ошибка, Справочники.Договоры, ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат;
		
	КонецПопытки;
		
	ОбщегоНазначенияСлужебныйСервер.ИнформироватьПользователя(Информация);
	
КонецПроцедуры

// Создание файла json средствами XDTO для экспорта по указанному пути и наполнение его данными договоров.
//
// Параметры:
//  ИмяФайла  - Строка - описание полного пути с названием файла для экспорта договоров.
//  ДанныеДляЭкспорта  - ТаблицаЗначений - коллекция договоров для экспорта в файл.
//
&НаСервере
Процедура СозданиеФайлаИВыгрузкаДоговоровСредсвамиXDTO(ПолныйПутьДляЭкспорта, ДанныеДляЭкспорта)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON( , Символы.Таб);
	ЗаписьJSON.ОткрытьФайл(ПолныйПутьДляЭкспорта, КодировкаТекста.UTF8, , ПараметрыЗаписиJSON);
	
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, ДанныеДляЭкспорта);
	
	ЗаписьJSON.Закрыть();
	
КонецПроцедуры

#КонецОбласти
