#Область ОбработчикиКоманд

&НаКлиенте
Процедура АдресХраненияДанныхДоговоровПриИзменении(Элемент)
	ПроверкаИзменяемогоКаталогаНаНаличиеФайлов();
КонецПроцедуры

&НаКлиенте
Процедура АдресХраненияДанныхДоговоровНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Проводник.Заголовок = "Выберите каталог для хранения договоров.";
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	Проводник.Показать(Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Завершение поиска и выбора файла.
//
&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.НаборКонстант.АдресХраненияДанныхДоговоров = ВыбранныеФайлы[0];
	
	ПроверкаИзменяемогоКаталогаНаНаличиеФайлов();
	
КонецПроцедуры

// Вывод диалогового окна для пользователя если изменяемый каталог не пуст.
//
&НаКлиенте
Асинх Процедура ЗадатьВопросОПродолжении()
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Ждать ВопросАсинх(НСтр("ru = 'Изменяемый каталог не пуст. Продолжить выполнение операции?'"), Режим, 0);
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		
		ЭтотОбъект.НаборКонстант.АдресХраненияДанныхДоговоров = ВедомостьСервер.КаталогХраненияДоговоров();
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

// При изменении константы проверка содержимого каталога на пустоту с диалогом для пользователя. 
//
&НаКлиенте
Процедура ПроверкаИзменяемогоКаталогаНаНаличиеФайлов()
	
	НайденныеФайлы = НайтиФайлы(ВедомостьСервер.КаталогХраненияДоговоров(), "*.xml", Ложь);
	
	Если НайденныеФайлы.Количество() > 0 Тогда
		ЗадатьВопросОПродолжении();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти




