#Область ПрограммныйИнтерфейс

#Область ОповещениеПользователя

// Сообщение, которое информирует пользователя об ошибке или важном событии. 
//
// Параметры:
//  Информация  - Строка - любая строка с нужной информацией для пользователя. 
//
Процедура ИнформироватьПользователя(Информация, Отказ = Ложь) Экспорт

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрШаблон(НСтр("ru ='%1'"), Информация);
	Сообщение.Сообщить();
	Отказ = Истина;
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Валидирует входящую строку на определенный символ.
//
// Параметры:
//  ВходящаяСтрока  - Строка - текст который нужно провалидировать.
//  КонтрольныйСимвол  - Строка - литера на наличие которого производится валидация входящей строки.
//
// Возвращаемое значение:
//   Булево   - подтверждает или отрицает наличие определенного символа среди литер строки.
//
Функция СодержитЗарезервированныйСимвол(ВходящаяСтрока, КонтрольныйСимвол = "&") Экспорт

	Возврат СтрНайти(ВходящаяСтрока, КонтрольныйСимвол) > 0;

КонецФункции

// Проверка константы на пустое значение.
// 
// Параметры:
//  НазванияКонстанты  - Строка - название константы в текстовом представлении.
//
// Возвращаемое значение:
//   Булево   - подтверждает или отрицает, что значени константы не заполнено.
//
Функция ПустоеЗначениеКонстанты(ИмяКонстанты) Экспорт
	
	Возврат ПустаяСтрока(Константы[ИмяКонстанты].Получить());
	
КонецФункции

// Возвращает склоняемую строку отражающую длительность периода между датами.
//
// Параметры:
//  ДатаС  - Дата - дата начала периода
//  ДатаПо  - Дата - дата окончания периода
//
// Возвращаемое значение:
//   Строка   - склоняемая строка вида '5л 9м 1д, 1г 11м, 8м 4д'
//
Функция ФорматированноеПолучениеРазницыДат (ДатаС, ДатаПо) Экспорт
	
	Лет = 0;
	Месяцев = 0;
	Дней = 0;
	
	Если ДатаПо > ДатаС Тогда
		
		ВременнаяДата = ДатаПо;
		
		Если День(ВременнаяДата) < День(ДатаС) Тогда
			Дней = (ВременнаяДата - ДобавитьМесяц(ВременнаяДата, -1)) / 86400;
			ВременнаяДата = ДобавитьМесяц(ВременнаяДата, -1);
		КонецЕсли;
		
		Если Месяц(ВременнаяДата) < Месяц(ДатаС) Тогда
			ВременнаяДата = ДобавитьМесяц(ВременнаяДата, -12);
			Месяцев = 12;
		КонецЕсли;
		
		Лет = Макс(Год(ВременнаяДата) - Год(ДатаС), 0);
		Месяцев = Макс(Месяцев + Месяц(ВременнаяДата) - Месяц(ДатаС), 0);
		Дней = Макс(Дней + День(ВременнаяДата) - День(ДатаС), 0);
		
		Если ДатаС <> (ДобавитьМесяц(ДатаПо, -Лет * 12 - Месяцев) - Дней * 86400) Тогда
			Дней = Дней + (День(КонецМесяца(ДатаС)) - День(НачалоМесяца(ДатаС))) - 
			 (День(КонецМесяца(ДобавитьМесяц(ДатаПо, -1))) - День(НачалоМесяца(ДобавитьМесяц(ДатаПо, -1))));
		КонецЕсли;
		
	КонецЕсли;
	
	СтрЛет = ?(Лет <> 0, СтрЗаменитьПоРегулярномуВыражению(
	 ПолучитьСклоненияСтрокиПоЧислу("год", Лет, "", "ЧС=Количественное", "ПД=Именительный; ")[0], "[^гл\d]", ""), "");
	
	СтрМесяцев = ?(Месяцев <> 0, ?(Лет <> 0, Формат(Месяцев, "ЧФ=' Чм '"), Формат(Месяцев, "ЧФ='Чм '")), "");
	
	СтрДней = ?(Дней > 0, Формат(Дней, "ЧФ='Чд '"), "");
	
	Возврат СтрЛет + СтрМесяцев + СтрДней;
	
КонецФункции

#КонецОбласти

#КонецОбласти




